{
    "docs": [
        {
            "contenturl": "https://www.washingtonpost.com/news/arts-and-entertainment/wp/2017/04/24/the-perils-of-peddling-pedestrian-productions-to-preteens/", 
            "body": "Christian Borle, surrounded by the rest of the cast of \"Charlie and the Chocolate Factory.\" (Joan Marcus) NEW YORK - What are Christian Borle and Ramin Karimloo doing in these brand-extension kiddie clunkers? Collecting hefty salaries, one hopes! Because both actors are spinning their talented wheels in overproduced musicals for young audiences that just had their official openings on Broadway. \"Charlie and the Chocolate Factory,\" with Borle (TV's \"Smash\") as criminally negligent confectioner Willy Wonka, opened Sunday night at the Lunt-Fontanne Theatre. And \"Anastasia\" offers Karimloo (Tony-nominated in 2014 for the revival of \"Les Miserables\") in the dreary role of a Communist apparatchik on the trail of an amnesiac Russian royal. It had its opening Monday night two blocks away, at the Broadhurst Theatre. Both shows are lumbering follow-ups to movies, with some numbers from the big-screen versions still attached. Both are staged by directors with distinguished résumés - Jack O'Brien for \"Charlie,\" Darko Tresnjak for \"Anastasia\" - working from scores by songwriting partnerships with deep Broadway roots. Marc Shaiman and Scott Wittman (\"Hairspray\") contribute the score for \"Charlie\" (with some tunes, including \"Candy Man,\" by Leslie Bricusse and Anthony Newley from the 1971 film \"Willy Wonka and the Chocolate Factory\"). Stephen Flaherty and Lynn Ahrens (\"Ragtime\") wrote the film and stage songbooks for \"Anastasia.\" Although they share estimable pedigrees, the musicals fail in different ways. \"Charlie and the Chocolate Factory,\" from the 1964 Roald Dahl novel, imagines itself cleverly subversive, but it's just a shrill and nasty cartoon. The production labors under the illusion that killing off irritating children in a candy factory is hilarious, when instead it comes across as one indulgent act of mean-spiritedness. A protracted Act 1 in which little Wonka-worshiping Charlie (Ryan Foust, one of three young actors alternating in the role) wins one of the golden tickets to tour Willy's factory, gives way in Act 2 to what can only be described as sugarcoated grand guignol. The funny business includes drowning in chocolate a child who would have been better directed to a meeting of Overeaters Anonymous. Borle wears a disconcerted look throughout much of the proceedings, as if he just finished a meal that didn't agree with him. I like to think he, too, wonders what he's doing there. \"Anastasia,\" based loosely on the 1997 animated movie of the same title, isn't quite as tone- deaf. It's just dull. Legend has it that when Czar Nicholas was executed along with his wife and children in the wake of the Russian Revolution, one daughter, Anastasia (played here blandly by Christy Altomare) survived. Terrence McNally's book posits the revolutionary government as fearful of a potential heiress to the monarchy reappearing and rallying the populace, and so sends Karimloo's Gleb to eliminate her. Anastasia, meanwhile, suffering from total memory loss, is recruited (coincidentally) by a pair of good-natured scammers (Derek Klena and John Bolton) who school her in royal behavior, in an effort to present her in Paris as Anastasia to the grieving Dowager Empress (Mary Beth Peil). Except she really is Anastasia. For almost certain. (Spoiler alert: Whether she is or not, the musical never makes you care.) Russia in the years after the Communist takeover apparently was not only haggard and poverty-ridden; it also was afflicted with permanent cloudy weather. Because there's just one dark day after another in the desultory St. Petersburg of \"Anastasia.\" Only when Anastasia and her confederates reach Paris - the City of Light - do Alexander Dodge's sets brighten. The show, though, has few illuminating ideas of its own: At various times, the musical interludes remind you of better moments in \"My Fair Lady,\" \"Fiddler on the Roof\" and \"Les Miz.\" Not even my daughter, who loved the movie version as a child, fell for the tortured make-believe mechanics of this \"Anastasia.\" Ramin Karimloo and Christy Altomare in \"Anastasia\" (Matthew Murphy) Anastasia, book by Terrence McNally, music by Stephen Flaherty, lyrics by Lynn Ahrens. Directed by Darko Tresnjak. Choreography, Peggy Hickey; music direction, Tom Murray; orchestrations, Doug Besterman; sets, Alexander Dodge; costumes, Linda Cho; lighting, Donald Holder; sound, Peter Hylenski; projections, Aaron Rhyne. With John Bolton, Caroline O'Connor, Mary Beth Peil. About 2 hours 35 minutes. $69-$352. At Broadhurst Theatre, 235 W. 44th St., New York. Visit telecharge.com or call 212-239-6200. Charlie and the Chocolate Factory, book by David Grieg; music by Marc Shaiman, lyrics by Shaiman and Scott Wittman. Directed by Jack O'Brien. Choreography, Joshua Bergasse; orchestrations, Doug Besterman; sets and costumes, Mark Thompson; music direction, Nicholas Skilbeck; puppets, Basil Twist. With John Rubinstein, Emily Padgett. About 2 1/2 hours. $9-$302. At Lunt-Fontanne Theatre, 205 W. 46th St., New York. Visit ticketmaster.com or call 877-250-2929.", 
            "contenttype": "Blog", 
            "source": "The Washington Post", 
            "headline": "The perils of peddling pedestrian productions to preteens", 
            "comment": [], 
            "person": [
                "Aaron Rhyne", 
                "Alexander Dodge", 
                "Caroline O'Connor", 
                "Christian Borle", 
                "Christy Altomare", 
                "Czar Nicholas", 
                "David Grieg", 
                "Donald Holder", 
                "Doug Besterman", 
                "Emily Padgett", 
                "Jack O'Brien", 
                "John Bolton", 
                "John Rubinstein", 
                "Joshua Bergasse", 
                "Les Miz", 
                "Linda Cho", 
                "Lynn Ahrens", 
                "Marc Shaiman", 
                "Mark Thompson", 
                "Mary Beth Peil", 
                "Nicholas Skilbeck", 
                "Peggy Hickey", 
                "Peter Hylenski", 
                "Scott Wittman", 
                "Stephen Flaherty", 
                "Tom Murray"
            ], 
            "theme": [
                "Mary Beth Peil", 
                "Anastasia Anastasia"
            ], 
            "primarysection": "Lifestyle", 
            "associatedbinaryurl": [
                "http://www.washingtonpost.com/blogs/style-blog/files/2017/04/Screen-Shot-2017-04-22-at-1.25.48-PM.png"
            ], 
            "organization": [
                "Russian Revolution"
            ], 
            "blurb": "Two musicals for young audiences officially open", 
            "location": [
                "NEW YORK", 
                "New York", 
                "St. Petersburg of"
            ]
        }, 
        {
            "contenturl": "https://www.washingtonpost.com/news/wonk/wp/2017/04/24/another-bad-act-on-the-part-of-the-canadians-trump-administration-launches-punitive-tariffs-on-canadian-lumber/", 
            "body": "President Trump on April 20 said Canada's trade practices on dairy, lumber, and energy are unfair to the United States. \"We're going to have to get to the negotiating table with Canada very, very quickly,\" Trump said. (The Washington Post) The Trump administration announced on Monday that it is planning to impose a roughly 20 percent tariff on softwood lumber imported from Canada, a new escalation of trade tensions with America's northern neighbor. Commerce Secretary Wilbur Ross said in an interview that his department had reached a preliminary decision to impose the tax, the administration's first major trade action against Canada. Ross portrayed the action as a tough measure to punish Canada after President Trump declared last week that \"we can't let Canada or anybody else take advantage and do what they did to our workers and to our farmers.\" \"What we are doing is dealing with another bad act on the part of the Canadians,\" Ross said. The Obama administration began the review of trade in softwood lumber last year out of concern that Canada was subsidizing its wood industry in a way that hurt U.S. rivals. The decision to impose what are known as \"countervailing duties\" in retaliation for Canada's wood subsidies, which will be announced Tuesday, is subject to a final review by the International Trade Commission, an independent federal agency that advises the government on trade policy. Yet the decision allows U.S. Customs and Border Protection to begin collecting the funds from Canadian importers immediately. Five Canadian companies were a part of the investigation, and the United States will seek to collect money from four of them retroactively for actions taken in the past 90 days, Ross said. Ross said this could amount to $1 billion in new tariffs, as well as $250 million in retroactive collections. All other Canadian softwood lumber companies will face the same tariff of 19.88 percent going forward. Softwood lumber is a major export of Canada, which sold $5.8 billion in lumber to the United States last year, giving it about 31.5 percent of the U.S. market. It's the fourth largest export from Canada to the United States after oil, gas and cars. After spending much of his presidential campaign attacking China and Mexico for their trade practices, Trump has shifted his ire toward Canada in the past week. Trump blasted Canada's recent decision to impose import taxes on ultra-filtered milk, a move he said was \"very, very unfair\" to the U.S. dairy industry. Ross said that Trump saw how hard this was hitting U.S. farmers during a recent trip to Wisconsin and was moved by their reaction. But Ross also added that the softwood lumber action was decided on its own \"merits.\" The ruling is the latest salvo in a decades-long battle between Canadian and American lumber producers. U.S. lumber producers, who are mostly based in the Northwest, have long complained that Canada unfairly subsidizes its lumber by selling wood from government land at low rates to Canadian lumber producers, leading to a loss of jobs in the United States. The Canadians have argued that, despite decades of investigations and litigation, U.S. claims about Canada's unfair practices in the lumber trade have not stood up to scrutiny at the World Trade Organization. Canada's minister of natural resources and minister of foreign affairs jointly issued a statement Monday calling the U.S. accusations against Canadian lumber \"baseless and unfounded.\" \"The Government of Canada will vigorously defend the interests of the Canadian softwood lumber industry, including through litigation... We have prevailed in the past and we will do so again,\" the statement said. Chad Bown, a senior fellow at the Peterson Institute for International Economics, predicted that the dispute would not escalate into something much bigger. \"I don't think it will be a trade war with Canada,\" Bown said. \"This is an irritant that is always there between these two countries, and Canada knows that.\" Jeffrey Schott, a former Treasury official and trade negotiator, said the tariff would likely translate into higher costs for U.S. consumers. \"This will put upward pressure on prices for the main consumer of softwood lumber, and that would be the housing industry. So the cost of housing will go up to some extent,\" he said.", 
            "contenttype": "Blog", 
            "source": "The Washington Post", 
            "headline": "‘Another bad act on the part of the Canadians’: Trump administration launches punitive tariffs on Canadian lumber", 
            "comment": [
                "Nothing better in business than to stick it to your best friend and biggest customer.", 
                "Really an opportunity because there will be enough soft wood for Canada to build a huuuge wall on their border with the USA to keep out the orange twitter chief.", 
                "Why Canada?  Is Canadian lumber really the best case of unfair subsidies?\n\nCould Trump's simultaneous order to Dept of Interior to review of National Monuments be another benefactor?   I expect an update showing that all federal lands' timber sales can be increased after they plug in the 20% higher price into their spreadsheet.\n\nAnother Trump Win-Win-Win situation.  Americans get federal lands cleared of pesky trees/regulation-loving species and the opportunity to buy more expensive houses.  Canada will sell discount lumber to China; and Canada will probably win their trade case and get back all of the tariffs.  Trump will have benefited China and will qualify for another loan and/or licensing deal.\n\nWe know he was deal-making with President Xi Jinping at the Southern Bargain House.  Does anyone really believe China banks on the benefits of a Trump promise to not call them a currency manipulator?   China can bank on cheaper Canadian lumber.", 
                "Senator Smoot and Representative Hawley, your ghosts are wanted for a meeting in the White House.", 
                "What a total bunch of nonsense.  The American dairy farmers, subsidized to the tune of $3.84 billion, are complaining.  There is a vast oversupply of milk.  The US dairy industry sold $474,770,480  of dairy to Canada in 2015.  Mexico is the biggest importer of US dairy products and Trump is pissing them off also.  I found a good explanation of the issue at : https://ipolitics.ca/2017/04/22/dairy-101-the-canada-u-s-milk-spat-explained/\n\nTrump is an idiot.", 
                "Start a trade war over Canadian wood, but ram the Keystone pipeline through to carry Canadian oil. Could there be some reason oil Is favored in the Trump cabinet?", 
                "Twenty percent tariff on lumber? There goes the house I was going to build. Thanks, Trump!", 
                "Wait until you hear about the plan for taxes on the steel reinforcing your foundation.", 
                "One of the reasons America has remained safe during the past 100 years is geography. Oceans to the west and east, and our neighbor Canada to the north and Mexico to the south. Walls and tariffs are a lousy way to treat neighbors.", 
                "\"\"Bad actors\" my royal ****\"....the Queen and subjects will not be amused at Donnie and Wilbur shaking down one of their most important  colonies so maybe there will be a tariff charged for the requested golden carriage when President Pinocchio visits the UK  in the fall. Those same bad actors were stuck with extra public security costs when the Trump boys opened  their new Vancouver hotel in February.", 
                "Since it appears that Trump goes off half-cocked whenever he visits a few US farmers who complain about Canadian milk and immediately tries to impose tariffs on Canadian products, Canada must now continue the process of FTA with China and others. There will be no shortage of potential buyers of Canadian export goods. The softwood lumber has been an irritant for decades-it is time for Canada to break it off with US and start sending their softwood to China. There are also possibilities with Mexico and Canada and China becoming tripartite trade partners.\n \nTrudeau must get some courage and realize that Trump and his stooge Ross are going to continue this \"trade war\" with Canada and other countries. Canada should begin to retaliate in ways that Trump can understand. \n\nTrade wars with countries have a carry-on effect. Canada will surely look at the US continuing Mid-East and Eastern Asian misadventures and choose not to endorse nor support the Trump military in those areas. The Trump trade war against Canada will cause Canadian citizens to rethink their vacation and business trips to US which are already diminishing. In addition, Canadians will start to look at labels on goods and choose not to buy those made in USA.", 
                "Trump is trying to destroy the country. All the executive orders he has done don't make any sense at all. Now this. How does it help the American consumer having to buy lumber at higher prices. First it was criticizing NATO, then Mexico, then China, Australia and Japan, and now we have Canada. Something is wrong upstairs or Putin keeps on threatening him that he will release the golden shower video. Where are we with the intel on Russia? Get rid of this man before he ruins the US.", 
                "I will give Trump credit for one thing, I would never have bothered to read an article about a Canadian lumber trading dispute before.", 
                "Your comment is testimony that this dispute isn't a big deal for the vast majority of Americans. Has Trump also made you aware of the plight of Wisconsin dairy farmers?", 
                "Kind of.", 
                "Not really. Interestingly, the Wikipedia entry for UF milk says the U.S. Milk producers are concerned about imports of these products, just as Canada appears to be. The Trump administration gives another complex trade issue is a facile treatment.", 
                "It's a bit easier to do battle against Canadian softwood than against North Korean nukes, right, Donald? But I wouldn't advise you to take us on when our lumber is hard!", 
                "As a proud Canadian I would like to tell Trump to GFH! Canada should look to increase market share elsewhere in the world and abandon US markets altogether. US under Trump is starting trade wars with all its business partners, and this will cause the US to be completely isolated when nobody will trust US anymore. This imbecile, so-called \"president\" is starting to take the economy apart piece by piece and millions of jobs will be lost in America. High time to impeach this traitor!", 
                "If Americans should leave the agreement with Canada intact. \nIt works to American advantage as the surplus is $11.9 billion.     American firms are not going  to pass this market up.\nNo interruption is best.\nGo after nations with trade deficits and copyright violations.", 
                "That is called a trade war and the harbinger of war. Once again all we Yanks want is everybody's\n stuff ...now hand it over....what you want something for it.....get fd", 
                "Okay deplorables, expect some time in the near future, the cost of your personal travel by vehicle to increase.\nWe buy 38% of our refined gasoline from yes, CANADA!!!\nhttps://www.eia.gov/tools/faqs/faq.php?id=727&amp;t=6", 
                "so the Secretary of Commerce calls Canadians 'bad actors'. He should take a good look his boss. Gross insults generically made to a whole nation is reviled in our countries, but apparently fair game for American representatives. The fact that his claim is a court proven lie should entitle Canadians to call him a corrupt liar...but maybe no", 
                "Drain that Swamp!", 
                "Drain it , baby...start with Conman Trump!", 
                "Is this not the bidding of the Koch Brothers and Georgia Pacific? This could not be to blatant! He wants them to back off their opposition to his Zombie Healthcare plan.", 
                "Looks like it's time to stop \"sharing\" with the United States.", 
                "When faced with a seemingly insurmountable problem Trump always responds with \"Hey, look over there.\"", 
                "Someone has to clean up the liberal mess!", 
                "Looking over there doesn't clean up anything.", 
                "Cubanissues, another uneducated Trumpanzee.\nGuess what Trumpanze? We buy 38% of our imported oil from CANADA.\nWho do you think will pay the increase in costs once Canada imposes tariffs on our gasoline imports? Well probably not you per say. Most Deplorables can't afford to buy automobiles\nhttps://www.eia.gov/tools/faqs/faq.php?id=727&amp;t=6", 
                "For years this allegation has been directed at Canada.\n\n\"...despite decades of investigations and litigation, U.S. claims about Canada’s unfair practices in the lumber trade have not stood up to scrutiny at the World Trade Organization.\"\n\nSeems Trump wants to push this unfair position.\nI imagine he asked what issues American business complain about and went from there.\nEvery Canadian is familiar with this soft wood lumber issue and how it is nothing more than some American producers wanting to be antagonistic. \nNow Trump wants to vilify Canadians.", 
                "The orange menace doesn't trust softwood lumber. He prefers concrete bought from a guy named \"Fat Tony\":\n\nhttp://www.politico.com/magazine/story/2016/05/donald-trump-2016-mob-organized-crime-213910", 
                "It is not a coincidence that the Koch Brothers own Georgia Pacific, a major soft wood grower and processor.", 
                "I think one of the brothers also bamboozled a hamburger franchise back in the 60s from some naive brothers. Gotta watch those Koch's. Are they putting softwood into Bigmacs? Get this story to Anderson Cooper!", 
                "Will help Anderson's ratings!", 
                "I thin that was Kroc not Koch?", 
                "Soft lumber huh! I knew there was something fishy about those Canadians acting all polite and stuff. First they steal thousands of jobs from perfectly good American hockey players here in America and now its soft wood, SOFT WOOD, what an outrage. Next thing you know they'll want to infiltrate America through coffee shops. Good job for Trump to finally take care of the Canadians.\n\nNext up those sneaky Swedes and their infiltration of America through crappy furniture and Allen Keys.", 
                "Canadians have Soft Wood and the U.S. has Viagra. Fair exchange I'd say...", 
                "Actually the British Commonwealth has Viagra, though we still have James Woods, Woody Harrelson, and Deadwood, not Fleetwood Mac anymore but Lindsay and Stevie are doing something.", 
                "If Canada has been using our close re;lationsjhip to take advantage or us, then so be it.  Given the fact that workers on both sides of the order might e laid-off, I sure hope that negotiation was tried firs6, rat4r than play the Quick-Draw McGraw routine, and merely try tom accomplish something price to the magi 100 Day in Office Report Card is delivered.\n\nOne other thing to keep in mind, Donald., we have two long borders with out two closest neighbors--Mexico and Canada.   You have already been unduly attacking Mexico since you announced your Candidcy, and if you do anywhere near the same with Canada, we could end-up with another hostile neighbor--and Ally, to the North, as we as the one to the South.  And remember, China and Russia have been looking for a couple of close trade relationships, with possible access to refueling and repair facilities, as well. \n\nhttps://thetruthoncommonsense.com", 
                "This is why Trump is Putin's and now Xi's useful idiot.  They will gladly pick up our long time trade partners that Donny trashes, and further weaken the US, which Donny Dunce is too stupid to get is what they want.  China was thrilled when we dropped out of the TPP.", 
                "Trump thought China was part of the TPP.", 
                "This dispute, in one form or another, has been going on for 30 years now, give or take. By and large, every time the Americans have tried to claim unfair competitive advantages and/or dumping on the part of the Cdns, they've lost. Anyone interested can see a reasonably coherent description of the whole dispute here:\n\n<b>Canada–United States softwood lumber dispute</b>\nhttps://en.wikipedia.org/wiki/Canada%E2%80%93United_States_softwood_lumber_dispute\n\nThe Trumpster sure would hate it if Canada suddenly turned off the taps on oil flowing southward....\n\nCanada, btw, is presently actively negotiating an FTA with China--and China is pushing for it. We just completed an FTA with the EU. I believe oil and lumber would be key commodities the Chinese are interested in. As an aside, Mexico is actively negotiating replacement contracts for the import of yellow corn, which is a YUUUGE, even BIGLY <i>export</i> of the US to Mexico.", 
                "We could turn off the water taps, too.  They can drink their own water", 
                "ACTUALLY, Mexico may soon be exporting water to us.", 
                "You must be the hostile neighbor to the South,  cheekos.", 
                "So, Mexico is not paying for the wall, no trade restrictions on Mexico, China is not a currency manipulator, North Korea can continue with weapons so let's pick on ... oh, Canada eh? Why not? Soft wood, soft target.\n\nThe current admin are all a bunch of a....", 
                "Well Mexico one upped the lousy negotiator, by saying FU, we will now buy our corn, wheat, soybeans and beef from Brazil and Argentina, thereby sending the idiot a clear message to stop messing with them.", 
                "He has already approved strip mining in national parks . If you harvest trees away from the highway and leave a hedge around those mines no one will notice , at least not in Manhattan .", 
                "We're picking a fight with Canada?  We haven't picked a fight with folks up north since the 1700's.  Can Trump get any dumber?", 
                "Well, there was that nasty bit of business in 1812-1814.", 
                "Actually, the US has been picking fights with Canada since the early 80s WRT softwood lumber.\n\n<b>Canada–United States softwood lumber dispute</b>\nhttps://en.wikipedia.org/wiki/Canada%E2%80%93United_States_softwood_lumber_dispute", 
                "Trump finds he is not getting anywhere trying to stick it to the Chinese or the Mexicans, so hey, lets try and humiliate the Canadians. They are friendly so would make an easy target.\n\nNever mind that this lumber issue has gone before the WTO already, and the Canadians won. Trump still calls Canada a \"disgrace,\" which is just going to make the Canadians as angry as the Mexicans. \n\nAt least Trump is consistent. He has managed to insult the neighbours on both his southern and northern borders.", 
                "I really wish the Canadians would build a wall on their border, just to keep the Trump freaks out of their country.  Hey, not all is lost though, as any country with a brutal dictator now loves us.", 
                "Well, I think (and I'm Cdn) that's a GREAT idea. We'll send the bill to Washington, eh?", 
                "The orange menace thinks that Canada sells 2x4s in plastic bags.", 
                "All kiln dried construction lumber shipped from Canada to the US is packaged in lumber wrap, which is - plastic bags.", 
                "The orange menace starts a trade war based upon something shown on Fox News at 1.47pm on a weekday.", 
                "Great move ! Home prices will start to rise soon thanks to our President.", 
                "Not to worry.  He's going to pay for the corporate tax cut by eliminating the mortgage deduction and health insurance.  Then, who'll care what the price of a house is?  We'll all be inquiring about the cost of tents.", 
                "Yeah Trump the great negotiator, already has so pizzed off our Mexican neighbors, that they are actively dealing with both Brazil and Argentina to buy their corn, wheat, soybeans, and even beef, and totally cutting out the US farmers, so the very fools who voted for this failure are going to get hit hard.  Someone should ask Iowans how they feel about this, since Mexico bought more of their corn than any other country in the world.\n\nNow, I hope that Canada gets wise, and starts doing deals with other countries too, thus cutting out America.  These hateful idiots that elected this moron need to learn a lesson, that electing an isolationist, who immediately goes about attacking our allies, while kissing up to brutal dictators, comes at a steep price, and that many of his sheep will be the ones feeling that price.", 
                "We just closed an FTA with the EU. China is actually <i>pushing</i> us (not that we need to be pushed very hard) to do an FTA with them in the next two years or so. I believe there are other FTAs being negotiated as we speak. I'm no trade expert by any stretch (I'm lucky I can spell the word) but I'm pretty convinced that if the two largest trading partners of the US make a concerted effort to NOT buy stuff from the US, it'll cause a great deal of proctological discomfort for Trump and Trumpsters.", 
                "Canada is currently negotiating an FTA with China.  Recently signed an FTA with the EU.  I expect we'll be just fine, thank you.", 
                "Despite my satiric lower post from Canadian Bacon, I like the Canadians, hope we can work this out. \n\nThe claims should be worked out in court.", 
                "This is an old dispute where a previous agreement to settle it expired.  Now that the U.S. has imposed duties on softwood lumber, the Canadians will take the dispute (like they did the last two times this happened) to the WTO and will almost certainly (like the last two times this happened) win their case.\n\nThe Canadians will then be able to punish American producers (probably oranges and California wine) of other goods with countervailing duties which will price those goods out of the market and allow producers from other countries to grab the American share of the Canadian market.\n\nThen the orange industry and California wine industry lobbyists will badger the Commerce department to settle the dispute at which point an agreement will be reached which will see the Canadians impose a small export duty on softwood lumber  and everyone will be happy except, maybe, the U.S. softwood lumber guys.", 
                "Canadian s, most of us hate drumpf. Please be calm we are hoping he is gone soon.FBI- how is that investigation going ? Independent investigation yet? Please hurry, have you noticed the mess he is making ? Still contacting my senator &amp; reps. Hope everyone else is too. Peace", 
                "Why do you hate Trump?  We didn't hate the Rob Ford clown act in Toronto.  Can't you just sit back and laugh at Bozo the President?    The guy lost an aircraft carrier last week.  How the hell do you lose an aircraft carrier?", 
                "Rob Ford was a pretend mayor with zero power who was elected as a goof, Trump was elected by a bunch of goofs and now has control of Nukes, see the difference?", 
                "Mogo89,\nWell, yes, there's that.  But laughing at him will help get him out of office.", 
                "Feel free to hate Justin Trudeau.  He is a first class idiot.", 
                "\"NAFTA will tear down trade barriers,\" Clinton said as he was signing trade agreement.\n\n\"It will create the world's  largest  trade  zone and create 200K jobs in this country by \n\n1995 alone.\"\n\nThe predictions by the people that opposed NAFTA have been far closer to what eventually happened compared to those of the 283 economist and the victorious\n\nPresident Clinton.\"    Thomas Frank", 
                "NAFTA started with President GHW Bush.", 
                "Yes. negotiated 1990-1992, signed Dec. 17, 1992.  AND it has been a net benefit to the U.S.  Canada is the country it hurt.\n\nEven a lot of the job losses the unions like to attribute to NAFTA -- most -- were lost to automation, not Mexico.  \n\nBut what do facts matter to the altered right?", 
                "Tell that to the 58 yr.old Oreo Cookie baker, or even the Ritz Cracker baker as their jobs were shipped to Mexico.", 
                "Kerry, \n\nMaybe you can pass the word onto Thomas Frank, the person you are quoting, whoever that is . . .", 
                "Oh I'll just bet it makes you so happy, that thanks to Trump our farmers will now be hurt badly, as Mexico is now going to cut out our farmers, and buy their corn, wheat, soybeans, and beef from Argentina and Brazil.  Did you know that Mexico is our biggest buyer of corn in the world, or WAS I should say?\n\nHorrible behavior has consequences, and we are going to feel a whole lot of those consequences with this horrible man as President.  These trade issues are not all as simple as many of you think.", 
                "Not certain why you continue to link me to Trump.\n\nFurthermore, it should be obvious that these \"trade deals\"\n\\are made to benefit the corporations......not the worker.\n\nBTW these \"trade deals\" have one common characteristic.....\n\nThey attempt to eliminate as many jobs as possible and drive down the wages.", 
                "Those countries will just trade with other countries, and hurt our workers.  What is it about that you can't seem to get?  Maybe you shouldn't try so hard to always attack us Dems, and Hillary, and I might not believe you to be a Trump supporter.  If you want us to be isolationists, then countries like China will be happy to take our trade partners.  Nothing in life is perfect, so grow up.", 
                "Apparently you are a genius, thank you for sharing your \"absolute\" knowledge particularly about trade issues.", 
                "\"Like maple syrup, Canada's evil oozes over the United States\"", 
                "Trump has that very special talent for making everybody hate everybody else.", 
                "Vermont doesn't stand a chance.", 
                "\"[...] <i>So the cost of housing will go up to some extent.</i>\"\n\nYa think?\n\n20% of the new homes that would've been built this year, have been iced.\n20% of the small contractors involved in housing construction are now at risk of bankruptcy.\n20% of all wood-frame construction workers are now at risk of losing their jobs.\nWell OVER 20% of all renovations planned are now iced.\nWell OVER 20% of all DIY projects are now iced.\n\nAnd the bottom line, President Narcissistic IGNORAMUS, is that your big idea will not only hurt the housing industry:\n\n<b>All US lumber suppliers are now facing a 20% cut in profits, because <i>they are the ones that'll have to pay that 20% tariff, you dumb SCHMUCK.</i></b>\n\nSummary: Trump proves yet again that he knows NOTHING about how import-export actually works.\n\nHe's a great businessman. He'll be great for the country. Yeah, right. Tell me again, how many Trump supporters are in construction?", 
                "There should be a 20% tax on cross border shopping , that will keep those Canadians out , bad actors .", 
                "Apply that tax at the checkout counter. Let cashiers demand to see proof of every shopper's residency.", 
                "Yes, let's kill the tourism industry too, since you know, there are no jobs in that industry to be lost, although, I would imagine that Florida would beg to differ, since it is a favorite winter vacation spot for Canadians.  Hey, no one ever accused you Trump voters of being critical thinkers.", 
                "1 in 18 Americans is employed directly or indirectly by  tourism. International tourism accounted for $246 billion in the US in 2015. Canadians accounted for about 30% of that number. The next biggest group of visitors to the US are Mexicans. Why are you so anxious to annoy your biggest customers in one of your largest industries.", 
                "To make America great again. That's why. Have you got a problem with making America great again by making it only for Americans?", 
                "Oh, well...increased lumber prices benefit the Trump family...no surprises here...", 
                "Because trees are like milk, they're all nature-y. Can you say Koch Brothers?", 
                "pretty sure the Trump boys will now be setting up their own lumber companies to supply lumber to the US; everything T is doing is to enrich himself and his stupid greedy family... one day we will all look back at this administration as the most corrupt and self enriching admin in history", 
                "Tramp's magic words: \"very, very unfair\". God help us all with this infantile buffoon in charge.", 
                "If the USA did what it should always have done - insisted on fair pay for all workers employed in businesses that import into the USA then it could have been a force for good and a force for quick development around the world. Instead the USA rips off its own workers and the workers of other countries and, when other countries dare to compete by ripping of their workers, the USA, with breathtaking hypocrisy, complains about it. \n\nThis is all down to the terrible, and terribly confused and irrational, ideology espoused by USA conservatives, neocons, libertarians, ann randists and those other clownish people who think they can think but are just stupid.  And the USA is the home of most of this intellectual poison.\n\nOn international trade there is only one sensible route forward - insist on liveable and fair pay among all trading nations - and watch the developing world grow to become markets for us workers while allowing us workers - and us businesses - to compete worldwide. Because, so far, the us has chosen to compete on wage costs and that is a fight that even the vicious scrooge employers of the USA will never win. \n\nFree trade needs regulated wages. Because people needs wages to live and that can never be done if you've got your head up your a.. and you're influenced by stupid right wing economic theory. Just like you can never have a practical sensible healthcare system if you're devoted to stupid ideological ideas about \"competition\" and all that other blah blah blah bs that lifeless and brain dead conservatives love.", 
                "Your comment is about 300 words longer than anything Donald Trump is able to understand.", 
                "Maybe Canada should build a big wall on its Southen Border  ,  and Ivanka Botox and Jared the Mute can pay for it every time they go there to ski .   Also The Brothers Trump ( Dumb and Dumber ) when they visit their hotel in Vancouver", 
                "Build that wall, Mr. Trudeau, and send the bill to the White House.", 
                "no, directly to the trumps.", 
                "We're going to have a lot of excess lumber so we might as well build a wall with it.  And because Justin is our leader and has drunk the climate change kool-aid, we will make sure it is insulated to at least R20.", 
                "Here's a thought for you mr. t rump, how about Canada doesn't export any lumber to the US??? We can develop more trade with all the countries you snubbed by pulling out of the TPP and you pinhead, can go F Yourself while your lumber prices go through the roof!!!", 
                "Grow up, the U.S. grows it's own lumber.   We need you people like we need a hole in the head.", 
                "US only exports $300 billion a year to Canada.  I'm sure you'll be able to make that up outta your coupon collection.", 
                "The US does not produce enough lumber to meet domestic demand. Trump is only harming the US economy. Canada will find other  markets.", 
                "Lol. Another economics illiterate.", 
                "Can we PLEASE invoke the 25th Amendment now?", 
                "Mr. Trump , big , strong , and smart ...... like tree .", 
                "...not to mention THICK.", 
                ". . . or mention that trees have crowns.", 
                "Canada and Mexico need to call this Orange Monster's bluff and start finding other markets for trade.  Mexico is negotiating with Brazil and Argentina for Ag products and Trump's supporters in the Midwest are going to find no market for corn or beef.  Canada can turn towards the EU.\n\nAnything else Trump can destroy?  He's following Bannon's plot to bring down the country.  His followers must be so proud.", 
                "Canada has a free trade agreement with Europe (CETA) and is in exploratory discussions with China about a comprehensive trade agreement. The US can no longer be considered a reliable partner.", 
                "Also Canada wisely stayed in TPP which is really a hedge against China which our stupid President refused to recognize because he has the business skill level of a 9 yr. old with a lemonade stand.", 
                "Reply to Ratbag: I didn't go bankrupt six times when I was a nine-year-old with a lemonade stand.  So quit insulting honest businesschildren by comparing them to Trump.", 
                "Who cares?  We don't need Canada or Mexico or any of these places.\n\nBut they need us, and it's time we start making them pay for that.", 
                "You don't need Canadian oil, gas, electricity, water, lumber, and auto parts? Canada is the US's largest trading partner and export market. You currently have a multi-billion surplus with us. \n\nAlright we will take our business elsewhere.\n\nGood Luck", 
                "Put down the crack pipe before posting.  You make more sense that way.\n\nKeep telling yourself that the US is the only trading partner.", 
                "These Canadians are so cute.  As if they are really important.", 
                "Every time I hear Trump complain about someone being unfair I wonder when he suddenly embraced fairness as a virtue. By his own admission he has never treated his business competitors, or his staff or contractors, with fairness. The man speaks with forked tongue.", 
                "Wow.  A gross violation of NAFTA.  The last time the US Government did this - they got sued in International Court and LOST.  Then the US Government chose to ignore the IC - the same court that the USA established in the late 1940's.\n\nDoes anyone really think that the same court will be sympathetic to Trump? \n\nWhy do these clowns think that treaties don't apply to them?", 
                "Because Barack Obama was a dingbat incompetent who didn't have the best interests of the U.S. at heart.  \n\nThat's why the Dems will NOT be getting back into power.", 
                "I hope you're just a troll amusing yourself and not someone who is so ignorant that you actually believe the crap you're posting.", 
                "Obama took Americans' best interests to heart as much as any modern president.  The economy improved and more people got health insurance under his watch.  Meanwhile Trump is cutting funding for scientific and medical research so he can lower taxes for corporations.", 
                "Lord almighty.  You're shilling for a guy who loses his aircraft carriers, can't see all the empty space in an inauguration crowd photo, and went bankrupt six times, and you're blaming Obama for what?  NAFTA?  NAFTA was signed Dec. 17, 1992, by President George Bush, you dim bulb."
            ], 
            "person": [
                "Jeffrey Schott", 
                "Wilbur Ross"
            ], 
            "theme": [
                "United States", 
                "Lumber Trade", 
                "Softwood Lumber Action", 
                "Softwood Lumber Companies", 
                "Softwood Lumber Industry"
            ], 
            "primarysection": "Business", 
            "associatedbinaryurl": [
                "http://img.washingtonpost.com/rf/image_960w/2010-2019/WashingtonPost/2012/11/20/Business/Images/515486486.jpg"
            ], 
            "organization": [
                "International Trade Commission", 
                "Peterson Institute for International Economics", 
                "World Trade Organization"
            ], 
            "blurb": "The Trump administration announced on Monday it is planning to impose a roughly 20 percent tariff on softwood lumber imported from Canada, in what may be the biggest trade dispute between the U.S. and Canada in over a decade.", 
            "location": [
                "United States"
            ]
        }, 
        {
            "contenturl": "https://www.washingtonpost.com/news/the-fix/wp/2017/04/24/bill-oreilly-sounds-like-he-is-about-to-launch-a-revenge-tour-not-an-apology-tour/", 
            "body": "Former Fox News host Bill O'Reilly said on a podcast Monday that he is \"very confident the truth will come out.\" (Richard Drew/AP) Bill O'Reilly is as defiant as ever. On the day he was originally scheduled to return to Fox News from vacation, the deposed King of Cable News spoke out on a podcast Monday night about the sexual harassment allegations that led to his ouster and hinted at a campaign to clear his name. O'Reilly's highly anticipated remarks (heavy traffic temporarily crashed his website) did not resemble the launch of an apology tour - not in the least. They sounded more like the start of a revenge tour. Here's the relevant excerpt from the podcast: I am sad that I'm not on television anymore. I was very surprised how it all turned out. I can't say a lot, because there's much stuff going on right now. But I can tell you that I'm very confident the truth will come out, and when it does, I don't know if you're going to be surprised - but I think you're going to be shaken, as I am. There's a lot of stuff involved here. Now, I can't say any more because I just don't want to influence the flow of the information. I don't want the media to take what I say and misconstrue it. However you, as a loyal O'Reilly listener, have a right to know, I think, down the lane what exactly happened. And we are working in that direction, okay? It is important to note that there is no clear reason O'Reilly \"can't say any more.\" The harassment allegations, chronicled in a New York Times report earlier this month, already have been settled. O'Reilly's reported $25 million severance from Fox News presumably precludes him from suing the network, so there is no pending litigation that we know of. When O'Reilly says \"the truth will come out,\" he is not talking about the conclusion of some ongoing lawsuit. It appears that he is talking about an effort on his part to cast himself as the victim of some kind of left-wing conspiracy. That was a strategy mulled by O'Reilly's legal team during negotiations with Fox News, according to an email obtained by Politico. It looks as if O'Reilly is determined to make the case publicly that he was unjustly targeted, smeared and ruined by his liberal detractors. Clearly we have not heard the last of O'Reilly, and he won't be sitting down to tell Barbara Walters or Oprah Winfrey how sorry he is anytime soon.", 
            "contenttype": "Blog", 
            "source": "The Washington Post", 
            "headline": "Bill O’Reilly sounds like he is about to launch a revenge tour, not an apology tour", 
            "comment": [
                "Old, unrepentant sexist pig with a big mouth. Send him down to Mar-a-Lago.", 
                "Sexual predators at the republican propaganda machine known as Fox News are highly rewarded for their actions.  Instead of going to prison O'Reilly is handed $25 million.", 
                "Bill's a great guy and is a casualty of changing times and political correctness. He truly is an anachronism from a bygone era. With that said, he crushed it and was by far the king of cable. If you think he's bye bye, I'm afraid you're about to be sadly disappointed. Bill is coming back bigger than ever to crush the little liberal girly men with a force so strong you'll be wishing he was still at Fox.", 
                "Sure he will, Cupcake. Sure he will. I'm sure you'll be first in line to get an XM subscription so you can listen to his radio show.", 
                "Did you really think he was going to fold up, magically be enlightened, sort his moral centre relative to his sex, position of power, then want to take a catharsis tour to connect with people to apologize and share his newfound emotional maturity?", 
                "\"victim of some kind of left-wing conspiracy.\" - at fox news?  Please.  I see the interview goes like this:\nHi, glad you came to interview with fox news.  I just need to clarify something  not on you resume.\nAre you a  conservative, and I need to see you voter ID card to confirm you a republican.\nPlus I need 3 political references that will confirm you are a conservative in good standing. \n\nor to put it another way:  Does fox hire liberals?", 
                "Narcissistic serial predator says every challenge to his character is baseless and that the media isn't telling the truth about what a great guy he is. What a surprise.\n\n[NB: I probably could leave the same comment beneath a few stories in today's Post.]", 
                "Only in America ... O'Reilly, a habitual, chronic, regular sexual harasser gets a $25 mil golden parachute!", 
                "LOL - liberal conspiracy to take him down.  Maybe he can borrow those investigators Trump has in Hawaii, who will be delivering explosive info about Obama's birth certificate any day now.\n\nThat's what these guys do when they get caught -- go after someone else so their cult followers won't think rationally about exactly the kind of man they follow.", 
                "LOL Fox News and the Murdochs are so liberal.", 
                "The man is a jerk and this kind never apologizes. There are many such as him and I've never ever seen the remotest possibility that they would ever understand how they offend or hurt others. Another good example is CNN's Jeffery Lord, who just the other day was on air with his black colleagues who were trying to explain to him what is like to be black in America. Never a sign of understanding, never a moment to stop and consider how inconsiderate and hurtful his attitude was. \n\nIt's true that Trump takes the prize though, just as jaxxisback says below - great comments btw. \n\nThey are going to argue and sue the hell out of St Peter (pun intended) to gain access, but I'm not sure it's going to help any at that point  - the fellow may have more reason than the part of America that pushed these obnoxious scumbags at the forefront of the county.", 
                "Bill ORLY is the American version of this arshole:  https://www.youtube.com/watch?v=flBpsyFbEOs", 
                "This guy can go right ahead and fuchimself as far as I'm concerned.  He's a disgusting, pompous gasbag who thinks he's the smartest guy in the room.  About the only time that holds true is if he's alone in a room with Trump.", 
                "Can't wait to hear Bill's Side of this. ... He, the persecuted victim. . ... Right.  it's Over Finally.", 
                "The truth is going to be much worse than anything we could've expected.", 
                "Good riddance to a worthless race baiter.", 
                "The entire O'Reilly schtick has always been pretty much just political revenge porn. Same for his audience.", 
                "Bill? Bill who?", 
                "o'reilly is a dirt-bag, just like Trump/Pence/Republicans...... like all of the dirt-bags, he will milk the faux news circuit of hate, bigotry, greed, and treason, for as long as he possibly can......", 
                "There's no hate here!", 
                "bbface2121 accepts the bigotry, greed, and treason, tho....too funny, that bbface2121, seems to not \"get\" that hate is the cornerstone of bigotry, greed, treason,and evil...... Trump/Pence/Republicans could not exist without hate.", 
                "Isn't tonight a school night?", 
                "yea, so you better go to bed......getting educated might just help you a lot............or not", 
                "He had 13million chances to live with dignity; lots of women would leap to be with him; issues is he enjoyed being a bully. breaking rules of decency and especially being a multiple offender  for sure at more than 13 millions as he himself has paid out a pretty penny for these same misogynistic actions.  O'Reilly is petty, vindication and it is easy to see how he and 45 have common abusive ground", 
                "The Con Man parked in the WH is coaching O'Reilly on the side.\n\nIt's his single area of expertise.", 
                "You hit the nail on the head. The same stunts that promise when the evidence comes out they will be vindicated, and revered again.", 
                "The George Soros-funded Media Matters has a history of conducting smear campaigns against conservative media figures.  The campaign against Bill O'Reilly was orchestrated by Media Matters &amp; Bonner Group. The Bonner Group, according to the New York Times, was paid $6 million from Hillary For America.  BG is the largest fundraiser for Media Matters in 2013 they raised $11 million for them. They also raised millions for Hillary Clinton.  The accusations against O'Reilly are baseless and obviously false.  This is a tactical ploy initiated by George Soros and his cronies to stop him from speaking the truth.", 
                "yada yada yada. O'Reilly's a perve. Good luck getting around that reality.", 
                "The George Soros-funded Media Matters has a history of conducting smear campaigns against conservative media figures. \n\n=======================================================\n\nEven if all of that is true (and I believe liberals do engage in smear campaigns) O'Reilly did this to himself.", 
                "O'Reilly sure gave 'em a whole lot to work with, Cupcake.", 
                "Yuck. Just yuck.", 
                "Bill-O hasn't learned a thing.", 
                "Shut up, O'Reilly, just SHUT UP, and go away. Forever.", 
                "I don't especially enjoy hearing  a pig squealing, but I'm going to enjoy O'Reilly's attempts to \"vindicate\" himself.  I expect his arguments to approach \"The Onion\" levels of (unintentional) humor.", 
                "Guess he's going out with a bang?", 
                "\"Now, I can’t say any more because...\"\n\nSounds like Dumb Dumb Donald's secret plan to defeat ISIL.", 
                "I know I clicked on it, but can this be the last WaPo article on O'Reilly for a while? We would all be better off if we stopped listening to anything this miserable, pathetic old man has to say.", 
                "When ever I hear Bill O’Reilly, the noun schadenfreude comes to my mind. The guy has  so much ego embedded and cultivated racism in him, he often enjoys seeing or hearing about the troubles of other people, especially people of color. The guy has spoken so much about family  ethics, and at the end he is yet another self-proclaimed guardian of values who does not care to practice what he preaches.  A Shameless hypocrite   finally gets caught and deserves it all. Who care for his apology, even if it is there, it is just writings on moving water.", 
                "George Soros-funded Media Matters has a history of conducting smear campaigns against conservative media figures like Rush Limbaugh and Glenn Beck.\n\nTheir latest target looks to be Bill O’Reilly, host of the wildly popular and number one-rated cable news program The O’Reilly Factor on Fox News. Glenn shared on radio today an email that suggests the liberal watchdog is behind the advertiser exodus from The Factor. The email is from Mary Pat Bonner of The Bonner Group.\n\n“The Bonner Group, according to the New York Times, was paid $6 million from Hillary For America and Media Matters,” Glenn said. “They are the largest fundraiser for Media Matters, at least in 2013, and raised $11 million for Media Matters. This is the Hillary super PAC group and the super PAC for Media Matters. \n\nThe Bonner group/A Super PAC and fundraiser for Hillary &amp; DNC. The Campaign against Bill OReily is orchestrated by Media Matters &amp; Bonner Group.\n\nFOX News is more honest than the rest of the main stream media.  However, they are also guilty of not reporting on some of the more repulsive actions of Hillary Clinton, Barack Obama, and their lackeys (Democrats).  Soros and his cronies are trying to sensor the media and FOX News is the last of the major media they don't completely control.  These charges are baseless and simply an attempt from the radical left to discredit them.", 
                "Concocting? What exactly is there that doesn't deserve smearing about these guys. Rush is an serial adulterer and drug abuser who while abusing drugs himself was going into racist tirades about blacks and their criminality, holding them responsible for America's drug problem while pressuring his black housekeeper to keep him supplied. \n\nO'Reilly, Milo, Ann Coulter and Limbaugh - they're all performance artists who discovered that the easiest way to fame and fortune was to tap into the resentful, paranoid psyches of America's losers and convince them all their misery is the result of elitist and liberals who have it in for them. Sounds like you took the whole bait wad.", 
                "Yeah, yeah, yeah, typical RW obsession with George Soros, who apparently is so rich that he has single-handedly brought about the end of Western Civilization.  Their fixation on the vast Soros conspiracy is amusing, but sadly lacking in intellectual power or basis in reality.", 
                "Easy now - jerks like HITINC have to have someone to hate or they wouldn't be able to get out of bed in the morning.  It's a lot easier to hate Soros than to admit that O'Reilly is a pompous scumbag.", 
                "Soros is so powerful he made Bill's little brain call all the shots.", 
                "Maybe Soros is behind Bill Clinton too :)", 
                "Revenge tour or not, sounds very much like a guy that got caught with his white, privileged zipper down and is taking a tact from the Trump playbook on responding to sexual assault allegations:\n\n\"I can’t say a lot, because there’s much stuff going on right now.\"  \"There’s a lot of stuff involved here.\"\n\nThanks for the clear insight, Billo...", 
                "When the election is over I'm going to sue all of them. Remember that?", 
                "Bill O the clown is still flapping his trap? I stopped listening.", 
                "You expected anything else from this guy?", 
                "LMAO!! \n\nDid someone actually think O'Reilly was going to apologize?", 
                "The takeaway from this sad story is that when poor innocent men like Bill O'Reilly and Roger Ailes are attacked by nasty feminazis and accused of sexual harassment, they should stand their ground and not settle.  Paying out $13 million to make sexual harassment complaints go away might lead some to suspect that Bill-O is guilty as charged.\n/s", 
                "Loofahs are talking, many loofahs...", 
                "Andrea says loofah\nBill says falafel\nLet's call the whole thing OFF!\n\nhttp://www.thesmokinggun.com/file/oreilly-falafel-suit-turns-five?page=0", 
                "What else do you expect from this despicable man?\nHe is doing exactly what he is expected to do.  His  cable show was never expected to tell or admit the truth , so why expect anything  different from his podcast? Cowards like him can never get into an honest, no holds barred debate. They hide behind their mike so that they can turn off when someone states an opposing view.  If he was man enough he would be open to debates and make his case or let the courts decide.  Money cannot buy you everything all the time... especially not the silence of women he has wronged, and those who care for their dignity more than his money.", 
                "I never understood why people watched Billy. Nor did I understand why people agreed to appear on his show. Political opinions aside, the guy was rude, obnoxious and infuriating in how he constantly interrupted guests. I gave up on his clown act long before the first sniff of sexual harassment.", 
                "Exactly!", 
                "I stopped watching him the time of the phony marijuana debate, when some poor little conservative kids complained about a speaker at their high school who made a joke. He had a kid on - a 16 year old!- who had defended the speaker and whom O'Reilly was disparaging. O'Reilly was screaming. The kid was calm. At one point the kid pointed out that what O'Reilly was saying was a direct contradiction of something O'Reilly had written in one of his books. O'Reilly was shouting and trying to bully the kid, calling him a liar. The kid proceeded to quote word for word from one of O'Reilly's books, along with the title of the book and THE PAGE NUMBER. O'Reilly was spitting nails, attacking the kid's character and calling him a liar. The kid behaved like a totally rational, mature adult. He made O'Reilly look like a lying screaming toddler. But it was jaw dropping. To just get on camera and bold face lie about something anyone could easily check and verify - man, that was it for me. And screaming at a 16 year old and essentially calling him names. Jeesh. Trump and O'Reilly. They'll stand in front of a million facts and scream that they're all just lies! Lies!", 
                "A washed has been", 
                "Some time-traveling German invented the word \"Schadenfreude\" for this specific situation", 
                "That and 'Backpfeifengesicht'.", 
                "Freude!\nFreude!\nFreude, schöner Götterfunken", 
                "He needs to go and give himself a nice cold loofah shower.", 
                "Throw in a toaster to warm things up", 
                "Now that's just mean.:)", 
                "This guy is Trump's twin brother", 
                "Sybil Fawlty shows how the women of America should react to any future tour of that disgusting arrogant pig O'Reilly.\nhttps://www.youtube.com/watch?v=O4X_bdJox8w&amp;t=2m27s", 
                "Bill that aborted dog and pony show is as weak as your seduction skills.   \n\nBig Bill O'Reilly was very full of himself, he has hundreds of millions of dollars yet could not manage to get legitimately laid.   Women find him repulsive, SAD!    Ya know Bill prostitutes are a reasonable solution for unattractive guys with money, there no shame in it as long as you treat them respectfully.  And it's actually WAY cheaper than those settlements.  Maybe it's a power thing with you?", 
                "He should either be arrested like Bill Crosby or sued into poverty.", 
                "Bill who?", 
                "You know, like that other guy, Bing Cosby.", 
                "\"Hey hey hey...beating your kids is *not* okay!\"", 
                "Good one, Kibitzer.", 
                "Is bill O'Reilly still around?", 
                "There are always a couple of rules with sexual predators and they are ALWAYS the same:  (1) they never admit anything, (2)  they never apologize, (3) it's always some sort of conspiracy against their angelic selves, (4) it's always the NASTY victim's fault, they are truly the wronged party, and last but not least, they'll do anything to shift the focus.  O'Reilly is just another garden variety pervert.  Period.", 
                "Who would have thought that Bill O'Reilly would be running a podcast to cheer up Jerry Sandusky.", 
                "Another narcissist.  Unable to recognize that he is wrong and that his personal failings are not someone else's fault.", 
                "O'Reilly: \"Other people exist?\"", 
                "\"It is important to note that there is no clear reason O’Reilly 'can't say any more.'” \n\nMaybe he's being audited.", 
                "Extra likes!", 
                "\"I don’t want the media to take what I say and misconstrue it.\"\n\n1. O'Reilly is part of the media\n2. O'Reilly wants to be the one who misconstrues what he said", 
                "Or in other words ... Welcome to the Spin Zone ...", 
                "Welcome to the No-Win Zone..."
            ], 
            "person": [
                "Bill O'Reilly", 
                "Oprah Winfrey"
            ], 
            "theme": [
                "Bill O'Reilly"
            ], 
            "primarysection": "Politics", 
            "associatedbinaryurl": [
                "http://img.washingtonpost.com/rf/image_960w/2010-2019/WashingtonPost/2017/04/19/Production/Daily/Style/Images/TV-Fox-OReilly_18807-05a3e.jpg"
            ], 
            "organization": [
                "Cable News"
            ], 
            "blurb": "We have not heard the last of the deposed King of Cable News", 
            "location": [
                "Fox News", 
                "King of"
            ]
        }, 
        {
            "contenturl": "https://www.washingtonpost.com/powerpost/white-house-confident-of-averting-shutdown-as-trump-shows-flexibility-on-wall/2017/04/24/72aa945a-2923-11e7-be51-b3fc6ff7faee_story.html", 
            "body": "The White House sought Monday to calm a jittery Washington ahead of a showdown with Congress over spending, and President Trump softened his demand that a deal to keep the federal government open include money to begin construction on his long-promised border wall. Despite one-party control at both ends of Pennsylvania Avenue, the brinkmanship that came to define spending battles in the Obama years has tumbled into the Trump era, as have the factional divisions over strategy and priorities that have gripped the GOP for a decade. But with a Friday deadline looming to pass a new spending bill, the Trump administration projected confidence that a shutdown would be avoided. In the face of fierce Democratic opposition to funding the wall's construction, White House officials signaled Monday that the president may be open to an agreement that includes money for border security if not specifically for a wall, with an emphasis on technology and border agents rather than a structure. Trump showed even more flexibility Monday afternoon, telling conservative journalists in a private meeting that he was open to delaying funding for wall construction until September, a White House official confirmed. \"The president is working hard to keep the government open,\" Treasury Secretary Steven Mnuchin told reporters Monday. White House press secretary Sean Spicer said he was \"very confident\" that an agreement would be reached by Friday, but he pointedly said he could not \"guarantee\" that a government closure would be averted. President Trump and U.S. Ambassador to the United Nations Nikki Haley arrive for a White House luncheon with ambassadors from countries on the U.N. Security Council. (Jabin Botsford/The Washington Post) At issue is whether the spending measure will explicitly allocate funds toward building a wall along the U.S.-Mexico border - a campaign promise that was a rallying cry for Trump's base and one on which he is eager to demonstrate progress by Saturday, his 100th day in office. Democrats, meanwhile, gave the White House an opening, saying they would agree to some new money for border security - so long as it did not go toward the creation of a wall, something House Minority Leader Nancy Pelosi (D-Calif.) has called \"immoral.\" In a speech on the Senate floor, Minority Leader Charles E. Schumer (D-N.Y.) blasted the idea of a wall while suggesting that a combination of smart technology and law enforcement, including the use of drones, would be \"a much more effective way to secure the border\" without hitting an impasse in Congress. Republicans were working to define Trump's campaign promise down, arguing that any form of border security would fulfill it. \"There will never be a 2,200-mile wall built, period,\" said Sen. Lindsey O. Graham (R-S.C.), a supporter of immigration reform who challenged Trump in the 2016 primaries. \"I think it's become symbolic of better border security. It's a code word for better border security. If you make it about actually building a 2,200-mile wall, that's a bridge too far - but I'm mixing my metaphors.\" Sen. Rob Portman (R-Ohio), a key appropriator and member of Senate leadership, said that \"there could be a wall in some places and technology in other places,\" implying that there would not be funding for the wall sketched out in campaign rhetoric. \"I think you're going to get a down payment on border security generally,\" he said. Trump has asked Congress for $1.5 billion in new money to start construction on the wall, and he wants an additional $2.6 billion for the fiscal year that begins in October. The wall, experts say, would cost $21.6 billion and take 3½ years to construct. Senate Minority Leader Charles E. Schumer (D-N.Y.) said technology and law enforcement, including the use of drones, would be \"a much more effective way to secure the border.\" (Melina Mara/The Washington Post) At the White House, Spicer portrayed Trump's position not as a demand but rather as one of two priorities - the other being additional military funding - in evolving negotiations with Congress. He left open the possibility that the president could agree to funding for border activities generally, such as additional fencing or drones. \"I'm not going to get ahead of the negotiations that are ongoing,\" Spicer said. Should lawmakers fail to find consensus by Friday, there are plans ready to quickly pass through the House and Senate what is referred to as a \"short-term C.R.,\" a continuing resolution to keep the government open until discussions are finalized. The Senate returned Monday night and the House returns Tuesday from a two-week recess, leaving only three days this week when both chambers will be in session. The more conciliatory language emanating from the White House did not stop Trump from continuing to hammer away on Twitter at what he claims is an urgent need for the wall. In a pair of posts, Trump sought to build public pressure on lawmakers to pass funding for wall construction. \"The Wall is a very important tool in stopping drugs from pouring into our country and poisoning our youth (and many others)!\" he wrote in a morning post. In another message several hours later, Trump wrote that if \"the wall is not built, which it will be, the drug situation will NEVER be fixed the way it should be! #BuildTheWall.\" Still, Trump has left himself wiggle room to agree to sign a government funding bill that does not include money for the wall. \"My base understands the wall is going to get built, whether I have it funded here or if I get it funded shortly thereafter,\" Trump said in a recent interview with the Associated Press. \"That wall's getting built, okay? One hundred percent.\" Asked if he would sign a bill without wall funding, Trump told the news service, \"I just don't know yet.\" The debate over wall funding is just one of several moving pieces congressional leaders are trying to address this week to avoid a partial government shutdown. In 2015, President Barack Obama made a deal with congressional lawmakers to fund government operations through April 28, 2017. If a new agreement isn't reached by then, many federal employees will stop being paid, national parks will close, and a number of other changes will kick in - as in 2013, the last time the government shut down. Since new rules about spending bills went into place after Jimmy Carter's administration, a government shutdown has never occurred when a single political party has controlled the White House and both chambers of Congress. Paramount for many Republican lawmakers is funding the government, as opposed to the wall specifically. If the government shuts down, they fear, voters could blame the GOP for failing to govern, and the party could suffer the consequences in the 2018 midterm elections. \"I'd like to make it as clean as we can and fund the government,\" said Sen. Richard C. Shelby (R-Ala.). \"I wouldn't mind funding the wall, but it's a question of what we can do. The question is, what's doable and will we make the deadline?\" Sen. James E. Risch (R-Idaho) said that an effective \"wall\" along the border had been \"authorized years and years and years ago,\" in the Secure Fence Act of 2006. \"It's been partially built and partially funded. He wants to fund the rest of it and build it - perfectly legitimate debate that should take place on that,\" Risch said. Asked if that debate could happen in three days, Risch chuckled. \"Things get done quickly around here when they want it to get done,\" he said. Even when Republicans controlled the House during the Obama administration, they could rarely pass spending bills without Democratic support. That is because a number of the House's most conservative members often refused to support such bills, making a bipartisan majority coalition a necessity. In addition, 60 votes are needed to pass a requisite procedural vote in the Senate. With just 52 seats, Senate Republicans will need bipartisan support in that chamber as well. Among other guarantees, Democrats want assurances that insurance subsidies through the Affordable Care Act will continue to be funded. There have been discussions among Republicans that Democrats could agree to provide money for the construction of the wall in exchange for those health funds, but Democrats have refused. Sunday morning, congressional Democrats submitted to Republicans a compromise spending plan, which included some new money for border security but only if it did not go toward a wall. Democrats also asked for assurances that the health insurance subsidies would continue to be funded, language that would shore up benefits for coal miners and a change that would expand Medicaid benefits to people in Puerto Rico, according to a senior Democratic congressional aide. Pelosi told reporters on a conference call Monday that Congress was \"on the path to get it done until [Trump] did intervene\" and that the administration's actions so far belied his campaign promise to \"make Mexico pay\" for the border wall. James Norton, a former deputy assistant undersecretary for homeland security under President George W. Bush, said funding for technologies, such as cameras and radars, on the border has dropped off since the early 2000s. He said to get money for the wall or other border security measures, the administration will have to \"sell specifics\" to lawmakers. \"Each part is going to need to be sold in a specific way to Congress, and they're going to have to hit the Hill hard,\" Norton said. \"It won't be easy.\" Damian Paletta and Sean Sullivan contributed to this report. Read more at PowerPost", 
            "contenttype": "Article", 
            "source": "The Washington Post", 
            "headline": "White House ‘confident’ of averting shutdown as Trump shows flexibility on wall", 
            "comment": [
                "Well that takes the big beautiful chocolate cake: rewriting the rules of a staring contest. You blink - you're being \"flexible\".  If Herr Twittler were any more \"flexible\", he'd just be a big blob of orange jello.", 
                "What? No wall? Another promise broken. Bad!", 
                "I read all this as \"we are going to send truckloads of taxpayer dollars to defense contractors\". Nobody seems to care if anything is effective, only whether money from the US Treasury can get passed through to private industry. Hmmm....maybe the Federal Government should run more like a business, complete with bribes, I mean campaign contributions, for Congress.", 
                "Don, \"president\" Back Down, once again surrenders the ghost with nary a struggle. As always, the only thing he has to show is lack of knowledge and weak bluster. Of course, the leaders of other nations have once again had their view of him reinforced. China will not be the last one to take his lunch money while Don fawns over his betters and believes they are now his best friends forever.", 
                "Why is the lying SOB \"greatest deal maker\" asking Congress for money to built the wall he promised Mexico would pay for?   Don't Americans realize how idiotic they seem to the rest of the world?", 
                "So Dems want to give Puerto Ricans Medicaid even though they don't pay US taxes!", 
                "Always counting, bombing and never thinking of humanity.", 
                "\"Hate. It's what we do.\"", 
                "It probably cost less than this funny attack on a Syrian airfield that was open again after a few hours.", 
                "Is Trump a terrible negotiator or what?  He threatens to risk a shutdown over funding for the wall, but caves immediately when Republicans complain.  He threatens the One-China policy then backs off almost immediately.  He is a one- trick pony.  All he knows how to do is make threats.  He is teaching he world that his threats are empty.", 
                "HIs thousands of lies have already taught that. He's weakened the US global position.", 
                "Neville Chamberlain was a better negotiator.", 
                "Ineffective presidents: there's lame duck and then there's just purely lame.", 
                "or just a duck", 
                "Boy, Trump supporters, first no wall, then tax cuts for corporations, 35% to 15%. Bet you all are tired of winning.", 
                "Is there a way of building a wall up each coast that NY and California will pay for, and if your in the middle you need an IQ of at least 90 to enter?", 
                "Maybe you're edging on a solution here.\n\nDesperate times... \n\nA surcharge might be considered for stupidity, to make up the harm done to the country.", 
                "No.", 
                "“That wall’s getting built, okay? One hundred percent.”\n\nTalk is cheap. That has never been more true than with this pathetic imPOTUS. When it will be painfully obvious to him that it's not happening, he will find a way to blame Clinton for it.", 
                "No, this goes straight at Obama, the man who saw America with grand vision (and hands).", 
                "or Meryl Streep", 
                "Shows flexibility on the wall\nTranslation....\nTrump running away from the wall idea with his ox tail between between his legs.", 
                "Somewhere Jorge Ramos is having a Carona and smoking a cigar\n Who can forget when Donald trumps personal bodyguard, the guy with the sunglasses who looks like GORT in 'the day the earth stood still'  grabbed Jorge and tried to throw him out one of the first Trump rallies where he brain farted about the wall.", 
                "Donald Trump: ''Who's Gonna Pay For The Wall?'' Crowd: “MEXICOOO!”", 
                "Yeah because the crowd is composed largely of idiots.", 
                "I'm in Minnesota, and where's OUR wall??  Unfair!", 
                "No kidding! I'm in NYC – I want a wall built immediately to keep out the crazy New Jerseyians (Chris Christie).", 
                "I think you should build one to keep out Trump.", 
                "Thankfully, he never comes here anymore. We protest so much he won't show his face.", 
                "You go, New York!", 
                "The wall does nothing to stop people from entering our country illegally.", 
                "Not until it's built, and not if it isn't maintained.  The Israelis have built a wall that greatly decreased entry by Jihadis.", 
                "I don't think jihadis are coming in from Mexico.", 
                "If the wall is covered with solar panels, it will pay for itself. That was one of the proposals by builders seeking the contract, and it sounds good. Why not do that?  Add that to taxing money transfers to Mexico from Mexicans working in the U.S., and you have funding for the wall. WE NEED THE WALL. No backtracking on the wall.", 
                "Sure why not, maybe we can put advertisements on the wall and bring tourists out to see it. It will pay for itself... right?", 
                "Advertise Trump hotels and golf courses.", 
                "It sounds like you need to believe you need a wall (we already have 700 miles of it) to feel secure in a world that's leaving you behind.", 
                "Nope! No clean energy allowed in this administration.", 
                "Florida, California, Texas, New \"Mexico\", Arizona... Does it sound English to you? NO, it's Spanish, it's Mexican territory stolen by shameful wars. But earlier that that, the Aztecs, today's Mexican people, were the citizens of these lands for millennia. So, who's the alien and who's the \"illegal\". Let's be kind and considerate to the ancient citizens of this land. STOP THE WALL!", 
                "I agree, but the Texans also don't want it... a much better argument simply because they're mostly GOP.", 
                "Nor any border state. Border states make anywhere from millions to billions (Texas made $11.6 billion in 2010) in revenue taxes from illegal immigration.", 
                "Recall that you lost the war.  The Treaty (Guadalupe-Hidalgo) ceded lands to the US.  They're not Spanish nor Mexican lands.  Deal with it.", 
                "Lols! To this day, there are people living in the South that have been reeling for generations because they lost the Civil War. Good advice but doesn't take.", 
                "I'm confused as to where the Democrats stand on the issue. Do they advocate an open border policy? \nIf so, what not just say so.", 
                "I'm confused as to where the Republicans stand on the issue. Do they believe the falling figures of illegal entry across the border merit the building of a wall, like Berlin's, costing untold billions, which were promised by the current administration (faux) to be paid by Mexico, who will never pay, whilst taxes to pay for it otherwise are being slashed, and the military would also be ramped up, with no tax base to cover it... and on and on.", 
                "I don't think this issue is the only one that confuses you...", 
                "English confuses him a bit also.", 
                "I'm confused too, is Mexico paying for the wall or not.", 
                "Trump's now showing \"flexibility\" about the wall. Is that like those old cheap accordion-folding partitions used to wall off Sunday School classes in the church basement?\n\nI bet Mexico could get a ton of those cheap for the border wall.", 
                "BUILD THAT WALL!  MAGA", 
                "why is there drama\ndon't the republicans control all of washington?", 
                "Republican aren't monolithic thoughtless sheep like Nancy and friends.", 
                "See Breitbart.", 
                "you're basically admitting they are incompetent and incapable of governing\nwith weak leadership.....", 
                "That is exactly what they are.", 
                "White House ‘confident’ of averting shutdown as Trump shows flexibility on wall\n\n\nHe is not getting money for that dumb wall.", 
                "Maybe we could have a bottle drive or sell cookies like the Girlscouts, only vanilla in certain states. Maybe a music fest called Oust-ella where Kid Rock and Ted Nugent could play and Sarah Palin could host.", 
                "Sarah\nPlays flute and sounds like jethro without the Tull", 
                "No Oreos?", 
                "toby keith will do it for free....", 
                "Florida, California, Texas, New \"Mexico\", Arizona... Does it sound English to you? NO, it's Spanish, it's  Mexican territory stolen by  shameful wars. But earlier that that, the Aztecs, today's Mexican people, were the citizens of these lands for millennia. So, who's the alien and who's the \"illegal\". Let's be kind and considerate to the ancient citizens of this land. STOP THE WALL!", 
                "Wait a minute, pendejo, who'd the mexicans take it from? American Indians? You gonna give it back to them?\n\nFace it, you're both a CONQUERED PEOPLE. Deal with it. You lost. The wars, the election, the whole shootin match.\n\nSo SHUT UP and take your medicine.", 
                "they already signaled flexibility\nwhenever they were asked if trump would sign a bill\nthat doesn't include funding for the wall\nthey said, \"that decision is up to the president\"\nwhich means they intend to fold\nsuper weak\nthey know the wall isn't happening\njust trying to save some face......", 
                "There will be a lot of earth moved with the Mexican-paid-for wall. It might be an opportunity.\n\nWho knows where Jimmy Hoffa is buried?", 
                "It's amazing how quickly Trump's promises or demands crumble when faced with the slightest opposition. I think people are starting to see him as a paper tiger.", 
                "they're just playing the idiots who would scream\nMEXICO!!!!!!\nat the rallies\nwhen trump asked who would pay for the wall\na wall he knew damn well would never be built.....", 
                "Trump: \"I will build a wall and Mexico will pay for it.\"\nSo why is Trump digging in my pocket to build the wall.", 
                "He will dig in you pocket at every opportunity.", 
                "Like the kid that won the Golden Egg contest at the White House Easter... had to pay for his trophy... true story...", 
                "Oh dear.  Link?", 
                "He can have what's in my pocket to build a wall. But not to give free food, medical and legal services to ILLEGAL ALIENS. For them, I have only lead.", 
                "Aren't you Mexican?", 
                "The best way to fund the wall it use a little of the money that will come back into the country.\nGive the corporations a bond that will pay will.", 
                "As a country lets think this out using our public educated brains. 12000 miles of fence\\wall is needed for this job. Thats 63360000 feet.  Home Depot sells 8' sections of pleated fence for $42. thats 7,920,000 sections needed, or $332,640,000. Posts are another $11 per section, or $87,120,000. Add another 20% because we are going to raise taxes on Canadian softwood, and then there is the labour, which will not be cheap since we are deporting all the people who do this work for a decent cost so add Comp and union issues and your looking at around 1.2 billion for a fence without lattice or about the same amount as Trump has defrauded America through tax schemes the last 5 years.", 
                "Thanks for doing the math.", 
                "Heck, that's less than the Divider-in-Chief put on those planes and sent to Iran.", 
                "Funny they're \"tax schemes\" when he does it legally, but when you want to reach into my pocket it's not.\n\nSorry bub, you're getting a wall, and mexico is paying for it. Watch and see in the long run.", 
                "The Secure Fence Act has been the law of the land since 2006.\nLikewise, since 2010, Obamacare (the Affordable Care Act) has been the law of the land.\n\nBoth should be fully funded until they are changed.\n\nBoth parties should support a continuing resolution to continue to fund the government until the necessary votes can be made to change existing law.\n\nFunds for Government operations on a continuing basis should not be held hostage to those in either party trying to change existing law.", 
                "As Gingrich found out.", 
                "Getting use to Trump not filling his promises. Next he will cave on climate change.", 
                "Now we're not going to get climate change?", 
                "other than the appointment of one half-assed judge and the pissing-away millions of travel dollars to lago what has trump to show for 95 days   davidleewilliams tulsa", 
                "As of day 91 Trump lied 417 verified times. His clock ticks on until it doesn't.\n\nhttps://www.washingtonpost.com/graphics/politics/trump-claims/", 
                "Wait, hold on a second. Where did all that Mexican money come from that's paying for the wall? Drug cartels and immigration runners figure large in this towards a smoke screen: the wall would be useless against drugs or illegal-immigration.\n\nAs US citizens we DEMAND that the wall be built only with PRO-certified CLEAN Mexican funds!", 
                "I don't know who the bigger suckers are, the GOP for letting Trump subvert their primaries and get to the White House, or the Trumenheimers for thinking the GOP would cooperate with Trump if he grabbed the presidency.\n\nFools' merry-go-round.", 
                "Trump is the absolute worst negotiator. He has already caved on the wall money. I thought he said Mexico was paying for the wall. Did Trump not receive Mexico's cashiers check? Maybe their check is in the mail!!!  ROFL!!!!!!", 
                "That check bounced before the inauguration.", 
                "Trump: \"Mexico will pay for it.\"\n\nNow he comes hat in hand to Congress. The Rust Belt may be rube-suckers to Trump, but that's it. Put up or shut up, liar.", 
                "So let me understand that the Democrats wish to shut-down  government because the President wishes to keep illegal aliens out of the USA? And if this happened, supposedly the Democrats would get more popular? I think Americans will easily figure out the only reason Democrats would want to do that is because they fear for their future voter base. I say, let them shut down government- they will get blamed.", 
                "Shut down government? Are you nuts? Talk to your GOP congress about shut-downs.", 
                "The wall is useless, as is your spin on the Dems.\n\nTrump lied. Where's the Mexican cash to pay for it, useless as it is?", 
                "So you think that when the Republicans have the White House, both houses of Congress, and the Supreme Court, there will be people stupid enough to blame the Democrats for what the Republicans can't do?  You funny!", 
                "Oh, September. Okay. That should give plenty of time to seal the deal and have all those Mexican pesos in the treasury ready to pay for the wall. Otherwise, bupkiss.\n\nOust this idiot, whatever it takes, Congress. The World will be a better place  and the think of all the GOP luster you'll gain internationally.", 
                "The GOP Congress are getting their agenda rammed through while hardly having to do any of what Trump promised his doofus base, so they aren't going to get rid of him short of major disaster or exposé.", 
                "Ummm, what have they \"rammed\" through while they continue to try to figure out how to tie their shoes?", 
                "We don't need no stinking wall.", 
                "You don't have to be Sigmund Freud to figure out a guy with small hands who promises to put up a giant erection.", 
                "Better than those little blue pills we all have heard so much about.", 
                "Nothing here but a bunch of WAPOS spouting BS!!!!!!!!!", 
                "Heh.\n\nYou maybe expected Breitbarters? Fox Newsers? Storm Fronters?", 
                "Trump's wall  is not only a waist of tax payers money, but a slap in the face of our friendly neighbor. Mexicans are part of the \"American Folk\". Part of our identity. We stole the land they owned for millennia. We are actually \"the aliens\" , from Europe Asia, you name it. So let's be kind to the original people of this land.  We stole it from them, and there is a price to pay, if you are an honest human being.  Forget about this ridiculous wall, please.", 
                "Really, so Mexico has existed as a state for millennia has it? Interesting.................", 
                "The Native Americans of the former Mexican states and Spanish Colonies that were taken over by wiles or by force to become American territories and, later, states were there for millennia, and that's what Mario means.", 
                "So every white person is an immigrant and has to pay money to the original inhabitants in perpetuity? That's just bizarre", 
                "Steve, Steve: reading comprehension. Mario isn't talking about money.", 
                "So why do the Mexicans insist on invading the USA and leaching off the American taxpayer if they are \"friendly neighbors\"?", 
                "The come here for JOBS, bubba.", 
                "The Mexican citizens flee their failed country.  The contempt for building a wall boggles the mind of anyone seeking to assure safety for citizens in the United States.  The United States owes Mexico nothing.  Mexico needs to control its own borders, something it has not ben able to accomplish for almost 200 years.", 
                "Remember, the land grants that you claim give Mexico rights to the land in question originally came from Spain, which is on another continent.  And, to my knowledge, the appropriation of the land by Spanish and Mexican governments, never asked the folks already living here.  So, if you are trying to use history to argue your claim, you have no basis for the claim.  Spain and Mexico did exactly what you seem upset that America did.  So, hypocrisy contradicts your claim of original rights.", 
                "The NA people were there before the Spaniards, bubba.", 
                "We elected The Donald and we want the WALL!  WE WANT THE WALL!  Defy us and you will be voted out of office!!  We will take America back!", 
                "Why don't you just take The Donald back?", 
                "Sorry Trumpers, the wall is a fantasy.", 
                "Half of America was Mexico before and we stole it from them. So shut up!", 
                "Mexico sold it to the United States and settled the claims for the destruction of U. S. property by maurading criminals.  In return, the United States left Mexico City that our army had captured and, then, allowed Mexico to  continue on with their country.  We have seen the result of that effort, Mexican citizens in a hurry to leave their own country.", 
                "trump! # Pound Sand!!", 
                "no one should be surprised there will be no wall. it is just one of the building block of lies that make his deplorable base love him so. if he told the truth they would abandon him in droves. they unserstand their bigotry and fake christianity are based on lies and are comfortable with that lifestyle.", 
                "When the shutdown is averted, Trump will claim the credit, because he got himself to back down on his demand to fund a wall.", 
                "Brandish the knife. Eat the waffle.", 
                "All libs need to remove their walls around their house so anyone can invade, rape, and steal their property if they aren't ok with a border wall.  Actions speak louder then words.", 
                "The Great Wall of Trump was just one big DON and Pony Show", 
                "Reminds me of some of the Tijuana animal shows we used to hear about as kids in California, real classy.", 
                "A big \"\"DON and Pony Show\" turned out to be even better than an actual wall. Illegal immigrants are at an all time low and illegal immigrants being deported are at an all time high. That's exactly what Americans want", 
                "americans want their undocumented neighbors to be given a chance to get work permits, and at the least and not be deported, unless they have significant criminal records.", 
                "Trump has no claim on that, Stevie; it started a long time ago, under Obama.", 
                "Oh, Old Snowy, what with the facts again?  They don't want no stinkin' FACTS..."
            ], 
            "person": [
                "Barack Obama", 
                "Charles E. Schumer", 
                "George W. Bush", 
                "James Norton", 
                "Jimmy Carter", 
                "Nancy Pelosi", 
                "Sean Spicer", 
                "Sean Sullivan", 
                "Sen. James E. Risch", 
                "Sen. Lindsey O. Graham", 
                "Sen. Richard C. Shelby", 
                "Sen. Rob Portman", 
                "Steven Mnuchin"
            ], 
            "theme": [
                "Border Wall", 
                "White House"
            ], 
            "primarysection": "National-Politics", 
            "associatedbinaryurl": [
                "https://img.washingtonpost.com/rw/2010-2019/WashingtonPost/2017/04/24/National-Politics/Images/672363056.jpg"
            ], 
            "organization": [
                "Associated Press", 
                "U.N. Security Council", 
                "United Nations Nikki Haley", 
                "White House"
            ], 
            "blurb": "The president said he may be willing to wait until September to begin funding construction.", 
            "location": [
                "Pennsylvania Avenue", 
                "Puerto Rico"
            ]
        }, 
        {
            "contenturl": "https://www.washingtonpost.com/news/nationals-journal/wp/2017/04/24/bryce-harper-matt-wieters-get-days-off-monday-vs-colorado-rockies/", 
            "body": "Matt Wieters will rest Monday against the Rockies. (Elsa/Getty Images) DENVER - The Nationals arrived at their Denver hotel early Monday morning, not long before sunrise and not as much before Monday's first pitch at 8:40 p.m. ET local time as they might have liked. Sunday's overnight trip is one of the many challenges of this 10-game road trip, one around which Manager Dusty Baker has been planning for weeks. In keeping with his plan, he held Bryce Harper and Matt Wieters out of Monday's lineup in an effort to preserve them both moving forward. Harper has played in every game this season. Wieters rested Friday night and will likely rest again against the Rockies this week, Baker said. [Bryce Harper named National League player of the week] \"Wieters is at a grueling position. He'll play tomorrow, then he might be off the next day,\" said Baker, who acknowledged that Wieters provides a strong pinch-hitting option if the timing is right. \"We have to make sure they can't walk him or pitch around him,\" Baker said. \"Or try not to double switch him in there. That negates the day off.\" Meanwhile, Trea Turner will return to the top spot in the Nationals' batting order Monday night. When Turner returned from the disabled list this weekend, Baker hit him second, hoping to take some pressure off Turner's hamstrings and let Eaton carry the leadoff load. Monday night, Turner is back in his usual leadoff spot with Eaton batting second. In 12 games leading off in Turner's absence, Eaton hit .300 with a .759 OPS. [Boswell: Closer issues aside, Nationals are answering all questions emphatically] Turner's intended backup at shortstop, Stephen Drew, took steps toward a return from his hamstring injury Monday. The 34-year-old shuffled and jogged in the outfield, and Baker acknowledged that the veteran infielder was increasing activity levels. Drew hit the disabled list on April 12 with hamstring trouble. The other Washington player on the disabled list, Sammy Solis, threw lightly in the outfield before Monday's game. Baker did not have an update on the lefty, other than to say he is \"chomping at the bit\" to get him back in the bullpen. Without Harper and Wieters in the lineup, Michael A. Taylor and Jose Lobaton will get their chance against Rockies left-hander Tyler Anderson. None of the Nationals has faced him before. [Taking a look at the Nationals' next series, at the Colorado Rockies] NATIONALS T. Turner SS Eaton CF Rendon 3B Murphy 2B Zimmerman 1B Werth LF Taylor CF Lobaton C J. Turner P   ROCKIES Blackmon CF LeMahieu 2B Arenado 3B Gonzalez RF Reynolds 1B Parra LF Story SS Wolters C Anderson P", 
            "contenttype": "Blog", 
            "source": "The Washington Post", 
            "headline": "Bryce Harper, Matt Wieters get days off Monday vs. Colorado Rockies", 
            "comment": [
                "Does Blake Treinen have any options left?", 
                "Well, shoot. Still the best record in MLB... Tomorrow is another day..", 
                "Well, that kinda sucked. See you all tomorrow, when I will at least be able to listen to C&amp;D (after spending the afternoon in the dentist's chair).\n\nGood Night, Everybody!", 
                "The bullpen is still a problem, you just never know when they will implode.", 
                "At least Th. is a day game,so we can watch the Caps game live.", 
                "Night all. Better tomorrow. Not sure what's up with Treinen, but bummed for him.", 
                "Ah well. Get some rest, boys!", 
                "On to tomorrow, FTW.", 
                "Oh well ...\n\nBullpen 'work in progress'. \n\n: )", 
                "See y'all.", 
                "Oh well. Can't win them all, although boy did I want that one after Turner's quality start.", 
                "Damn.  Get them tomorrow.", 
                "A bit anti-climatic.", 
                "That's part of baseball.", 
                "For sure.", 
                "OK Bryce, get us close!", 
                "My hub points out that everyone behind the plate is looking at the  on-deck circle.  #Bryce", 
                "Rally Bums!!", 
                "Cue the Jaws theme.", 
                "Well well well.", 
                "Harp sighting", 
                "Wooooo Werth. Best bum in town. ;)", 
                "No pinch hit for MAT?", 
                "Oh crap!  Not him.  Deer in the head lights!", 
                "Go back to sleep.", 
                "Still sore we didn't give Holland a contract.  Seemed like a low-risk situation.  The Rockies signed him to a $7 million incentive heavy deal.", 
                "Big pickup by the Rockies. Would have been a good addition.", 
                "Makes more sense than that 42-year old we have in the minors.", 
                "Very high risk, IMO.  Coming off a lost year, there's a reason teams stayed away.", 
                "High risk is a Rizzo move. 7 million isn't that much of a risk anyway.", 
                "Fair to say they sign Holland then they don't sign Wieters.", 
                "Someone just yelled out \"Jayson you're a bum!\"\n\nWell.  That's just rude.", 
                "He answered.", 
                "Hah!  Who's the bum now??", 
                "Especially given his double just now.", 
                "\"Time was you would root for a 4-run lead, because it was almost like you had a better chance than if there was a 3-run lead.\"\n\"Makes sense.\"\n\n--- only in a perverse world where a silly \"save\" stat exists.", 
                "Holland is 9 for 9", 
                "Looks like Nats might still be in striking range if Alpers had gotten the call for this inning initially instead of Treinen. I wonder what Dusty's thinking was on that call.", 
                "I don't want to use Albers, because I may need him tomorrow.", 
                "A little luck and a lot of solid contact, even if it was just ground balls, gives the Rockies a 3-run inning.  Bummer.", 
                "I'm with FP. This 4-run deficit is all part of the Nats' 3-dimensional chess plan for the 9th.", 
                "It ain't over.", 
                "I missed the Daily Show for this?  Boo.", 
                "DVR.", 
                "I got the 1;30 replay lined up.", 
                "Blake...", 
                "Ciao bellas.", 
                "Give Blake the United treatment from the dugout.", 
                "LOL I think you just coined a new expression -- to get \"United.\"", 
                "Italians are pretty much fair game.", 
                "Must suck for a guy like Turner. On the plus side, I'm sure he'll be in demand. 6 good innings at Coors field pretty good way to advertise yourself.", 
                "I'm guessing he cares far less about a win then resurrecting a once promising career.", 
                "Not over yet.  :(\n\nWish they could win this for Zim.", 
                "Bake gets respect from his players.  That's important.", 
                "Blake?!  What do we do with you.", 
                "Gonna be time for the old senddown.", 
                "join blevins and matheus.. remember them? lol", 
                "Nats should stop mucking with their pitchers heads. Fortunately, Roark survived. Hopefully, Blake comes out the other side soon.", 
                "I don't think you blame the Nats for trying to make Treinen a closer.  That's a promotion salary wise.", 
                "This game has gone south in a real hurry.", 
                "HEY HEY HEYYYYY.\n\nIt's Maaaaaaaat Albers!", 
                "Blake's confidence is shot", 
                "Sad to see. :(", 
                "Well, that's all she wrote.  Can't be too upset with this loss.  Just a shame that such a good start by Turner was wasted.", 
                "Treinen turning into Jeremy Guthrie right in front of everyone.", 
                "Nah. Nobody could be that bad.", 
                "Stop it and give the Nats a chance to get the tying run to the plate in the 9th..then 34", 
                "I think I've figured out what to do with Jacob Turner.  Treinen has options.", 
                "Oh, no.", 
                "I'm treinen stay awake.", 
                "Slumber party!", 
                "Turner with a quality start turns into nothing.\n\nGet Albert up.", 
                "Wow, they make it look so easy.  This is going to be a long series.\n\nEdit:  Is this batting practice?"
            ], 
            "person": [
                "3B Murphy", 
                "Anderson P", 
                "Bryce Harper", 
                "Dusty Baker", 
                "Jose Lobaton", 
                "Matt Wieters", 
                "Michael A. Taylor", 
                "Sammy Solis", 
                "Stephen Drew", 
                "Trea Turner", 
                "Tyler Anderson"
            ], 
            "theme": [
                "LF Taylor CF Lobaton C J. Turner P", 
                "Taylor CF Lobaton C J. Turner P ROCKIES Blackmon CF", 
                "LF Taylor CF Lobaton C J. Turner P ROCKIES Blackmon", 
                "CF Lobaton C J. Turner P ROCKIES Blackmon CF LeMahieu", 
                "Taylor CF Lobaton C J. Turner P ROCKIES Blackmon", 
                "LF Taylor CF Lobaton C J. Turner P ROCKIES"
            ], 
            "primarysection": "Sports", 
            "associatedbinaryurl": [
                "http://img.washingtonpost.com/rf/image_960w/2010-2019/Wires/Images/2017-04-22/Getty/671614226.jpg"
            ], 
            "organization": [
                "LF Story SS Wolters C Anderson P"
            ], 
            "blurb": "Dusty Baker's efforts to keep his roster strong through a grueling road trip continues with some lineup changes Monday.", 
            "location": [
                "Denver", 
                "Rockies", 
                "Washington"
            ]
        }, 
        {
            "contenturl": "https://www.washingtonpost.com/local/md-politics/montgomery-election-board-to-review-registration-practices/2017/04/24/b9a3b034-2933-11e7-be51-b3fc6ff7faee_story.html", 
            "body": "Montgomery election officials said Monday they will review registration procedures in response to allegations from a conservative watchdog group that the county's rolls are packed with ineligible voters. Judicial Watch said in a letter earlier this month there was \"strong circumstantial evidence\" that Montgomery's lists are filled with names of voters who have died, moved out of state or are non-citizens. It said the charge is supported by data showing more registered voters in the county than there are citizens of voting age (18 and over). The group said it would sue the state of Maryland within 90 days unless officials show they have taken action to clean up voter lists and come into compliance with the National Voter Registration Act. Montgomery is one of more than 90 counties in 11 states hit with similar allegations by Judicial Watch. Montgomery County, where Democrats have a 2-to-1 registration advantage - is the only Maryland jurisdiction that was served notice. \"Voter fraud is totally unacceptable. \"We take this issue very seriously.\" said Board President James Shalleck, a Republican appointed by Gov. Larry Hogan (R). Under state law, the party that controls the governor's office holds the majority on state and local election boards. The state board, which oversees county panels, said last week that it will also review practices in response to Judicial Watch. But county election staff and voting rights groups raised questions Monday about the legitimacy of Judicial Watch's claim. Records do show that Montgomery's total registration of 657,548 is higher than its voting-age population of 633,295, a figure that comes from census data. But board staff said there as many as 16,000 active voters who don't show up in the census. About half are 16-and-17-year olds allowed to register because they will be 18 by the time of the next federal election. The other half includes county voters overseas, either with the military or the private sector. The disconnect between registration and voting-age population also reflects the lengthy process required by federal law remove someone from the voter rolls, board staff said. It takes four years to \"cancel,\" or remove a person from voter lists. That comes only after two sample ballots are returned with no forwarding address and the individual fails to vote in two consecutive federal elections. Overall, the county has removed more than 76,000 voters from the rolls since 2015. The board has received letters and comment from voting rights groups challenging Judicial Watch's analysis. Sarah Brannon, director of government agency voter registration for Project Vote, told the board Monday that the National Voter Registration Act, also known as the \"motor voter\" law, was intended to expand access to voting. The two Democrats on the five-member board agreed that there should be no tolerance for fraud or sloppy practices. But they cautioned that ill-conceived sweeps of the rolls could inadvertently disenfranchise eligible voters. \"We also don't have a tolerance for removing people from the rolls unless we're absolutely sure,\" said board member David Naimon. In public comments, some speakers demanded an aggressive investigation and more. Montgomery County Republican chair Dick Jurgena called for the board to fire elections director Margaret Jurgensen. \"I think the draining of the swamp needs to start here and now,\" Jurgena said. \"This performance on the part of at least some of your staff is unacceptable.\" Board members did not respond to his call for the ouster of Jurgensen, who at the beginning of the meeting received a special citation for her 15 years of service.", 
            "contenttype": "Article", 
            "source": "The Washington Post", 
            "headline": "Montgomery election board to review registration practices", 
            "comment": [], 
            "person": [
                "David Naimon", 
                "Dick Jurgena", 
                "James Shalleck", 
                "Larry Hogan", 
                "Margaret Jurgensen", 
                "Sarah Brannon"
            ], 
            "theme": [
                "County Voters", 
                "County Election Staff", 
                "National Voter Registration Act", 
                "State Board"
            ], 
            "primarysection": "Local-Politics", 
            "organization": [
                "Judicial Watch", 
                "National Voter Registration Act"
            ], 
            "blurb": "Judicial Watch charges that county rolls are packed with ineligible voters", 
            "location": [
                "Montgomery County"
            ]
        }, 
        {
            "contenturl": "https://www.washingtonpost.com/world/national-security/state-department-website-touts-glittering-history-of-trumps-mar-a-lago-estate/2017/04/24/bd298e44-292f-11e7-b605-33413c691853_story.html", 
            "body": "The State Department on Monday removed from its website an article about the history and lavish furnishings of President Trump's privately owned Florida resort club Mar-a-Lago, following questions about whether the federal government improperly promoted Trump's moneymaking enterprises. Sen. Ron Wyden (D-Ore.) pointed to the travelogue-style blog piece Monday, asking in a Twitter message why the State Department would spend \"taxpayer $$ promoting the president's private country club.\" The State Department issued a statement Monday apologizing for \"any misperception.\" \"The intention of the article was to inform the public about where the president has been hosting world leaders,\" the statement said. It was not clear whether the item had been vetted for legal or ethical concerns. The short item had been posted on a promotional website called \"Share America\" on April 4, ahead of Trump's meeting at Mar-a-Lago with Chinese President Xi Jinping. A version of the item was recently reposted on the website maintained by the U.S. Embassy in London, where it caught the attention of watchdog groups. The item adopted Trump's term \"winter White House\" for the -members-only club. It did not expressly encourage foreigners to visit Mar-a-Lago, although other articles on the same website actively promote U.S. tourism. The item did note that the estate \"is located at the heart of Florida's Palm Beach community.\" \"By visiting this 'winter White House,' Trump is belatedly fulfilling the dream of Mar-a-Lago's original owner and designer,\" the item read. \"The ornate Jazz Age house was designed with Old-World Spanish, Venetian and Portuguese influences\" and filled with original owner Marjorie Merriweather Post's collection of antiques, the article noted. The item included photographs of the house and sumptuous interiors, and copies of Trump tweets mentioning Mar-a-Lago. The article gave a brief summary of the 1927 mansion's history, including Post's desire that it be used by U.S. presidents as a retreat and the subsequent decision by the U.S. government that the property was too expensive to maintain. Trump bought it in 1985. \"After refurbishing the house and adding an events space, Trump opened the estate to dues-paying members of the public in 1995 as the Mar-a-Lago Club,\" the State Department item read. \"Post's dream of a winter White House came true with Trump's election in 2016. Trump regularly works out of the house he maintains at Mar-a-Lago and uses the club to host foreign dignitaries.\" One watchdog group, American Oversight, called for an investigation by the State Department inspector general and said it would request public records documenting how the blog post was created. The State Department describes the \"Share America\" site as its \"platform for sharing compelling stories and images that spark discussion and debate on important topics like democracy, freedom of expression, innovation, entrepreneurship, education, and the role of civil society.\" The site is produced by the department's Bureau of International Information Programs, which produces material distributed by U.S. embassies.", 
            "contenttype": "Article", 
            "source": "The Washington Post", 
            "headline": "State Department website removes article touting history of Trump’s Mar-a-Lago estate", 
            "comment": [
                "In other countries of the world, this is called \"corruption\".   But it no longer seems to matter here.", 
                "Mar--a-Lago is NOT an estate -- It is a for-profit, privately owned golf club that charges $200,000 dollars as an entrance fee and probably annual dues as well.  The headline of this Washington Post article should be corrected.", 
                "Well that's nice!  Apparently, the White House has run out of Real News to delete ,not only with the W. H. site, but the other government departments, as well.\n\nBut, as the History of Mar-a-Lago was deleted, I bet that he did add two factual pieces of news  thew number of times that Mr. Real Estate Genius (Location!  Location!  Location!!:\n1.   sued the Country, asking it to move its noisy airport, though he has=d the noisiest old 727 there.\n2...And added photos, available through the South Florida press, showing how much closer the ocean is to his place. \n\nhttps://thetruthoncommonsense.com", 
                "Melania:  Zonald, zey want uz to move to zee White Houz becauz of Mar A Logo newz.  Zu zey have hot water in zee White Houz?  Pleez show zem your tax rezurn, pleeeeez?", 
                "While POTUS Trump is opening \"escort services\" and \"massage parlors\" in China...no joke. Not only is he pimping rednecks, but it looks like he will be pimping yellow-tails as well. It's true, read these articles.\n\nhttp://www.independent.co.uk/news/world/americas/china-donald-trump-branded-without-us-congress-permission-trademarks-spas-escort-services-hotels-and-a7619136.html\n\nhttp://www.alternet.org/news-amp-politics/china-approves-new-trump-branded-massage-parlors-bars-and-escort-services", 
                "Don should change his slogan to \"Love America Long Time\".", 
                "Or America love you long time.", 
                "Mr. McMahon and Donald Trump announce the Battle of the Billionaires: WWE Raw", 
                "Next there will be advertisement on the White House fence.", 
                "Maybe for Trump massage parlors, recently trademarked in China. Stay classy Mr. President!", 
                "Probably his wife. Rumor has it she is an ex call-girl so she would know the \"massage parlor\" business. Here's a photo of her doing soft-porn fully nude in a magazine. Yep, the first family has really degraded the WH. \n\nhttp://www.gq-magazine.co.uk/article/donald-trump-melania-trump-knauss-first-lady-erections", 
                "Even better, politicians should all be required to put patches on their suits to show who has given them money like a NASCAR driver.", 
                "There's room on Air Force One and Marine One for the Trump Organization advertising, too.", 
                "Is anyone still wondering about Trump saying he will separate his Business Conflicts of Interests? Trump got into this position to Enrich Himself and his Family, it is so obvious it is laughable, but the GOP Majority is not saying a word.", 
                "Let them eat cake. The biggest, most beautiful piece of chocolate cake.", 
                "45: 'My American Gluttony Achieved!!!'\n\nAn ethics violation by 45. And just think of the other properties in the US and worldwide that 45 has to fill with folks not to mention cost of TT and MAL travel, security et al. Ah, emoluments.   Follow the money. Get the taxes.  \n\n\"The blog’s author—Leigh Hartman, who has written dozens of posts for the government site—may have just not received adequate training. All the same, Clark, as a legal scholar, reiterates just how glaring this issue is. And that’s not just a case of an ethics expert nitpicking over certain obscure legal clauses. “It’s not just some technical rule,” says Clark. “It’s specific expression of a very general rule” that government officials should not use public office for private gain.\"\n[https://www.fastcompany.com/40411876/ethics-expert-cries-foul-at-state-departments-promotion-of-mar-a-lago]", 
                "The only wall that needs to be built is around \"Harrumph\".", 
                "I've got a nice wall just fitting for Trump. It surrounds Leavenworth Prison.", 
                "Want to know what Donald Trump stands for? Well, let me spell it out:\nDumb\nObnoxious\nNarcissistic\nAppalling\nLiar\nDisaster\n\nTragedy\nRussia\nUnfit\nMoran\nPathetic", 
                "And the 'J' is for jack***.", 
                "Make America Gag Again", 
                "America was great BEFORE Trump was elected. \n\nJust wait.....he'll start a nuclear war. And the GOP is just doing nothing.", 
                "DISGUSTING....", 
                "Power corrupts, and absolute power corrupts absolutely. Especially if you're a malignant narcissist.", 
                "Mr. Trump hasn't just failed to \"drain the swamp\", he has, in fact, created a whole new super-swamp for his ethically-challenged administration.", 
                "Interesting to see so many GOP in these comments trying to defend this too. Does the self-proclaimed party of \"values\" actually have any morals and values? All Americans should be concerned with politicians pimping the government to promote their private enterprises.", 
                "What are they trying to do? Make us come to Washington with pitchforks....I like, a lot of you are so sick of reading this dudes BS, nothing a$$, articles. He's a failure he needs to be impeached yesterday, along with members of Congress that are quiet as a mouse while they make money behind the scenes.", 
                "Build that swamp!", 
                "Why isn't the state dept. web site telling the American people what the hell it's foreign policies are. Or why Frump and Ivanka got trademark approvals from China immediately after meeting with the Chinese president at said resort!! Or why it's Sec. of State won't talk to the American people. These would be things we NEED to know.", 
                "Could it be that there are so many people in charge of our federal government that have financial ties to oil industries? And their ties create a conflict of interest between their own profit and serving the USA citizens?", 
                "\"State Department website removes article touting history of Trump’s Mar-a-Lago estate\"\n\nWonder why? Too swampy?", 
                "Good night Trump/ Republicans haters. Hope you have good dreams and tomorrow will be a better day for all of you. Sorry if I added any anxiety, that was not my intent. Just want to explain that you don't have to hate with whom you disagree.", 
                "I don't think people are hating, but rather pointing out an obvious ehtics violation. For years republicans have raised issue after issue about Obama. Now, all of a sudden, none of that stuff matters. Hypocrisy is what we call it.", 
                "We don't hate Trump or any of his cronies (well, Bannon maybe). We hate liars, con men, nepotists, unqualified people on crucial positions and members of Congress who blatantly fail to do their jobs.", 
                "no, twilliam we don;t hate you. we are amazed, though at your support for this insatiable monster that you and your people have created.", 
                "There are deep pockets secretly financing Trump for profit. USA citizens are not even a consideration. Everyone should read up to n this\n\n\nIn Citizens United v. Federal Election Commission, in January 2010, the US Supreme Court ruled that corporations and unions can not constitutionally be prohibited from promoting the election of one candidate over another candidate.[60]\n\n\n\"Inside The Wealthy Family That Has Been Funding Steve Bannon's Plan For Years\"\n\nhttp://www.npr.org/2017/03/22/521083950/inside-the-wealthy-family-that-has-been-funding-steve-bannon-s-plan-for-years\nhttp://www.newyorker.com/magazine/2017/03/27/the-reclusive-hedge-fund-tycoon-behind-the-trump-presidency\n\nhttps://en.m.wikipedia.org/wiki/Citizens_United_v._FEC", 
                "In 2012, the Mercer foundation donated $2 million to the nonprofit Citizens United Foundation, which then gave one of Bannon’s consulting firms $300,000 as a “fund raising fee,” according to IRS documents", 
                "Yep.  Sheldon Adelson is partners with the Chinese Communist Party  Inc. in one of the worlds largest casinos.  (There is a reason mobsters traditionally buy casinos, especially ones under the control of corrupt governments, you can effectively launder every dollar that goes through them.)\n\nChinese Communist Party Inc money can, and I'm betting did, move through Adelson, to support trump, and perhaps even directly to trump's campaign.  trump already owed a bundle to Chinese banks, they were just doubling down on their investment.\n\nWe can find out none of this, because the Republicans on the Supreme Court have decided you have no right to question from whom and from where political candidates are getting their money.  Even if it could so easily be the Chinese Communists, Putin's crime syndicate, or South American drug cartels, you are not allowed to know.   It's safe to assume all three gave generously to a man who likes to \"deal\", until proven otherwise.", 
                "But \"However, the court upheld requirements for public disclosure by sponsors of advertisements. The case did not affect the federal ban on direct contributions from corporations or unions to candidate campaigns or political parties.\"\nWe have a right to know who these people are, its the law.\nsame site.\nhttps://en.m.wikipedia.org/wiki/Citizens_United_v._FEC", 
                "Sure. You can find out the name of the Super Pac that sponsored the ad.  Now tell me how you find out where that money came from.\nThen explain to me how you account for a large, somewhat audacious, in-kind political contribution from a criminal named Vladimir Putin, is accounted for in your fantasy world.", 
                "How revealing that not a single Republican politician has expressed concern over these blatant ethical violations.", 
                "Revealing, but not surprising.", 
                "As a retired State Department Foreign Service officer who spent 28 years serving America, mostly at posts in the Middle East, including Kuwait, Beirut, Tunis, Baghdad, Amman,  Rabat and Manama, I find it disgusting that the State Department under Rex Tillerson, is now pimping for Donald Trump's luxury resorts around the world.  Shame on any State Department employee who had anything to do with this despicable action.", 
                "Thank you for your service.", 
                "You may be interested in this article. Seems there something the public isn't seeing. Thank you for your service. USA citizens respect you so much.\n\nhttps://www.theguardian.com/us-news/2016/dec/18/leak-rex-tillerson-director-bahamas-based-us-russian-oil-company", 
                "Do State employees have any choice?  They have to obey orders or quit.  Not everyone has the luxury of just quitting because they don't like the new boss and most are truly committed to their jobs and are just waiting out this administration.  What is despicable is the lack of GOP pushback on any of these ethical violations.", 
                "Please tell me this is a joke. Trump is using the government's website to promote his hotel? Isn't that against the law? Does this guy have any honor?", 
                "Apparently not.", 
                "Apparently not.", 
                "Yes. The Trump presidency is a joke.", 
                "Nothing like crass commercial governmental advertising............", 
                "The Winter Kremlin", 
                "Imagine Trump telling some staffer to use the State Department website to pitch his resort. Him standing over them telling them where to find the pictures he wants used and where to get background. Then him knowing when it's released today how everyone will be upset and what time to take it down. Then him knowing he succeeded at riling up the \"liberals\", which made his base happy, and at the same time got some advertising. Who says Trump doesn't get s**t done?", 
                "old fashioned russian and republican values on display.", 
                "Trashy\nRepugnant\nUnfit\nMoronic\nPinhead", 
                "\"Ensnare America.\"", 
                "trump-\n\"Growing my Brand at the Expense of the American People.\"\n#Makethebrandgreatagain", 
                "If you missed the orignal post, check out the internet arhive wayback machine: https://web-beta.archive.org/web/20170424182729/https://share.america.gov/mar-a-lago-winter-white-house/", 
                "Thanks; I had not seen the original post!", 
                "Grifter in Chief", 
                "Ok  . . . are you angry enough yet at this president and his administration that are both greedy, ignorant, and arrogant, angry enough  to take action? Ok, call both your your senators (https://www.senate.gov/general/contacting.htm ). State your name and zip code and then politely ask them to support a full, open, bipartisan Senate committee investigation into alleged Russian influences on this president and his administration. AND be sure to ask that Mr. Trump's tax returns be subpoenaed. They will have their own story to tell. Want extra credit? Then call or email members of the Senate Select Committee on Intelligence (membership and contacts at https://www.intelligence.senate.gov/ ). Say that you’re calling re. membership in the Senate Committee, not as a constituent. Committee members should serve the interests of all Americans, not just those of the folks back home. State your case. They are obligated to listen. And they do keep count. A grateful country  thanks you for your service.", 
                "To say nothing of the national security intel that your handing to \"unfriendlies\" that would love to have additional details of where the president often resides. This administration is so ridiculous. These idiots in the white house, doesn't anyone oversee all this stuff before it is made public??", 
                "I think WAPO pays its reporters the same way they pay small town cops with revenue from traffic tickets.  Try to catch as many speeders , even if it's 2 mph over the limit, you can and get a bonus.  Everyday it's the same stuff from WAPO Trump this Trump that and something as benign as this story is followed up by these deranged comments saying he should be impeached.  This is a sick pattern of pathology.", 
                "Yes, this pattern is sick, but don't blame the messengers:  blame those who put this sorry lot in power and those who fail to remove them.", 
                "That's why we have elections. So you and your lot are equally to blame. More of his lot voted in those blue states that turned red than your lot did.  That's where your lots mission should be in Pennsylvania, Michigan, Wisconsin, Ohio, Florida and on and on, then and only then can you remove him. Impeachment over nonsense like this article is fantasy.", 
                "I and my lot (i.e. foreigners) are totally innocent of any complicitness in this election, even though its outcome influences our lives as well as yours. So our mission can only be to keep drumming, because that is all we can do.", 
                "Thank you WP!  A free and honest press is All we the people seem to have left, to fight and expose the deceptive, lying, evil intent, of Trump/Pence/Republicans in congress, and Republican voters and supporters.......", 
                "Thanks U reader, you quickly proved my point - Exactly what I spoke about in the comment above. Very sick people out there and the WAPO is feeding the frenzy with fantasy.", 
                "twilliamrobert, your twit is showing....and thanks for proving my description of Trumpkins to be exactly correct........", 
                "Not sure about your comment, twit? Trumpkin? Is that suppose to be clever or something? Do realize that calling the group of people you politically disagree with deceptive liars with evil intent may be a wee bit of paranoia on your part, that paranoia is being fed by these daily non stories. Get some rest and rethink your anxiety and frustration and direct your energy toward your family and friends and don't waste it with hate for people of differing political views.", 
                "twilliamrobert, twit and trumpkin are the newest of the self describing new descriptions chosen by Republican voters and supporters.  Do you realize that Lying is evil?  hmmmm, probably not, since you and your fellow believers defend and promote the lies and deceptions spewed out by your heroes Trump/Pence/Republicans, daily.  Disagreeing with someone's political views is Not the same as disagreeing with someone's brazen and outrageous Lies and Deceit.   Trump/Pence/Republicans proudly proclaim their Lies and Deceit, as truth, daily.", 
                "There's no \"misperception\"...this is flat out monetizing the Grifter and his family. This is banana republic level corruption. Add to this using the White House web site to sell Melania's jewelry on Inauguration Day, and using black Trump hotels umbrellas at the Easter Egg roll, and selling Trump trinkets at the same event.\nCriminal enterprise comes to the White House.", 
                "We should just build a \"Trump Sales Center\" in the West Wing and get it over with, so that classless family can hoc all their cheap China made wares and real estate in one place. I mean, it is clear the entire point Trump became President is to enrich himself and his family.", 
                "Seems  someone thought that Tillerson needed to score some brownie points from the boss.", 
                "50% of us did not even bother to go vote, then universal vote was lost, but hey, it does not matter, cause we practice electoral vote, not because of the horses not being able to cary all votes (initial intent) but for the rich to have reachable tipping targets. great work...", 
                "the stupidity of the masses is infinite, apparently", 
                "I have to agree and these comments prove it.", 
                "Graft, greed, corruption. Such a nasty tRumploch.", 
                "Such a scummy person to the core, this (D. Trunp) is what a person without any virtue whatsoever looks like.", 
                "I'm always as eager as anyone to jump on Trump for anything, but based on this article (I didn't see the original site, so I can't put it in that context), it feels like it was just a bad idea that didn't get thought through all the way, and nothing more sinister. That alone is pretty rare for Trump. \n\nDon't get me wrong, it had no business being posted where it was posted, but I think this is pretty minimal.", 
                "I agree with you, but the point is that Trump and his government have reached such a low level of trust and respect that everything they say, do or omit causes this kind of backlash.", 
                "Was the commercial narrated by Troy McClure?", 
                "Well, hell. Thanks for that. \nNow I can only hear it in Troy's voice. :)", 
                "Brought to you by the makers of \"Lead paint. Delicious, but deadly!\"", 
                "Trump kinda make Paul Ryan seem like an adventurer..."
            ], 
            "person": [
                "Marjorie Merriweather Post", 
                "Old-World Spanish", 
                "Ron Wyden"
            ], 
            "theme": [
                "State Department", 
                "President Trump"
            ], 
            "primarysection": "National-Security", 
            "associatedbinaryurl": [
                "https://img.washingtonpost.com/rw/2010-2019/Wires/Videos/201704/Reuters/Images/2017-04-13T205355Z_1_OV6C8MZFJ_RTRMADC_0_USA-TRUMP-MARALAGO.jpg"
            ], 
            "organization": [
                "Bureau of International Information Programs", 
                "Jazz Age", 
                "State Department", 
                "U.S. Embassy", 
                "White House"
            ], 
            "blurb": "Promotional website raised questions about taxpayer funds and Trump family businesses.", 
            "location": [
                "Palm Beach"
            ]
        }, 
        {
            "contenturl": "https://www.washingtonpost.com/news/answer-sheet/wp/2017/04/24/betsy-devos-said-there-isnt-really-any-common-core-any-more-um-yes-there-is/", 
            "body": "Education Secretary Betsy DeVos (Evan Vucci/AP) ' Education Secretary Betsy DeVos can't seem to make an accurate statement about the Common Core State Standards. The Core was among the most controversial topics in education for years. It started as a bipartisan effort to create a set of math and English language-arts standards for students across the country to use, but it became an educational and political mess. Most states adopted and implemented the standards early in the Obama administration - but failed to give teachers sufficient time to learn it, and critics from every part of the political spectrum found fault with some part of the initiative. A grass-roots revolt took place against the Core and federally funded standardized tests aligned to the standards, and some states have either replaced the standards or renamed them with minimal changes. When she was first nominated late last year to be education secretary by Donald Trump, the Michigan billionaire was described as a strong ally of former Florida governor - and Common Core booster - Jeb Bush. She had not at that time attacked the Core publicly but later said she was not a supporter. During the campaign, Trump had promised \"to get rid of Common Core,\" and at a December rally with the president-elect, she repeated that sentiment, saying that the Trump administration would put an \"end to the federal Common Core.\" [Was Louis C.K. right about the Common Core?] Here's the problem: The federal government didn't technically impose the Core on the individual states; the standards were fully or in part approved by state bodies, departments of education or legislatures in 46 states. Only states can decide to get rid of the standards, and, in fact, some have. The Obama administration did dangle federal funds before states as incentives to adopt the standards - an act some states saw as coercion - but states didn't have to adopt them, and a few didn't. Recently, DeVos told Michigan radio station host Frank Beckmann that the Every Student Succeeds Act effectively does away \"with the notion of the Common Core,\" Education Week reported. Wrong again. The ESSA, the successor law to No Child Left Behind, left it to states to decide on their standards, but, then again, the states had that right before. And many states are still using them. A recent analysis found that of the 46 states that adopted the standards, eight states have officially repealed or withdrawn, 21 states have finalized revisions - many of them minor - or have revision processes underway, and 17 states have not yet made any changes.  Then on Monday, Devos told Fox News anchor Bill Hemmer that the ESSA \"essentially does away with the whole argument about Common Core.\" Hemmer asked her whether she would withhold federal funds to states that decide to maintain the Common Core standards as part of their ESSA accountability plans, which must be submitted and approved by the Education Department. This was her response: There isn't really any Common Core any more. Each state is able to set the standards for their state. They may elect to adopt very high standards for their students to aspire to and to work toward. And that will be up to each state. Of course there still is something known as the Common Core. What she may have meant was that the federal government can't tell states what to do about the Core, though, again, it couldn't force states to adopt them before ESSA was passed in late 2015. So, the bottom line is that DeVos, yet again, has talked - incorrectly - about the Common Core. Here's more to read: [DeVos criticized Denver for its school choice policies. Now Denver's superintendent fires back.] [The convenient pattern of Education Secretary DeVos's school visits] [DeVos: Picking a school should be like choosing among Uber, Lyft or a taxi]", 
            "contenttype": "Blog", 
            "source": "The Washington Post", 
            "headline": "Betsy DeVos said, ‘There isn’t really any Common Core any more.’  Um, yes, there is.", 
            "comment": [], 
            "person": [
                "Betsy DeVos", 
                "Bill Hemmer", 
                "Donald Trump", 
                "Frank Beckmann"
            ], 
            "theme": [
                "Common Core State Standards", 
                "Education Secretary Betsy DeVos", 
                "Common Core", 
                "Core Standards"
            ], 
            "primarysection": "Local", 
            "associatedbinaryurl": [
                "http://img.washingtonpost.com/rf/image_960w/2010-2019/WashingtonPost/2017/04/21/Editorial-Opinion/Images/Education_Accountability_54368-71245.jpg"
            ], 
            "organization": [
                "Betsy DeVos' Education", 
                "Betsy DeVos' Education Secretary", 
                "Betsy DeVos' Education Secretary Betsy", 
                "Betsy DeVos' Education Secretary Betsy DeVos", 
                "Common Core", 
                "Core State Standards", 
                "DeVos' Education", 
                "DeVos' Education Secretary", 
                "DeVos' Education Secretary Betsy", 
                "DeVos' Education Secretary Betsy DeVos", 
                "Education Department", 
                "Education Secretary Betsy DeVos", 
                "Education Secretary Betsy DeVos' Education", 
                "Education Secretary Betsy DeVos' Education Secretary", 
                "Education Secretary Betsy DeVos' Education Secretary Betsy", 
                "Education Secretary Betsy DeVos' Education Secretary Betsy DeVos", 
                "Education Week", 
                "Secretary Betsy DeVos' Education", 
                "Secretary Betsy DeVos' Education Secretary", 
                "Secretary Betsy DeVos' Education Secretary Betsy", 
                "Secretary Betsy DeVos' Education Secretary Betsy DeVos", 
                "Student Succeeds"
            ], 
            "blurb": "Yet again the U.S. education secretary makes a Common Core mistakes.", 
            "location": [
                "Florida", 
                "Michigan"
            ]
        }, 
        {
            "contenturl": "https://www.washingtonpost.com/national/kate-obeirne-feisty-conservative-commentator-dies-at-67/2017/04/24/c4984378-2902-11e7-b605-33413c691853_story.html", 
            "body": "Kate O'Beirne came of age in the 1960s, amid the second wave of feminism, but in a characteristically pungent quip, the conservative commentator said she \"learned more about self-worth, ambition and opportunity from my conservative parents and Catholic nuns than I ever did from Eleanor Smeal and Gloria Steinem.\" Such luminaries of the women's movement were to be looked on with a gimlet eye, she said. Instead, she lionized the nun who coached the debate team at her all-girls' high school and \"encouraged us to go in for the kill\" against male opponents. The nun also urged her to go to law school. Mrs. O'Beirne, who died April 23 at 67, was a lawyer, an Army wife, a federal employee, a think-tank executive and a journalist. She rose to prominence in the 1990s as a columnist and editor with the conservative National Review magazine and as a TV pundit. She was a regular on public affairs shows including NBC's \"Meet the Press,\" CNN's \"The Capital Gang,\" MSNBC's \"Hardball\" and PBS's \"To the Contrary.\" She was in demand for her good-humored delivery, her policy wonk's passion for statistics and her skill at pithy, often provocative rejoinders on matters ranging from the role of women in combat (she was against it), school vouchers (she was for them) to welfare (symbolized, she said, by inner-city people \"living on a liberal plantation.\") She took aim at what she considered President Bill Clinton's legislative shortcomings as much as his persona as a sensitive modern man attuned to the pain of others. \"Women don't want a guy to feel their pain,\" she once said. \"They want a guy to clean the gutters.\" Kate O'Beirne on \"Meet the Press\" in 2007. (Alex Wong/Getty Images for Meet the Press) At times, she chided Republicans for emphasizing \"family values\" while at the same time producing presidential contenders with high divorce rates. \"Should Mitt Romney join a 2008 race that included John McCain, Rudy Giuliani [and] Newt Gingrich,\" she wryly observed in a National Review piece, \"the only guy in the GOP field with only one wife would be the Mormon.\" Jacob Heilbrunn, author of \"They Knew They Were Right: The Rise of the Neocons\" and editor of The National Interest magazine, said Mrs. O'Beirne was \"not a transformative figure\" in conservative thought as much as a \"traditional Catholic conservative who made quite a name for herself\" through her high visibility. She was named Washington editor of National Review in 1995 and spent 11 years in the job, writing about Congress, politics and domestic policy. The title of her column, \"Bread and Circuses,\" was a winking reference to the poet Juvenal and his satiric view of the citizens of ancient Rome desiring diversion over anything else. She arrived at the magazine at an important juncture. National Review, founded by William F. Buckley Jr. in 1955, long had a \"monopoly on conservative intellectual thought,\" Heilbrunn said. But the end of the Cold War, the Republican surge after the 1994 midterm elections and competition from the upstart Weekly Standard in 1995 forced National Review to reinvent itself. That meant, in part, seeking out a new breed of writer - less dour, more lively. With her \"feisty and humorous\" perspective, Heilbrunn said, Mrs. O'Beirne seemed an ideal fit. In addition to policy matters, cultural issues - including the legacy of feminism - became a defining concern of conservatives. To have a woman addressing those points helped usher Mrs. O'Beirne to the forefront of punditry in print, on television and on the dais. Kate O'Beirne (C) and journalist Judy Woodruff during a taping of \"Meet the Press\" at the NBC Studiosin Washington in 2007. (Alex Wong/Getty Images for Meet the Press) Kate Monica Walsh was born in Brooklyn, N.Y., on Sept. 23, 1949, and she grew up in Manhasset on Long Island. Her father was a partner in the venerable Manhattan nightclub Jimmy Ryan's, which focused on traditional instead of progressive jazz. Her mother was a homemaker who raised four daughters - Kate was the second - in an Irish-Catholic Republican home known for its animated dinner-table discussions. She was studying English and journalism at Good Counsel College, a Catholic women's school in White Plains, N.Y., when she left to work on James Buckley's successful 1970 Senate campaign on the Conservative Party of New York ticket. She completed her degree the next year, then worked in Washington as an aide to Buckley, the older brother of the National Review founder. She graduated in 1976 from St. John's University law school in Queens, N.Y. She briefly practiced law at the Interior Department, then accompanied her husband - an Army officer - on his military assignments until settling in the Washington area in 1985. After two years as deputy assistant secretary for legislative affairs at the Department of Health and Human Services, she joined the conservative Heritage Foundation policy-research organization in 1988, working on domestic-policy studies. She rose to vice president for government relations at the think tank when she began contributing to National Review. After ending her run as Washington editor of the magazine, she spent six years as president of the National Review Institute, a nonprofit that organizes conferences and hosts fellowships. She was described as a mentor to many young women in the conservative movement. Survivors include her husband, retired Army Lt. Col. James O'Beirne, and their two sons, Philip O'Beirne and John O'Beirne, all of McLean, Va.; three sisters, Mary Ann Rowan of Severna Park, Md., Virginia Rowell of Potomac Falls, Va., and Rosemary Walsh of McLean; and four grandchildren. The family confirmed the death and said the cause was cancer. Mrs. O'Beirne died at a hospital in Washington. She had caused a stir in 2006 with her book \"Women Who Make the World Worse: And How Their Radical Feminist Assault Is Ruining Our Families, Military, Schools, and Sports.\" The book's premise was in keeping with her view that women were disserved by liberal lawmakers, feminists with a \"grievance agenda\" and others seeking - in her view - to reengineer society based on their \"antipathy to marriage and motherhood\" and their belief that \"there are no innate differences between men and women.\" In a C-SPAN interview, Mrs. O'Beirne said she did not take issue with \"consensus goals\" such as addressing sex discrimination in wages and employment, which she said had been achieved at the federal level decades earlier. \"Life was certainly simpler when we didn't have these opportunities,\" she said, \"but who would want to go back and not have the kind of choices we have? In other respects, I don't think women are necessarily better off. I think our culture, though more feminized, is coarser. I think traditional manners and mores and male chivalry did a better job of protecting women than litigation over girlie calendars.\" Read more Washington Post obituaries", 
            "contenttype": "Article", 
            "source": "The Washington Post", 
            "headline": "Kate O’Beirne, feisty conservative commentator, dies at 67", 
            "comment": [], 
            "person": [
                "Bill Clinton", 
                "Giuliani Newt", 
                "Giuliani Newt Gingrich", 
                "Gloria Steinem", 
                "Jacob Heilbrunn", 
                "James Buckley", 
                "James O'Beirne", 
                "Jimmy Ryan", 
                "John McCain", 
                "John O'Beirne", 
                "Judy Woodruff", 
                "Mary Ann Rowan", 
                "Monica Walsh", 
                "Newt Gingrich", 
                "Philip O'Beirne", 
                "Rosemary Walsh", 
                "Rudy Giuliani", 
                "Rudy Giuliani Newt", 
                "Rudy Giuliani Newt Gingrich", 
                "William F. Buckley Jr."
            ], 
            "theme": [
                "National Review Institute", 
                "National Review", 
                "Mrs. O'Beirne", 
                "Usher Mrs. O'Beirne"
            ], 
            "primarysection": "Obituaries", 
            "associatedbinaryurl": [
                "https://img.washingtonpost.com/rw/2010-2019/WashingtonPost/2017/04/25/Obituaries/Images/GettyImages-565419811493051221.jpg"
            ], 
            "organization": [
                "Capital Gang", 
                "Conservative Party", 
                "Department of Health and Human Services", 
                "Good Counsel College", 
                "Heritage Foundation", 
                "Interior Department", 
                "NBC Studiosin Washington", 
                "National Interest", 
                "National Review", 
                "National Review Institute", 
                "Review Institute", 
                "St. John's University", 
                "Washington Post"
            ], 
            "blurb": "She was a TV pundit and an editor with National Review magazine.", 
            "location": [
                "Long Island", 
                "New York", 
                "Potomac Falls", 
                "Severna Park", 
                "White Plains"
            ]
        }, 
        {
            "contenturl": "http://www.washingtonpost.com/video/politics/trump-canadas-trade-practices-are-a-disgrace/2017/04/24/7b1a6d54-2950-11e7-9081-f5405f56d3e4_video.html", 
            "comment": [], 
            "contenttype": "Video", 
            "headline": "Trump: Canada’s trade practices are a ‘disgrace’", 
            "source": "The Washington Post", 
            "theme": [
                "Trade Practices", 
                "President Trump"
            ], 
            "location": [
                "United States"
            ], 
            "associatedbinaryurl": [
                "http://s3.amazonaws.com/posttv-thumbnails-prod/04-25-2017/t_1493081397857_name_20170420_trump_thumbnail_compressed.jpg"
            ], 
            "blurb": "President Trump on April 20 said Canada’s trade practices on dairy, lumber, and energy are unfair to the United States. “We’re going to have to get to the negotiating table with Canada very, very quickly,” Trump said.", 
            "primarysection": "Politics"
        }, 
        {
            "contenturl": "https://www.washingtonpost.com/news/grade-point/wp/2017/04/24/lawsuit-filed-against-uc-berkeley-for-canceling-ann-coulter-speech/", 
            "body": "San Francisco attorney Harmeet Dhillon (right), who represents the Berkeley College Republicans, speaks at a press conference on Monday, April 24, 2017, about a lawsuit filed by the group against the University of California. The student group that invited Ann Coulter to speak on campus says the university is discriminating against conservative speakers and violating students' rights to free speech.  At left is legal partner Krista Baughman. (AP Photo/Eric Risberg) Student groups have filed a lawsuit against the University of California at Berkeley, saying school officials violated their right to free speech when they canceled a talk by a controversial speaker last week over security concerns. [How Berkeley has become the far left and far right's battleground] The lawsuit, filed by a prominent Republican lawyer, Harmeet Dhillon, on behalf of Berkeley College Republicans and Young America's Foundation, a national group fighting First Amendment issues on many campuses, charges that the university's actions smother the speech of conservative students whose opinions are a minority at Berkeley. Berkeley has become a flash point in the national debate over free speech, with clashes between the far left and the far right flaring into violence this year. The prestigious public university, where the campus free speech movement was born decades ago, has in recent months become a magnet for protesters and masked agitators who have fought, set fires and tossed explosives. [Trump lashes back after violent protests block speech by Breitbart writer Milo Yiannopoulos] In February, President Trump raised the threat of pulling federal funds from the public school after university police put the campus on lockdown and canceled a talk by another controversial figure, Milo Yiannopoulos, amid intense protests. Here's a look at some of the protests in the Berkeley, Calif., area in recent months. (Gillian Brockell/The Washington Post) Berkeley College Republicans invited conservative commentator Ann Coulter to speak on campus Thursday, but university officials canceled the event because of concerns that they could not ensure student safety. They then invited her to speak next week instead at a safer location. Coulter is not a plaintiff, but on social media she called it \"our lawsuit\" and said they had asked for a safe venue for her speech \"THIS THURSDAY.\" The lawsuit contends, \"Though UC Berkeley promises its students an environment that promotes free debate and the free exchange of ideas, it had breached this promise through the repressive actions of University administrators and campus police, who have systematically and intentionally suppressed constitutionally-protected expression\" by the students who invited Coulter and the many students whose political views align with the plaintiffs, \"simply because that expression may anger or offend students, UC Berkeley administrators\" and community members who disagree. The lawsuit, which requests unspecified damages, attorney fees and a jury trial, names four university leaders, including University of California President Janet Napolitano and Berkeley Chancellor Nicholas Dirks, and three campus police officials as defendants. Dianne Klein, a spokeswoman for the University of California, sent a statement in response to the suit: \"The University of California welcomes speakers of all political viewpoints and is committed to providing a forum to enable Ann Coulter to speak on the Berkeley campus. \"The allegation contained in the complaint filed by Young America's Foundation that Ms. Coulter is being prohibited from speaking because of her conservative views is untrue. As the complaint itself notes, Young America's Foundation has sponsored many other speaking events at UC Berkeley in past years, including that of conservative political commentator and author Ben Shapiro, and the organization's efforts have led many notable conservatives to share their viewpoints with students and the public on campus. \"UC Berkeley has been working to accommodate a mutually agreeable time for Ms. Coulter's visit - which has not yet been scheduled  - and remains committed to doing so. The campus seeks to ensure that all members of the Berkeley and larger community - including Ms. Coulter herself - remain safe during such an event.\" The College Republicans did not immediately respond to a request for comment about the lawsuit Monday. \"It used to be that universities were the beacon of intellectual thought and debate,\" Cliff Maloney Jr., president of Young Americans for Liberty, wrote in an email Monday. \"It is a shame that administrative agendas and regulations have stifled open and honest discourse. \"... All speech, whether popular or not, must be protected and we encourage students to challenge their public universities by demanding constitutional policies and practices.\" undefined Read the complaint here:   Staff writer William Wan contributed to this report.", 
            "contenttype": "Blog", 
            "source": "The Washington Post", 
            "headline": "Lawsuit filed against UC Berkeley for canceling Ann Coulter speech", 
            "comment": [
                "This is not a First Amendment issue. The First Amendment to the Constitution of the United States of America does NOT grant us, as citizens, the freedom of speech. It states that it is NOT within the Government's powers to limit that inalienable right that we as Americans possess by virtue of being human. There is a huge difference between the two points. One suggests that the Government has given us this right. The second suggests that God did.", 
                "Berkeley has had violent clashes on their property.\nNaturally, safety concerns played in the re-arranging of the date and venue.\nAnn claims to be unable to re-arrange her schedule.\nThat is very unfortunate, especially given how much attention she has gotten over this. \n\nIt is right to allow her to speak, but safety has to be paramount. \nAgree with her or not, it is edifying to know the views of others.", 
                "If I was the Chancellor of UC Berkeley. I would kick Both College Republicans and College Democrats Off of the Campus! And make the University a Politics Free Zone!!!", 
                "The UC Berkeley College Republicans are a campus student group. Student groups are allowed to use basic campus facilities at no cost (if available), but must cover any additional costs, like security.\n\nThe UC Berkeley College Republicans did not agree to pay for necessary security, and they did not inform the University of their intention to hold this event. The University became aware of it from reading local press.", 
                "Waaaaaah. I can't find an audience! Perhaps by rudely pushing myself into an arena where I am patently unwelcome, it will boost my book sales among my audience, who are just barely literate.", 
                "Why is it that republicans are always looking to sue someone for usually frivolous reasons?  I have no problem letting Ms. Coulter speak but when you need to organize a safe environment with police force to keep the peace you need to choose your times a bit.  Lighten up on the lawsuits....isn't this the party trying to outlaw suits like this?", 
                "She can enjoy her free speech. Her teeth, however, are not guaranteed by the Constitution.", 
                "Lawsuits are the Donnie way of doing things.", 
                "Violence is the way the Leftists do things...... just like the communists in Russia and National Socialists in Germany", 
                "Coulter makes a living on the equivalent of shouting \"fire\" in a movie theater.  She has no redeeming value.", 
                "So, canceling a speech by anyone who causes potentially violent situations, is not allowed or legal?.........hmmmmmmmm", 
                "That's correct, it's explained in another WaPo article here:\nhttps://www.washingtonpost.com/news/volokh-conspiracy/wp/2015/10/28/sixth-circuit-rejects-hecklers-veto-as-to-anti-islam-speech-by-bible-believers/?utm_term=.f4beded2bea7\n\nBut it should be noted the ones causing the potentially violent situations would be the violent masked, criminals of fascist Antifa whose crimes are NOT protected by 1A.", 
                "I dunno. I think once you're at the point where you're trying to \"argue\" or have a discussion with a conservative, it might be time to admit that they're simply not qualified to have those kinds of interactions. Violence is certainly plan B, but I would argue it's the most effective plan when a trump-supporter is involved.\n\nReally, they're just like mobile ferns. They have no self-awareness. Nothing is really lost when you kick them in the teeth.", 
                "So, [Incitement:] The right to freedom of speech provides that a state cannot “proscribe advocacy of the use of force or of law violation except where such advocacy is directed to inciting or producing imminent lawless action and is likely to incite or produce such action.”   In the case you referred to, the \"incitement\" issue was not part of that case......\nNow, the location and situation in which the Coulter speech was to be, has already experienced violence occurring because of right wing hate speech.  Me thinks, a lawsuit in this case, just may come out on the short end of winning.....unless Gorsuch, conveniently, intervenes......", 
                "@Unreader - As the article explains, inciting applies if the speaker is directly using speech to incite and urge their audience to commit imminent violence to others.  \n\nIt does NOT apply to, nor is the speaker responsible for the inability of mentally defective leftwing criminals to refrain from violence because anything they disagree with is 'hate speech' and they just have to bash in heads with bicycle locks, throw M80s in to crowds, set fires etc.   \n\nP.S. even legitimate hate speech IS protected by 1A.", 
                "That horrible human being doesn't give a rip about her speech- the one and only purpose of those lame College Republicans was to create a sh*storm over this issue.  They know anything that comes out of Berkeley (especially in a negative light), is just another dog whistle to their mindless minions.  Ms. Coulter is nothing other than a verbal bomb-thrower, who makes no sense with any of her hyperbolic arguments- usually based on lies in the first place.  She doesn't care about making any converts.  She only wants to keep stirring the pot, to keep the willfully ignorant money machine buying her \"books.\"", 
                "The liberals, radicals Democrats have most of the sh*t storm idiots; why is it that the Dems are always complaining, rioting, demonstrating, posting false comments and the Repubs are the nice ones?", 
                "I don't know. Why is it no conservative can spell out \"Democrat\"? I mean we can spell out xenophobic, subliterate, garbage-sack, why can't you finish yer words, Billy?", 
                "A large majority of the American universities are brainwashing the students with radical liberal and socialist ideas and views and should be sued.  Universities that take government from our government should get these funds stopped immediately if they allow only liberals to speak as they are doing now, and fined as well.  Universities are for teaching not brainwashing.....leave that to Russia.", 
                "What a moroon...", 
                "your Russia throw in, reveals your brainwashed Trump defender offense......  morons are the epitome of Republican/Trump/Pence voters and supporters.....thanks for proving it, once more....", 
                "Anything you lack the attention-span to understand is \"brainwashing\", right? And you wonder why we're elitists?", 
                "Man Coulter is the tranny Kim Davis.", 
                "Interesting how WaPo mixes the peaceful free-speech conservatives and libertarians with the violent attacks by left-wing, anti-speech antifa communists.  Hasn't everyone seen the videos of them attacking people with chains and bike locks?", 
                "Please be aware that the riot in Berkeley on the day before Easter was instigated by your \"peaceful free-speech conservatives,\" who brought in \"defenders\" from other states to pick fights with anyone who disagreed with them. You can find this out easily by using Google.", 
                "Since the Berkeley mayor and the police chief have ordered BPD to stand down in previous Antifa riots &amp; the campus police can't or won't protect  students from these violent masked criminals, it's time to call in the national guard.  \n\nIt's also time to investigate the mayor &amp; chief of police for giving the stand down orders and effectively protecting violent felons, rioting, committing arson &amp; assaulting &amp; beating people.", 
                "They only call in the National Guard if Lena Dunham is speaking.", 
                "Do you remember the takeover of that Oregon wildlife refuge by right-wing militias last year? For weeks on end, the authorities stood down even though it was public property that had been seized, damage was done to the property, the public could not access it, and there was a constant threat of violence. You know why the authorities stood down? I think they calculate that the risk warrants standing down, and it will be safer for everyone involved (including both the FBI and the militia members). No one wants another situation like what happened in the 1990s in Waco, Texas, even though a less professional instinct might be to respond aggressively. This isn't a right-left-crazy anarchists issue. This is how level-headed professionals sometimes handle these sorts of situations.", 
                "It's easy to tell by your choice of words that you're not here to read or comment on the article at hand, but to push your belief that the incendiary branch of the political alt-right has some God-given right to instigate destruction in Berkeley whenever and wherever it pleases. Well, you don't. You were given an alternative. You were given a different alternative. But no -- the little snowflake whiners give a damn only about their grandstanding, not about what's practical for the city. Losers!", 
                "They are letting Coulter speak at the campus last I heard.", 
                "The video evidence of Berkeley police standing down during the Milo protest and the free speech demonstration last week will be very damning to Berkeley's case. They can't say they are unable to safeguard the event when they didn't even try. Volokh wrote about a similar case in Michigan a few years ago: https://www.washingtonpost.com/news/volokh-conspiracy/wp/2015/10/28/sixth-circuit-rejects-hecklers-veto-as-to-anti-islam-speech-by-bible-believers\n\nThe heckler's veto can never be used as an excuse to stifle speech.", 
                "I agree with you on the heckler's veto point. But I think you're wrong about the Milo protest. Here's an article that explains why the authorities sometimes stand back in heated situations. Some key quotes: \"You don’t want to do anything precipitous that would heighten the degree of confrontation,\" says Tom Kubic, the former FBI special agent... \"\"Another reason for the feds to be cautious is to keep an isolated group from becoming martyrs.\" Anyway, I have no problem accepting that dealing with a group of crazy people is complicated, and a light touch might be the best option in some (not all) situations. \nhttp://time.com/4167006/oregon-militia-standoff-ranchers-fbi/", 
                "The White House Oval Office is the New Bullying Pulpit from which it's bulldog barks:  threatening fines, and withholding of Federal funds if his 'friends' are not given any respect. That's the behavior of an Emperor of a Republic---NOT A DEMOCRACY!!!", 
                "Actually George, the US is a constitutional republic and not a democracy.", 
                "Did UCB not provide a facility? Did Coulter not agree to the change (she did)?  What more did the group want beyond a professional speech and meeting opportunity?  It was accommodated.", 
                "Coulter did not agree to a change, she wants the original contract enforced.", 
                "They did not specify where the speech was to be given, and they set a new date when she could not attend(previous contractual obligation), when most students would be either in class, or off campus\n\nWe can see through what the leftists are doing..... Cut all funding to the University of California, all campuses", 
                "Ann Coulter may have the right to speak but she doesn't have the right to an audience.\n\nIf she speaks during Dead Week the students who want to hear her will come.  Those that don't, won't.  That's not Berkley's problem.\n\nThe complaint is laughable.  It's a pity party whine.  Basically they're saying they'd rather have a riot than change the date or venue.  They'd rather see the public put at risk just so they can have their way.", 
                "The College Republicans will win this lawsuit, it's not even a close call. Not even in the 9th Circus.", 
                "Correct, she has no right to an audience. But, the audience that does want to attend her lecture have the right to do so without the threat of violence and assault.", 
                "Where are these safe-space, you owe me an apology,  liberal  leftists going to work after college? really?\nIn the real world we don't have safe-spaces; no one is going to give a \"F\" if you get offended either in the real world, and no one is going to give you snowflakes an apology, no less a job.", 
                "This isn't about safe spaces.  It is about public safety.  It's campus police who are concerned they can't provide that safety if Coulter comes to Berkely.", 
                "Why is it that liberals can't control themselves from being violent?", 
                "\"It is about public safety.\" That is pretty much equivalent to the statement that the government - in this case the \"government\" as instantiated by the president and trustees of the University of California, Berkeley -  requires no more than a plausible sounding claim of a threat to public order in order to justify shutdown of political speech they do not agree with. That is a frightening possibility, in practice not meaningfully different from simply making such speech illegal.\n\nWe collectively authorize the government a near monopoly of the lawful use of force partly so that it can protect the rights documented in the Constitution and granted in laws. The government loses legitimacy when it fails to do that, as it does when it fails to observe them. By various reports, the University of California and the Berkeley police have done both.", 
                "liberals are always the ones creating dissension and disruption.  They just seem to like doing that.", 
                "You're high man. In every company I consult for, it's the conservative nut-jobs who are ostracized... rightly. Conservatives are simply not very good employees.", 
                "LOL Like anyone believes you consult anywhere\n\nAnd if violence is the answer, you will get stomped like those poor Antifa who got the crap kicked outta them in Berkeley last week.\n\nDon't worry, you will have plenty of chances to try your violence I think, and I don't think you will be very happy at the outcome", 
                "Liberals only support freedom of speech when they're guaranteed to hear their own party line...", 
                "The Washington Post is considered a liberal news organization and your comment hasn't been deleted. How is your speech being silenced?", 
                "You're describing the man who's currently in the W.H.", 
                "For all the nutty reactionaries here: UCB canceled that date for safety reasons but did offer to reschedule on a different date. This is not a free speech issue. You have no case.", 
                "More importantly, the lawsuit is bogus on its face.\n\nUCB is under no obligation to allow anyone to speak on its campus EXCEPT people who work or are students there. Coulter herself has no standing to sue, because she has no right to speak in the first place.\n\nAs to the students themselves  who are suing: they have no injury to show. They have not been prevented from exercising the 1st amendment rights; listening to someone else speak is not a right.\n\nThe lawsuit is exactly what this whole thing was about: trying to make UCB look bad so Coulter and the Young Republicanson can fundraise on the \"outrage\" (which doesn't exist).\n\nIt's a cynical, perverse, and selfish group, nothing more.", 
                "I feel so bad for the conservative snowflakes who attend Berkley. They really need a safe space where they can be free to voice their desire to strip voting rights from minorities, defund the social safety net for the benefit of corporate overlords, and teach the prosperity gospel. It's like if they can't bring in one of their demagogues to spew hatred, they can't spew their hatred at all. Such a 1st Amendment violation! Sad!", 
                "The \"snowflakes\" are mostly trying to study technology and making societal contributions without being harrassed.  Angry self loathing folks that can't hope to get to that point of excellence are wanting a riot.  Not sad, pathetic.  Get a life.", 
                "Oh my, aren't you a bigot. Someone doesn't believe like you, you accused them of spewing hatred. You sound very hateful.  That's the problem with extremists of either left or right. You're all just a bunch of bigots who never look for common ground. Destroy anyone who doesn't act, look or believe as you.  \n\nWhat are the extreme liberals at Berkley afraid of?  The same thing the extreme religious right is - if they look at the other side someone might change their mind. You're scared to let people think for themselves and make up their own mind.  BIGOT.", 
                "Bigotry is an irrational hatred or fear of someone. My distaste for a woman who has espoused unconstitutional views and supported the commission of war crimes isn't irrational. I believe in human rights and she advocates for violations thereof. This isn't an us vs them scenario. I'm perfectly willing to hear reasonable people speak. She's not reasonable. She literally spews hatred. That's not hyperbole. And no one has any obligation to entertain an intolerant person. Tolerating intolerance is tacit support for intolerance. You can't abide Ann Coulter and proclaim to believe in human rights because her views contradict them.", 
                "Jorgen - fortunately your views on what/who are reasonable are irrelevant here.  Cal is a state actor whose ability to stifle free speech is much more limited.", 
                "They didn't say she couldn't come and speak, just that the previously scheduled date and location wasn't tenable due to safety concerns. UCB is liable for its failure to ensure public safety. If it is known in advance that a safety concern existed, they could be liable for injuries. They offered to reschedule and relocate. That's not stifling speech. And nothing stops Ann Coulter from renting her own space and speaking all she wants. She could come to a private residence and speak. The university, however, has no obligation to host her. If it did, then it would have an obligation to host anyone. You try to demanding that the university host you at a speaking event and see how far your 1st Amendment argument gets you. Or spend a little more time researching case law so you actually understand free speech in practical application.", 
                "Not a clue about the First Amendment.  The more disliked the speech, the more it is to be protected, and minority political speech most of all.  But, of course, superior people are not subject to the law 'cause they're special. 0___0", 
                "Poor Ann Coulter with her million dollar book sales and TV appearances and radio show gigs and newspaper articles and website articles needs her speech protected or no one will ever hear her. Her speech is so abridged.", 
                "The key question here is whether or not the students got consent to use university facilities before scheduling Coulter's appearance.  The university claims that they were not consulted before the date was set.  If in fact that's true, then they will lose their suit, simply because the facilities belong to the university and like any property owner, they have the right to control when those are used.   In addition the university has the obligation to provide security and if the date was scheduled without prior arrangements for security, then the university has the right to refuse that date.", 
                "Depends on whether the U's objections are found to be legit or pretexts.", 
                "Actually, it doesn't depend on that at all.  If the students did not follow University policies in setting up the event, then they have no case.  That would be true for Ann Coulter or Bernie Sanders.", 
                "Free speech but only where and when the government says? \n\nAnyone who didn't follow \"policy\" was prohibited?  Like the fire-bombers?  Not one arrest.  No announcement of invoking the riot act when the rioters were trashing public property and attacking citizens.  Not one arrest.", 
                "Ann Coulter is an instigator and purveyor of hate and everybody knows that. Even though her hate speech may risk violence, Berkeley is still trying to accommodate the event. These young Republicans just won't take yes for an answer.", 
                "Liberal Leftist Scum will not stop free speech", 
                "So speaking in dissent of Left wing politics is guaranteed violence.\n\nHitler and Stalin both had the same response", 
                "You're convincing no one of this nonsense. Berkeley is trying it's leftist best to keep her from speaking.", 
                "The conservative group demanded that people be allowed to come in from off campus (nothing could go wrong there).  UCB has to ensure safety above all else and provided a venue out of the way with better tactical security.  Question: what staunch conservative metriculates at Berkley in the first place except to cause a ruckus?", 
                "Ummm, let's see: A CA resident seeking an education from a prestigious university at a more modest cost?  Or, perhaps, child of an Alum raised to respect Cal?  Recruited athlete or longtime Cal athletics fan.  Suspect even you could come up with others notabot.", 
                "There are options all over the state.  Get real.", 
                "Right.  Exclude anyone who is not a flaming liberal from attending this campus of the University of California.  A per se violation of the First Amendment.   Fascists, right or left, hate freedom.", 
                "Berkeley is quite an embarrassment.  Those babies are so mentally weak!  Hope they lose all funding from the government.  Not a penny should be spent there on any project or research.  Why fund them?  They think like 2-year-olds there.  Two-year-olds cannot do quality research.", 
                "Let's level-set.  The very reason you can even post here is because of in no small part because of Berkley's technology.  You contributed a conniption fit.  Personal computing and networks vs. conniption... tough call.", 
                "We are talking about a government institution infringing on speech - not technology - infringing to prevent radical lefty terrorists from throwing a violent fit.  By their threat of further violence these terrorists sought to again intimidate the government, in the persons of the bureaucrats in charge of U.S. Berkley, from allowing the free exercise of political speech by an unpopular speaker.  Joe McCarthy would be proud of you.\n\nThe basis of the technology you mention was the work of scientists at AT&amp;T Bell Labs, not Berkley.", 
                "There came a point during McCarthyism at which all but truly deranged zealots just needed it to end.  \n\nWe are getting there with PC\n\nThat only makes the point more deeply\n\nHow many Left Wing political speeches have been prohibited by violence in US Universities over the past 30 or 40 years?\n\nNow how many right wing political speeches have been prohibited by violence in the 4 months so far in this year", 
                "It's not about free speech -- Ms. Coulter can fly out to California, rent a hotel room and megaphone and shout out the window all she wants.  In this instance, the campus security at Berkeley is not able to guarantee the safety of those attending or protesting Ms. Coulter's speech.  She and the Young Republicans can find an alternative date when security can be assured, or they can go it alone.", 
                "That's pure B.S. and you know it. if Lena Dunham was speaking they would guarantee her safety with the National Guard.\nWhy can they guarantee her safety one day but not another?", 
                "That only makes the point more deeply\n\nHow many Left Wing political speeches have been prohibited by violence in US Universities over the past 30 or 40 years?\n\nNow how many right wing political speeches have been prohibited by violence in the 4 months so far in this year", 
                "So violence is inevitable if someone speaks in dissent of left wing politics?", 
                "The bare truth is that neither Ann Coulter's intellect nor the product of that intellect rise to the level of Berkeley's academic standards. Conservatives always bemoan lowering the bar. Berkeley hosting Coulter is lowering the bar all the way into the gutter. Congrats. She does lazy, hateful, irrational schtick. Nothing more. A lot less. But let her speak. Denying her gives way too much publicity.", 
                "You do not believe your post\n\nShame on you\n\nFreedom of political speech has no bar to be either raised or lowered\n\nYou were well aware of that when you posted", 
                "We saw the darting shadows of Berkeley's high standards in the raging flames of leftist dissent during the spring riots. Have a nice night.", 
                "Congratulations.  In the end, you get it.   She has to be allowed to speak or Berkeley is no better than the fascists of the right who proclaimed \"No freedom of speech for Commies.\"   There is no qualifying bar for political speech becasue no official can be trusted to administer the test.  The marketplace of ideas will pronounce the \"grade\" AFTER the speech.", 
                "Hannity starting to use Law suites as well as Coulter.. the Way to stop the Dem Lies. ABOUT Time", 
                "Are law suites big rooms in hotels near law schools and court houses?", 
                "Please, please tell me (truthfully) you are not a lawyer.  Your post below on what the 1st amendment requires or doesn't require is absolutely chilling if coming from a lawyer.  Let alone just plain WRONG.", 
                "\"Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof; or abridging the freedom of speech, or of the press; or the right of the people peaceably to assemble, and to petition the Government for a redress of grievances.\"\n\nSo where in those words (or the last 200+ years of case law) do you derive a requirement that a public institution has to allow someone to come and speak on a specific date?", 
                "\"If we took away women's right to vote, we'd never have to worry about another Democrat president. \"\n\n\"I think there should be a literacy test and a poll tax for people to vote. \"\n\n\"We should invade their countries, kill their leaders and convert them to Christianity. We weren't punctilious about locating and punishing only Hitler and his top officers. We carpet-bombed German cities; we killed civilians. That's war. And this is war. \"\n\nTell me, why should Berkeley have to provide a venue for this person to speak?", 
                "Do they take tax payer money?  If so, then they need to be open and not throw tantrums like toddlers when their ideas are challenged.", 
                "So you're going to force me to pay money to allow someone who advocates forced conversions to a particular religion to spew her hate.", 
                "Free speech isn't unlimited. Nobody has to be given a forum for their unconstitutional views and advocacy for war crimes. She can say what she wants somewhere else. There's no obligation to entertain her vitriol. The 1st Amendment just means the government can't pass a law to stop her from spewing her b.s.", 
                "@ Jorgen Fleisterman - Hello! The first bolded part of this link is especially for you: https://www.popehat.com/2016/06/11/hello-youve-been-referred-here-because-youre-wrong-about-the-first-amendment/", 
                "To counter your venue of her speech?\n\nYou seem fond of your right to speak for her\n\nHow about her right to speak for her?", 
                "My right to speak for her? You mean my right to repeat words she has actually already said in public??? You're trying to tell me I'm violating her rights by REPEATING WHAT SHE HAS ACTUALLY SAID and voicing my opinion that taxpayers should not be forced to provide a platform for those words that she herself has actually said????", 
                "Because the Constitution says so and even the left is subject to the highest law of the land.  Even you.", 
                "We are the only country in the world that has freedom of speech, I will fight tooth and nail to keep it that way ... If this was going on when I was President of the College GOP, I would go further, I would throw their tactics right back in their face. I would file a civil rights lawsuit against UC Berkeley and the state of California under title XI, violation of the female and minority students rights for not creating a \"safe space\" for to express themselves and associate with like minded people ... that safe defense in utter nonsense, all they have to do is enforce the law like they did in Alabama at Auburn, no mask and committing act of violence or physically preventing safe passage is automatic expulsion", 
                "\"We are the only country in the world that has freedom of speech, \"\n\nYou need to go back to college if you believe that.", 
                "Liberals think free speech applies only to them.", 
                "The alt-right is using the 1st Amendment as a scapegoat.\nAn ultra-right winger in an ultra-left bastion isn't about free speech, it is about intentional provocation.\n\nIt's all about inciting violence and chaos to further Bannon's dream of \"de-constructing the state\".\n\nIn order to prove that, all we have to do is hold a gay parade or a NAACP meeting in any rural area of the former Confederacy.\n\nNot much 1st Amendment there, but lots of bigots, bed sheets, and burning crosses.", 
                "The only provocation, chaos, and especially incitement of violence comes from the socialist left Antifa's. Unpopular and even hate-speech is protected by the 1st amendment.\n\nLiberalism is a mental disorder.", 
                "And if Miss Coulter shows up in one of her signature shirt skirts, local Libs have every right to rape her.\n\nInevitable really.  Her fault", 
                "@Neal UW, \nI'm hoping your comment is just dark-satire, but if not, you should really get some mental help so the voices stop telling you these things.", 
                "Then you should do these things, right.\n\nDies the Holocaust justify Holocausting contemporary Germans?", 
                "Republicans staging a publicity stunt to complain about not getting something they know for a fact they're going to get eventually anyway? Well that's a new one on me.", 
                "Pay up, Berkeley. You discriminate against conservatives, you pay the price. Ann deserves every penny she can get from the suit....more power to her.", 
                "Read the article, tool. She's not even a plaintiff to the suit. People like you ruin newspaper comment sections", 
                "I said she DESERVES the money.....I did not say that she would actually GET it, or be an active part in the suit.  And if you don't like my comments, Señor, you are free to join the Berkeley staff, discriminate like they do, and make a fool of yourself. Have a nice evening.", 
                "Ann Coulter is one of the worst people on this Earth.  She deserves all the CRAP that can be thrown her way.", 
                "You might be right about Ann Coultert, but that doesn't change the facts of what the looney-left at Berkeley is trying to do.", 
                "It isn't a left versus right issue -- it is crowds of thugs -- Brown shirts, anarchists, alt-right -- all of the aforementioned, who want to fight one another and use the pretext of a speech like Ms. Coulter's to go at it.  Now if Attorney General Jeff Sessions wants to show up in riot gear with his law and order patrol and see if he can tell who's who, he should do so.", 
                "@MinnyMa, it's not the \"Brown Shirts\" that are the problem, it is the black hooded thugs wearing skinny-jeans and masks that cause all the rioting. It wasn't brown shirts destroying Berkley when Milo Yiannopoulos came to speak, it was leftist- antifa's that caused over $100,000 in damage to their own school.", 
                "I have a real problem with students attending a university to gain knowledge to sue the university because their liberated learning experience is interrupted by  democratic free speech, one way or another.  I would venture a guess that their parents pay nothing to send them to college so that they can enjoy the college experience.  When they are spit out the other end of their \"college experience\", \nthey can reflect on their experiences with any company looking to recruit slide and glide students.  It is no wonder that competing students from other than the US understand the education that awaits them will reap harvests.  This is unlike the US born students that have \"enjoyed\" the experience.  God bless us everyone\".", 
                "How many times are they going to rewrite this article before we get a verdict?", 
                "1st Amendment doesn't give you the right to speak when and where you want. That being said, Coulter should be allowed to speak. And then shouted down and derided like all the other crackpots.", 
                "No. Not shouted down. Debated sure, but this idea that we shout down, or pull fire alarms, or throw tantrums, needs to stop. Objectionable speech should be met with an argument.", 
                "That's just it.....there are few effective arguments against what Ann says, because she is correct most of the time.", 
                "The Constitution is an effective argument against what Ann says, because she espouses unconstitutional positions such as voter disenfranchisement in violation of the 14th and 15th Amendments.", 
                "Is the Corporate GOP in DC paying for the lawsuit as well as the speaking fees now?", 
                "I suppose Mexico will be paying for it, just like for Trump's fictitious wall.", 
                "Isn't this the business plan of all right wing speakers?  Book a speech at a liberal college, collect your speaking fees, wait for the school to cancel, profit.  I bet you she didn't have anything prepared because she knew she would get cancelled.", 
                "... Sure... delaying the Coulter speech by one week would land it on the calendar during \"dead week\", when there are no classes and no normal campus life during this week just before finals.  Nice try, but you do not pull the wool over our eyes so easily....", 
                "As much as you like your hate speech and pedophiles, Berkeley is not prohibiting it, just trying to keep people safe. For some reason the people you admire seem to cause protests - which happen to be protected by the 1st amendment.", 
                "Lib Mob rule killing free speech.  And the irony...at UCB."
            ], 
            "person": [
                "Ann Coulter", 
                "Ben Shapiro", 
                "Cliff Maloney Jr.", 
                "Dianne Klein", 
                "Janet Napolitano", 
                "Milo Yiannopoulos", 
                "Nicholas Dirks", 
                "William Wan"
            ], 
            "theme": [
                "University of California at Berkeley", 
                "Berkeley College Republicans"
            ], 
            "primarysection": "Local", 
            "associatedbinaryurl": [
                "http://img.washingtonpost.com/rf/image_960w/2010-2019/Wires/Images/2017-04-24/AP/Berkeley_Ann_Coulter_15548-adbef.jpg"
            ], 
            "organization": [
                "UC Berkeley", 
                "University of California", 
                "University of California at Berkeley"
            ], 
            "blurb": "Students charge that the university suppressed free speech when it limited when and where conservative commentator Ann Coulter could talk on campus", 
            "location": [
                "San Francisco"
            ]
        }, 
        {
            "contenturl": "https://www.washingtonpost.com/news/early-lead/wp/2017/04/24/serena-williams-posts-love-letter-to-unborn-child-celebrates-brief-return-to-no-1/", 
            "body": "Serena Williams has not played since winning the Australian Open in January. (Scott Barbour/Getty Images) Serena Williams had confirmed last week through a spokesman that she is pregnant, but Monday brought her first direct comments on the happy news. The 35-year-old posted a love letter to her unborn child on social media, one in which she celebrated some other happy news: her return to No. 1. [Williams is the latest in line of women to compete - and win - while pregnant] That stay will be brief, as Williams, who gained the No. 1 ranking when she won the Australian Open in January, has not played since then and, in the wake of her pregnancy, will take the rest of the season off. Since that triumph, in which Williams earned her 23rd Grand Slam singes title, a record for men and women in the Open era, she slipped to No. 2 behind Germany's Angelique Kerber, but a quirk in the WTA schedule pushed her back up. With Williams idle, Kerber will regain the top spot as soon as she wins a couple more matches, but in the meantime, Williams was \"so happy to share being number one in the world\" with her unborn child. She also confirmed that she will return to competition after giving birth, writing, \"I can't wait for you to join the players box next year.\" \"My Dearest Baby, You gave me the strength I didn't know I had,\" Williams wrote. \"You taught me the true meaning of serenity and peace. I can't wait to meet you. . . . From the world's oldest number one to the world's youngest number one. - Your Mommy.\" My Dearest Baby, You gave me the strength I didn't know I had. You taught me the true meaning of serenity and peace. I can't wait to meet you. I can't wait for you to join the players box next year. But most importantly, I am so happy to share being number one in the world with you.... once again today. On @alexisohanian bday. 😉 from the world's oldest number one to the world's youngest number one. -Your Mommy A post shared by Serena Williams (@serenawilliams) on Apr 24, 2017 at 6:06am PDT Williams became the oldest women to reach No. 1 in the WTA rankings in 2011, when she was 31. She first hit the top spot in July 2002, and she has held that position a total of 317 weeks, behind only Steffi Graf (377) and Martina Navratilova (332). Williams also gave a shout-out to her fiance, Internet entrepreneur Alexis Ohanian, who turned 33 on Monday. In turn, he shared his own social media post that celebrated the fact that she \"announced officially\" her pregnancy earlier in the day. A new Snoo is on the way! My number one, @serenawilliams, is pregnant (she announced officially earlier today) and I'm so excited to meet the little one. You keep amazing me. April 24 is a hard day for all of us Armenians; may we always remember the sacrifices our predecessors made; honor them through our successes; and appreciate our blessings. A post shared by Alexis Ohanian 🗽 (@alexisohanian) on Apr 24, 2017 at 8:30am PDT Williams had apparently announced her pregnancy in an inadvertent way last week, posting an image to her Snapchat account that showed her with a bit of a belly and included the caption, \"20 weeks.\" She subsequently deleted the post, but the news had gotten out, and her caption indicated that she had been pregnant when she won the Australian Open. Later on Monday, Williams posted a note to social media in which she excoriated Romanian Fed Cup captain and former tennis star Ilie Nastase for making \"such racist comments toward myself and unborn child, and sexist comments against my peers.\" Of William's child, Nastase had reportedly said, \"Let's see what color it has. Chocolate with milk?\" \"This or anything else will not stop me from pouring love, light and positivity into everything that I do,\" Williams wrote. This will be the first child for both Williams and Ohanian, whose relationship dates back to at least October 2015, and who became engaged in December 2016.", 
            "contenttype": "Blog", 
            "source": "The Washington Post", 
            "headline": "Serena Williams posts love letter to unborn child, celebrates brief return to No. 1", 
            "comment": [
                "Congrats serena-we are very proud of you and your family", 
                "Congratulations, Serena.  You are on the threshold of life's greatest adventure.  It is yours to share with your family. You are a rock star but when that baby comes, life will be so sweet you just don't know yet. This baby will be a rock star's rock star.  I am soooo happy for you and everyone in your life who will share this with you. Retreat from the press, keep your counsel and privacy during this special time. Loving' it and so proud of you, Love, C."
            ], 
            "person": [
                "Alexis Ohanian", 
                "Martina Navratilova", 
                "Serena Williams"
            ], 
            "theme": [
                "Serena Williams", 
                "PDT Williams"
            ], 
            "primarysection": "Sports", 
            "associatedbinaryurl": [
                "http://www.washingtonpost.com/blogs/early-lead/files/2017/02/GettyImages-632915024.jpg"
            ], 
            "organization": [
                "Grand Slam"
            ], 
            "blurb": "Williams is taking the year off to attend to her pregnancy, and she lauded her unborn child for teaching her \"the true meaning of serenity and peace.\"", 
            "location": [
                "Germany"
            ]
        }, 
        {
            "contenturl": "http://www.washingtonpost.com/video/national/controversial-confederate-statue-removed-in-new-orleans/2017/04/24/aeb9e534-2957-11e7-9081-f5405f56d3e4_video.html", 
            "comment": [], 
            "contenttype": "Video", 
            "headline": "Controversial Confederate statue removed in New Orleans", 
            "source": "The Washington Post", 
            "theme": [
                "New Orleans City"
            ], 
            "location": [
                "Liberty Place", 
                "New Orleans City"
            ], 
            "associatedbinaryurl": [
                "http://s3.amazonaws.com/posttv-thumbnails-prod/04-25-2017/t_1493083326636_name_Confederate_Statues_New_Orleans_38624_da195_compressed.jpg"
            ], 
            "organization": [
                "Liberty Place"
            ], 
            "blurb": "City workers in New Orleans tore down the Battle of Liberty Place monument April 24. It’s the first of four Confederate symbols due to be dismantled.", 
            "primarysection": "National"
        }, 
        {
            "contenturl": "https://www.washingtonpost.com/580bcb76-2952-11e7-b605-33413c691853_story.html", 
            "body": "Skilled at magic, Edgar Vidaurre of Fairfax County can use sleight of hand to make his beloved pet cockatoo appear. But when Sunny got lost the other day, it took a bit of coaxing by Fairfax County police to get him home. Vidaurre had left the bird in a tree while he played soccer behind the county government center. Then he temporarily forgot him, he said in a police video. Meanwhile, officer Mike Thompson answered a call about a bird, spotted the bright white cockatoo with the yellow crest about 12 feet up, and \"started to talk to him.\" Sunny, whose wings had been clipped after an earlier escapade, climbed down. Thompson suffered a nip or two, but eventually Sunny was transferred to animal authorities, who held him for his owner. In Monday's video, Vidaurre thanked Thompson. Sunny, who reportedly can speak, gave one squawk but otherwise exercised his right to remain silent.", 
            "contenttype": "Article", 
            "source": "The Washington Post", 
            "headline": "Fairfax officer comes to rescue of bird stuck in tree", 
            "comment": [], 
            "person": [
                "Edgar Vidaurre", 
                "Mike Thompson"
            ], 
            "theme": [
                "Edgar Vidaurre Of Fairfax County", 
                "Mike Thompson", 
                "Fairfax County"
            ], 
            "primarysection": "Local", 
            "blurb": "Sunny the pet cockatoo was successfully reunited with his owner.", 
            "location": [
                "Fairfax County"
            ]
        }, 
        {
            "contenturl": "https://www.washingtonpost.com/local/fairfax-officer-comes-to-rescue-of-bird-stuck-in-tree/2017/04/24/580bcb76-2952-11e7-b605-33413c691853_story.html", 
            "body": "This post has been updated. A Fairfax County police officer showed himself recently as meeting the description applied to a person of unusual charm and persuasive powers. Of such persons it is said that they could talk a bird out of a tree. Officer Mike Thompson, did just that a couple of days ago, as he recounted it in a video posted Monday by t he county police department. According to the video, a man identified by police only as Edgar, had left his pet cockatoo to perch in a tree while he played soccer behind the county government center. Then the man temporarily forgot him, he said in the video. Meanwhile, officer Mike Thompson answered a call about a bird, spotted the bright white cockatoo with the yellow crest about 12 feet up, and \"started to talk to him.\" Sunny, whose wings had been clipped after an earlier escapade, climbed down. Thompson suffered a nip or two, but eventually Sunny was transferred to county animal authorities, who held him for his owner. In Monday's video, the pet owner thanked Thompson. Sunny, on the other hand, a bird who reportedly can convey his desires orally, gave one squawk but otherwise exercised his right to remain silent.", 
            "contenttype": "Article", 
            "source": "The Washington Post", 
            "headline": "Fairfax officer comes to rescue of bird stuck in tree", 
            "comment": [
                "Dude shouldn't have kids.", 
                "Poor Sunny!", 
                "Don't forget your animals!\n\nThough Sunny wasn't forthcoming, some people teach their parrots or other talking bird to recite their phone number.", 
                "Thank you Officer!"
            ], 
            "person": [
                "Mike Thompson"
            ], 
            "theme": [
                "Mike Thompson", 
                "Officer Mike Thompson", 
                "County Police Department"
            ], 
            "primarysection": "Local", 
            "blurb": "Sunny the pet cockatoo was successfully reunited with his owner.", 
            "location": [
                "Fairfax County"
            ]
        }, 
        {
            "contenturl": "https://www.washingtonpost.com/news/sports/wp/2017/04/24/wizards-waste-bradley-beals-big-night-and-the-hawks-earn-a-111-101-win-in-game-4-to-even-series-2-2/", 
            "body": "Beal and John Wall combined for 54 points in the loss, but were unable to overcome a poor night from the Washington bench. Atlanta had seven players score in double figures, and the tied series now returns to Verizon Center for Game 5 on Wednesday. This is a developing story. It will be updated.", 
            "contenttype": "Blog", 
            "source": "The Washington Post", 
            "headline": "Wizards waste Bradley Beal’s big night and the Hawks earn a 111-101 win in Game 4 to even series, 2-2", 
            "comment": [], 
            "person": [
                "John Wall"
            ], 
            "theme": [
                "Verizon Center for", 
                "Verizon Center", 
                "John Wall"
            ], 
            "primarysection": "Sports", 
            "organization": [
                "Verizon Center for"
            ], 
            "blurb": "Beal and John Wall combined for 54 points in the loss, but were unable to overcome a poor night from the Washington bench. Atlanta had seven players score in double figures, and the tied series now returns to Verizon Center for Game 5 on Wednesday. This is a developing story. It will be updated.  ", 
            "location": [
                "Washington"
            ]
        }, 
        {
            "contenturl": "https://www.washingtonpost.com/news/powerpost/wp/2017/04/24/trumps-first-100-days-why-trump-wants-to-release-his-tax-plan-this-week/", 
            "body": "Here's where things stand heading into Day 96 of the Trump administration: President Trump is getting closer to his 100th day in office, and without a major legislative achievement, he has his eye on this week's tax and tariff announcements as a way to show progress for his agenda. Trump plans to unveil principles for restructuring the tax code Wednesday, laying down a marker ahead of what is expected to be a long and complex process in Congress. On Monday, the Trump administration also said it plans to impose a 20 percent tariff on Canadian softwood lumber, in what could become the biggest trade dispute between the United States and Canada in more than a decade. Trump speaks to ambassadors at the White House on Monday. (Jabin Botsford/The Washington Post) The U.S. corporate tax rate is another target for the administration. White House officials are indicating that Trump plans to stick by his campaign pledge to cut that rate from 35 percent to 15 percent, a larger cut than House Republicans had proposed. This will be part of Trump's announcement Wednesday. TRUMP'S OTHER METRIC FOR SUCCESS? TV RATINGS. As the 100-day mark approaches, television ratings are also on the president's mind. Trump was a reality-show host and cable-news commentator long before he was a political candidate, and the way television has influenced his thinking and approach to public office is becoming more apparent the longer he is in office. President Trump's relationship with television goes back decades - and now that he's in the White House, his TV-watching habit is still going strong. (Peter Stevenson/The Washington Post) Take this comment from a working lunch at the White House last month. One attendee, wondering about job security in Trump's administration, asked whether White House press secretary Sean Spicer might be the first top aide to depart. \"I'm not firing Sean Spicer,\" Trump said in response, our colleagues reported. \"That guy gets great ratings. Everyone tunes in.\" Not all of Trump's comments about ratings are so benign. The president is receiving criticism for telling the Associated Press, in an interview published Sunday, that his presence on CBS's \"Face the Nation\" pushed its viewership to its highest level \"since the World Trade Center came down.\" \"It's the highest for 'Face the Nation,' or as I call it, 'Deface the Nation,'\" Trump said. \"It's the highest for 'Deface the Nation' since the World Trade Center. ... It's a tremendous advantage.\" THE LATEST ON THE SHUTDOWN WATCH Congress is back in town this week with one major task: avoiding a government shutdown late Friday, when current funds run out. Trump might or might not make this more difficult. Since the weekend, Trump has hammered away on Twitter at the need for the next funding package to include money for a wall along the southern U.S. border. Democrats, whose votes are necessary to approve a funding bill in the Senate, have said they will not agree to this. ....the wall is not built, which it will be, the drug situation will NEVER be fixed the way it should be!#BuildTheWall - Donald J. Trump (@realDonaldTrump) April 24, 2017 The stalemate seemed to hold for much of Monday, at least publicly, with Trump continuing to tweet about the need to fund the wall. But White House officials signaled at the same time that the president might be open to a bill that would fund border security measures but not an actual wall. Trump has also opened the door to getting the wall funding this fall instead of this week, a White House official confirmed to our colleague. Negotiations are continuing as the clock ticks down toward Friday night. STATE DEPARTMENT WEBSITE FEATURES MAR-A-LAGO Trump's private club in Palm Beach has come to symbolize the range of potential conflicts of interest he faces at the White House. That's because Mar-a-Lago isn't just a private estate where Trump spends his weekends. It's a part of his business empire, a place where private individuals pay hefty membership fees for the privilege of rubbing shoulders with the president, administration officials and foreign dignitaries. Depending on the night, members might even watch Trump formulate a national-security response in real time, as took place in mid-February. President Trump's Mar-a-Lago estate in Palm Beach, Fla. (Yuri Gripas/Reuters) This already makes Trump critics uncomfortable. So it's no wonder there was an outcry Monday as watchdog groups circulated a federal website that recently featured Mar-a-Lago in a travelogue-style blog piece. The website, which is affiliated with the State Department, promotes travel to the United States. Its choice to feature Mar-a-Lago raises the question: Is the federal government improperly promoting Trump's businesses? The website took down the post late Monday and replaced it with a message that sought to address concerns. \"The intention of the article was to inform the public about where the President has been hosting world leaders. We regret any misperception,\" the message stated. Follow the author: @eliseviebeck.", 
            "contenttype": "Blog", 
            "source": "The Washington Post", 
            "headline": "Trump’s first 100 days: Why Trump wants to release his tax plan this week", 
            "comment": [
                "Trump’s first 100 days: Why Trump wants to release his tax plan this week . . .\nHell, why not. Maybe something might work, what do you have to lose, loser!!!", 
                "Never has it been more clear what Trump's presidency is about: ratings!  The Spicer comment is enlightening.   It brings to mind the Jesse Ventura and Hulk Hogan world of wrestling.   It's show business plain and simple!  It's theater and theater is illusion!    One can only judge the success or failure of the First 100 Days \"Trump goes to Washington\" by the measures of theater and show business.\n\nIllusion has no need of truth.  That is to say, the theatrical production that Trump and his company are presenting to the world need only be judged by the amount of tension created among the audience and whether it holds their attention.    Like a soap opera, the tension never need be resolved just continued.   The disregard for truth must be viewed as poetic license. \n\nThe well-being of America is secondary and incidental to the entertainment we spectators are witnessing.   \n\nDefining moment for the  First Hundred Days?   Donald Trump's Armada going the wrong way kept the whole world on the edge of its seats for several days wondering if we would be in WWIII by morning.  Korea Kim must have nearly shat his drawers!   No question.  Has to get \"*****\" .    Hang on folks, there is no intermission.", 
                "For some reason i misread that as trump will release his taxes this week", 
                "Me, too.  Must be the hour.  I almost opened my special-occasion wine.", 
                "$200 drones flown by teenagers can move more than enough meth over a $40 billion dollar fence.", 
                "20% tariff on Canadian lumber? Because that will bring back jobs to the great plains? All those coal miners can become lumberjacks? Or is this to pay for a Northern wall?", 
                "Lowers taxes, major cuts to social domestic programs.. OUCH, OUCH, OUCH!!!!", 
                "Sale talks still work well in USA, what can you say?\nPray the Congress &amp; judiciary system will do their jobs.", 
                "Desperation is never pretty.\n\n.....and, the know-nothing parked in the WH is grasping at straws."
            ], 
            "person": [
                "Sean Spicer"
            ], 
            "theme": [
                "Donald J. Trump April", 
                "STATE DEPARTMENT WEBSITE FEATURES MAR-A-LAGO Trump", 
                "White House", 
                "President Trump"
            ], 
            "primarysection": "Powerpost", 
            "associatedbinaryurl": [
                "http://img.washingtonpost.com/rf/image_960w/2010-2019/WashingtonPost/2017/04/25/National-Politics/Images/Botsford170424Trump14388.JPG"
            ], 
            "organization": [
                "Associated Press", 
                "State Department", 
                "White House"
            ], 
            "blurb": "Also: An eye on TV ratings and federal shutdown watch.", 
            "location": [
                "Palm Beach", 
                "United States"
            ]
        }, 
        {
            "contenturl": "https://www.washingtonpost.com/sports/wizards-fall-apart-in-fourth-quarter-as-hawks-even-series-in-game-4/2017/04/24/6a62f8a2-292b-11e7-a616-d7c8a68c1a66_story.html", 
            "body": "ATLANTA - While three members of the Atlanta Hawks enjoyed the postgame spotlight, the Washington Wizards' two biggest stars waited. Late Monday night, John Wall and Bradley Beal stood in the back of the Hawks' practice facility, a black curtain separating the silence on their end from the mirth passed along the podium among Dwight Howard, Jose Calderon and Kent Bazemore. Wall and Beal had to yield the floor to the victors, but earlier the Wizards had surrendered even more - losing control of this first-round series after Atlanta won, 111-101. The series is tied at two games apiece with a must-win Game 5 - as one Wizards player described it - looming Wednesday night at Verizon Center. \"We're 2-2 right now. We move on. We have home court right now,\" Beal said, standing on one of the few things the Wizards still can have confidence in. \"So we're going to protect our house and come back here more focused for Game 6.\" Coming from Beal's lips, the plan seems simple. Through two games on the road, however, the Wizards made the series much more difficult as their defense regressed and frustrations with fouls heightened. [Jerry Brewer: Struggles were inevitable for Wizards, and they arrived in Atlanta.] On Monday, Atlanta scored 44 points in the paint while Howard (16 points and 15 rebounds) awakened from his series slumber by slamming home lobs. Even when Howard went quiet in the fourth quarter, the Wizards' fragile defense still couldn't contain the Hawks. The teams entered the final quarter tied at 77, but Washington bowed to the whims of Atlanta's offense and allowed 34 points. While Beal (11 for 23 for 32 points) and Wall (22 points and 10 assists) finally had a strong game together, the Hawks countered that with all five of their starters scoring in double figures. Even bench players Bazemore and Calderon combined for 26 points and 12 assists. Markieff Morris, who called Hawks all-star Paul Millsap a \"crybaby,\" entered the game as the villain at Philips Arena. Morris did not back up his talk, however, partly because he was limited by foul trouble. Morris finished with nine points (3-for-10 shooting), three rebounds and five fouls. \"Since that [first] game, he's been in some foul trouble,\" Coach Scott Brooks said. \"The stats say he hasn't shot the ball well, but he hasn't had a rhythm. He's been in foul trouble ever since that Game 1. But that's part of it. You've got to play through it. He picked up two, and he picked up four real quick. And he got the fifth one. He'll bounce back. I've got confidence in him, how he plays, how he plays for us. I expect him to have a better game in a couple of nights.\" [Best and worst from Wizards' Game 4 loss to Hawks] The Wizards could have scripted the start. In the opening quarter, they shot 55.7 percent from the field, and even better, their defense was given a break when Dennis Schroder headed to the Hawks' bench. Wall aggressively drew three fouls on Schroder, and in doing so he eliminated the Hawks' best playmaker. For the rest of the first half, the Wizards did not have to worry about chasing the streak of blond down the lane (Schroder rocks a funky flaxen dye job in his hair) or concern themselves by over-helping against his replacement, the 35-year-old Calderon. Finally, foul trouble favored the Wizards, and they started the quarter with a clear advantage - not only the 35-28 score but also with Schroder glued to the bench - but mishandled the opportunity. At the 10:22 mark, Bojan Bogdanovic wisely posted up the smaller Calderon and scored while being fouled. After the three-point play, though, the Wizards' offense went dark for nearly five minutes. Instead of attacking the slow-footed Calderon, who played with three fouls, the Wizards settled for more jumpers - missing 15 of 20 shots, with only three of those attempts coming inside the paint. Even more troubling, Washington grew exceptionally sloppy with the ball and committed eight turnovers. Conversely, the Hawks worked the inside game. Rookie Taurean Prince, who made 4 of 4 shots and scored nine points in the first half, demonstrated how aggression is rewarded in the playoffs. With 3:10 remaining in the half, Prince made a quick first step to the rim, and, though Morris gave little contact in resistance, the first-year player was given the foul as he hit the layup. \"We made a lot of defensive mistakes,\" Brooks summed up. \"We took a lot of tough shots.\" Early in the fourth quarter, the Hawks still operated with authority as they opened an 89-81 lead and forced several Wizards starters back onto the floor. Though the wholesale changes sparked Washington - Morris hit a shot clock-beating jumper, Bogdanovic spaced out for a three, and Wall raced inside for a layup for seven straight points - Atlanta stopped the run and buried the Wizards with one of its own. Later, Wall and Beal waited behind the curtain like understudies. The voices of the three featured Hawks amplified through the facility - with Howard trying to crack jokes and Calderon answering questions in Spanish. The duo waited their turn, as well as a chance to redeem Washington in this series.", 
            "contenttype": "Article", 
            "source": "The Washington Post", 
            "headline": "Wizards fall apart in fourth quarter as Hawks even series in Game 4", 
            "comment": [
                "Time to bench Morris?  I know that when he gets in foul trouble, I am happy -- it means that Smith or Oubre will replace him.  His lazy defense is hard to overcome.", 
                "Even after tie at the 3rd quarter, I had no confidence if Wiz can sustain the momentum till the end.  Please Wiz, stop talking, not just Morris but everybody, just play hard &amp; smart with tough defense.  That's all I am asking as a long time suffering fan.", 
                "Ugly game. Never had a good feeling. Might be time to bench Morris. He's just a gnat to Milsap as Brewer said yesterday.  Somebody needs to step up. Really need Mahinmi in this series."
            ], 
            "person": [
                "Coach Scott Brooks", 
                "Dennis Schroder", 
                "Dwight Howard", 
                "John Wall", 
                "Jose Calderon", 
                "Kent Bazemore", 
                "Paul Millsap"
            ], 
            "theme": [
                "Washington Wizards"
            ], 
            "primarysection": "Sports", 
            "associatedbinaryurl": [
                "https://img.washingtonpost.com/rw/2010-2019/WashingtonPost/2017/04/25/Sports/Images/JN1_1884a.jpg"
            ], 
            "organization": [
                "Philips Arena", 
                "Rookie Taurean Prince", 
                "Verizon Center", 
                "Washington Wizards"
            ], 
            "blurb": "Bench, defensive problems plague Washington late in Atlanta’s 111-101 victory", 
            "location": [
                "Atlanta", 
                "Schroder", 
                "Washington"
            ]
        }, 
        {
            "contenturl": "https://www.washingtonpost.com/sports/trio-of-homers-powers-orioles-to-soggy-win-over-tampa/2017/04/24/7efd3a36-292e-11e7-a616-d7c8a68c1a66_story.html", 
            "body": "BALTIMORE - The Orioles found themselves on the wrong end of another early-inning meltdown by Ubaldo Jimenez on Monday night, but everything turned out all right again. Somehow, Jimenez has managed to remain undefeated through four starts, even though he has only pitched well in one of them. Of course, he's not exactly 4-0, but the Orioles have still won all of his starts after pounding three home runs off Tampa Bay ace Chris Archer on the way to a soggy 6-3 victory over the Rays before an announced 11,142 at Camden Yards. The Rays jumped out to an instant lead when leadoff man Corey Dickerson homered. After the Orioles tied the game in the third, Tampa Bay increased its lead to two when Jimenez spun out of control in the fourth and bunched four walks around a two-run double by outfielder Shane Peterson. To that point, Archer was very much in control. He allowed just one run on two hits through five innings and got the first two outs in the sixth before the Orioles started to flex their muscle. Hyun Soo Kim drove a towering fly ball to center for his first home run. Jonathan Schoop followed moments later with his fifth of the year to tie the game. The decisive swing came from Adam Jones, who had three hits in the game and delivered his 1,500th career hit in his previous at-bat. He scalded a two-run shot into the left-field bleachers in the seventh inning - his fourth homer of the season. - Baltimore Sun", 
            "contenttype": "Article", 
            "source": "The Washington Post", 
            "headline": "Trio of homers powers Orioles to soggy win over Tampa", 
            "comment": [], 
            "person": [
                "Adam Jones", 
                "Chris Archer", 
                "Corey Dickerson", 
                "Jonathan Schoop", 
                "Shane Peterson"
            ], 
            "theme": [
                "Tampa Bay", 
                "Ubaldo Jimenez"
            ], 
            "primarysection": "Sports", 
            "associatedbinaryurl": [
                "https://img.washingtonpost.com/rw/2010-2019/WashingtonPost/2017/04/25/Production/Daily/Sports/Images/Rays_Orioles_Baseball_64419-efa37.jpg"
            ], 
            "organization": [
                "Orioles"
            ], 
            "blurb": "Hyun Soo Kim, Adam Jones and Jonathan Schoop all go deep to lead Baltimore past the Rays.", 
            "location": [
                "Baltimore Sun", 
                "Camden Yards", 
                "Tampa Bay"
            ]
        }, 
        {
            "contenturl": "https://www.washingtonpost.com/news/early-lead/wp/2017/04/24/jabrill-pepperss-nfl-draft-stock-just-took-a-double-shot-of-bad-news/", 
            "body": "Jabrill Peppers's 2016 season for Michigan earned him numerous awards and unanimous all-American status. (Charlie Neibergall/Associated Press) Jabrill Peppers is expected to be a first-round pick in the NFL draft, which starts Thursday. At least, Peppers was thought to go that early, but Monday brought a double-shot of bad news that may result in some NFL teams passing on the Michigan star. First, ESPN's Adam Schefter reported that Peppers was flagged for a diluted urine sample, after he took his drug test during the NFL combine. That is tantamount to a failed drug test, and it could have some teams questioning his maturity and decision-making, if not his off-field proclivities. [The NFL draft's fastest rising QB chose football and its risks over baseball and a guaranteed $1.6 million] \"Peppers went to the combine. He was sick after flying there from San Diego. He has a history of cramping,\" a spokesman for Creative Artists Agency, which represents Peppers, told Schefter. \"Peppers was being pumped with fluids, drinking eight to 10 bottles of water before he went to bed, because he was the first guy to work out two days for the [linebackers] and [defensive backs]. He had to go through that first day, come back on second day, and that was the fear. \"So Peppers was pounding water and under the weather. He never failed a drug test in his life, nor tested positive before for any substance.\" Text from front office executive on Jabrill Peppers and diluted sample: \"Does he think we're stupid?\" - mike freeman (@mikefreemanNFL) April 24, 2017 Schefter, who probably shouldn't expect a Christmas card from Peppers, subsequently reported (via Pro Football Talk) that some NFL teams were already dinging the versatile athlete for sitting out the Wolverines' bowl game, a 33-32 loss to Florida State in December's Orange Bowl. Schefter had reported at the time that Peppers tried to practice with a hamstring strain but ultimately decided, shortly before the game began, that the injury was too severe. Other college standouts, such as Stanford running back Christian McCaffrey and LSU's Leonard Fournette, also skipped their teams' respective bowl games, but they had announced their intentions to do so well ahead of time. According to Schefter, some NFL executives don't like that Peppers's decision came at the last moment, and they have downgraded him on their draft boards. Add it up, and Peppers could be waiting to hear his name called much longer than he thought he would. Teams, always on the lookout for what they perceive to be character flaws, will have to weigh Monday's reports against his considerable talent. A New Jersey native, Peppers went to Michigan out of admiration for former Wolverines star Charles Woodson, and he nearly equaled the latter's achievement of becoming the only primarily defensive player to win the Heisman Trophy. A linebacker and safety for the Wolverines, plus an occasional running back, Peppers also excelled as a kick returner, and he promises to provide unusual playmaking ability as a professional. Not Breaking News @JabrillPeppers HAD a diluted sample, But Did Not test POSITIVE for anythingBig difference - Charles Woodson (@cwoodson24) April 24, 2017 [The most likely draft picks to be traded and teams who could make a deal] Despite the diluted sample, ESPN draft analyst Mel Kiper said Monday (via MLive.com), \"I'd be surprised if he got out of the first round.\" Alabama linebacker Reuben Foster, who was sent home from the combine after getting into a physical altercation with a medical staffer, failed his drug test in the same manner, and he is still widely expected to be a first-round pick. \"You have to look at it, and every team is going to evaluate it,\" Kiper said of Peppers. \"You hear what his side says about what the reason was that happened - you've heard the same thing from Foster's camp. You've got to look at it and evaluate it, and I think they made the point he's never had any issues before.\" Kiper said that teams picking in the top 10 may well have eliminated Peppers from consideration for those selections, but he added, \"I'm sure there's some teams in the late first round that didn't think they'd see him there that may see him still on the board at that point.\" Joe Thomas, an all-pro offensive tackle for the Browns who played college ball at Wisconsin, posted a number of tweets Monday arguing that players who test positive for a diluted sample should be tested again until they provide a sample that can properly be tested for evidence of drug use. \"Tester should be able to see it's dilute right when he receives sample and can then request more samples until it's not dilute,\" Thomas said on Twitter. \"No player should ever have a 'failed test' for a dilute sample. Especially at the combine where players frequently chug water to gain weight,\" Thomas continued. He noted that players could be \"chugging water to hydrate for a day of grueling physical testing. Lack of hydration leads to a significant decrease in performance.\" Foster reportedly told teams that his diluted sample was the result of a frantic attempt to counteract dehydration before the combine after he came down with what he thought was food poisoning. Peppers and Foster are set to begin their NFL careers in the league's drug program; they will be discharged after 180 days if they cooperate with guidelines and have no further violations in that time.", 
            "contenttype": "Blog", 
            "source": "The Washington Post", 
            "headline": "Jabrill Peppers’s NFL draft stock just took a double-shot of bad news", 
            "comment": [
                "I'd bet a million to one if he would test positive it would be for weed. To teams thats a serious character flaw, but it's ok to pump your players full of opioids and anti-inflammatory drugs that can cause long term medical problems and addiction. I think the one with the serious character flaws work in the NFL already.", 
                "“Peppers was being pumped with fluids, drinking eight to 10 bottles of water before he went to bed\"\n\nHe would get sick drinking that much in a short time, and he would certainly not sleep, except maybe in a puddle of urine.", 
                "Jeez, we wouldn't want to see any immature drug abusers playing professional sports, would we?", 
                "I'm so tired of dumb, pre-draft talk as it is. Now I gotta listen to Des try and talk himself through a poorly thought out sports article? I can't stand the crap you guys fill my news feed with anyways. At least let me have my NFL articles without your particular brand of alternate reality"
            ], 
            "person": [
                "Adam Schefter", 
                "Charles Woodson", 
                "Christian McCaffrey", 
                "Joe Thomas", 
                "Leonard Fournette", 
                "Mel Kiper", 
                "Reuben Foster"
            ], 
            "theme": [
                "Jabrill Peppers", 
                "Florida State", 
                "Charles Woodson", 
                "Joe Thomas"
            ], 
            "primarysection": "Sports", 
            "associatedbinaryurl": [
                "http://img.washingtonpost.com/rf/image_960w/2010-2019/Wires/Images/2017-04-24/AP/NFL_Draft_Prospects_Thumbnails_Defense_46950-3564e.jpg"
            ], 
            "organization": [
                "Creative Artists Agency", 
                "Florida State"
            ], 
            "blurb": "The versatile athlete from Michigan may tumble out of the first round, following a report that he was flagged for a diluted sample during the NFL's combine.", 
            "location": [
                "Florida State", 
                "Heisman Trophy", 
                "New Jersey", 
                "San Diego"
            ]
        }, 
        {
            "contenturl": "https://www.washingtonpost.com/7456b8da-292b-11e7-a616-d7c8a68c1a66_story.html", 
            "body": "ATLANTA - For the past two months, the Washington Wizards have been a trendy pick to do well in the NBA playoffs. Since that epic overtime tussle with Cleveland in early February, dreams of a Wizards-Cavaliers Eastern Conference finals have danced in heads in the District and far beyond. Never mind that the Wizards haven't made such a run in nearly 40 years. This team is fun and rising fast and has had some previous playoff success, and the NBA can be so mundane because the best teams die slowly, so why not promote an upstart? There's only one problem with that level of hype and hope: The Wizards still don't really know how to handle prosperity. And so, if you saw a clear path for the Wizards in the East, you must have a powerful imagination. This may indeed be Washington's year to go far, but struggle was inevitable. And struggle arrived Monday night at Philips Arena. You know that first-round series that the Wizards threatened to end quickly after winning the first two games over Atlanta at Verizon Center? Well, they just went on the road and allowed the Hawks to even the series. In Game 4, Atlanta tied it with a 111-101 victory at Philips Arena despite being required to do the improbable. To keep the Wizards from taking a commanding three games to one lead, the Hawks needed 26 points and 12 assists from the reserve duo of 35-year-old Jose Calderon and Kent Bazemore, who is known more for the $70 million contract he can't live up to these days. If you had told any sane person before the game that Calderon and Bazemore would need that kind of production to keep the Wizards from winning, the logical reaction would have been to start collecting restaurant recommendations in Chicago and Boston. Because the Wizards were about to go home and end the series, for sure. Instead, Bazemore contributed 16 points and seven assists, and Calderon had 10 points and five dimes. The Wizards were left frustrated by shaky defense and the inability to capitalize on a second quarter in which they should have pushed Atlanta to the brink. And now this will be a long series. I wouldn't say the Wizards are in trouble. Neither team has lost at home, and Washington still has home-court advantage. But this is now a best-of-three fight instead of an easy road. The Wizards lost control of this game in the second quarter, at a time when it seemed they had a chance to take further advantage of the Hawks. Atlanta point guard Dennis Schroder, who averaged 25 points in the first three games of the series, committed three fouls trying to defend John Wall and had to sit the final 15 minutes of the first half. Calderon, his backup, also had three fouls early in the second quarter, but he remained in the game. Washington should have seized the moment and extended the lead. The Hawks shot just 9 of 24 (37.5 percent) in the first quarter, and now they had a tricky situation at point guard. They stuck with Calderon over rookie Malcolm Delaney, which meant the 35-year-old had to manage an offense that is more dangerous with Schroder and play defense without fouling. And Calderon is a poor defender even when he can play aggressive. But Calderon played well, and the Wizards fell apart when they were positioned to prosper. Extend the lead? The Wizards lost it quickly as the bench performed poorly, especially on the defensive end. And when the starters returned, the Wizards allowed Calderon to get away with guarding Bradley Beal and didn't fully exploit the mismatch. Calderon, who had eight points and four assists in the first half, actually controlled the action despite the three fouls. Dwight Howard, who has been an offensive non-factor all series, started catching alley-oops, and he posted a double-double (14 points, 11 rebounds) by halftime. The Wizards continued to give up easy baskets to Atlanta rookie forward Taurean Prince, and Bazemore made open shots and helped Calderon with playmaking duties, registering five first-half assists. Atlanta outscored Washington 31-15 in the second quarter. That early advantage turned into a 59-50 halftime deficit. The Wizards went into halftime needing Markieff Morris, who was again in foul trouble and out of rhythm, to find his game. They needed their frontcourt to compete better against the Hawks, who owned the boards and nearly doubled the Wizards' points-in-the-paint output. For the third straight game, Morris was frustrated. A fan at Philips Arena held up a sign depicting Morris with tears falling down his cheeks and the words \"CRYBABY\" written at the top, a reference to Morris's accusation after Game 3 that Paul Millsap is a whiner. Even though Morris played just 10 minutes in the first half, the Wizards contained Millsap. In the first three games, Millsap was averaging 25 points and 8.7 rebounds. He was shooting 54.8 percent from the field and averaging 11.7 free throws. Before the game, I asked Wizards coach Scott Brooks what he wanted to take away from the Hawks star. \"First, I know why I voted for him as an all-star because this is what he is,\" Brooks said. \"He's a terrific basketball player. He just does his work. Anything we can eliminate, it's the free throws. Saying that, we've got to do a better job of not putting him on the line. He averages [5.9] through the year; he's averaging 11 through these three games. That's a big increase, double-digit amount of attempts. \"We have to do a better job at that, but he's good. He can score in so many areas of the floor. He has a great handle. You saw a couple times he's brought the ball up the court and made great decisions, whether it's for himself attacking the rim or finding an open shooter in the corner. That's what he does. Like I said, he's one of the better players in this league at that position.\" Millsap made only 2 of 7 shots early, but the Wizards still trailed. In every phase of the game, they were struggling and hindering their chances to take a 3-1 series lead. Entering the second quarter, the scenario was ideal for a road victory, but the Wizards were determined to take a more difficult route, as usual. For more by Jerry Brewer, visit washingtonpost.com/brewer.", 
            "contenttype": "Article", 
            "source": "The Washington Post", 
            "headline": "Struggles were inevitable for the Wizards, and they arrived in Atlanta. And then some.", 
            "comment": [], 
            "person": [
                "Dennis Schroder", 
                "Dwight Howard", 
                "Jerry Brewer", 
                "John Wall", 
                "Kent Bazemore", 
                "Malcolm Delaney", 
                "Paul Millsap", 
                "Scott Brooks"
            ], 
            "theme": [
                "Washington Wizards"
            ], 
            "primarysection": "Sports", 
            "associatedbinaryurl": [
                "https://img.washingtonpost.com/rw/2010-2019/WashingtonPost/2017/04/25/Sports/Images/JN1_1915.jpg"
            ], 
            "organization": [
                "Eastern Conference", 
                "Markieff Morris", 
                "Philips Arena", 
                "Verizon Center", 
                "Washington Wizards"
            ], 
            "blurb": "Washington’s 111-101 loss in Game 4 to the Hawks makes it clear they don’t know how to handle prosperity.", 
            "location": [
                "Atlanta", 
                "Boston", 
                "Calderon", 
                "Chicago", 
                "Cleveland", 
                "Washington"
            ]
        }, 
        {
            "contenturl": "https://www.washingtonpost.com/sports/struggles-were-inevitable-for-the-wizards-and-they-arrived-in-atlanta-and-then-some/2017/04/24/7456b8da-292b-11e7-a616-d7c8a68c1a66_story.html", 
            "body": "ATLANTA - For the past two months, the Washington Wizards have been a trendy pick to do well in these NBA playoffs. Since that epic overtime tussle with Cleveland in early February, dreams of a Wizards-Cavaliers Eastern Conference finals have danced in heads in the District and far beyond. Never mind that the Wizards haven't made such a run in nearly 40 years. This team is fun and rising fast and has had some previous playoff success, and the NBA postseason can be mundane because the best teams die slowly, so why not promote an upstart? There's only one problem with that level of hype and hope: The Wizards still don't really know how to handle prosperity. And so, if you saw an easy path for them in the East, you must have a powerful imagination. This may indeed be Washington's year to go far, but struggle was inevitable. And struggle arrived Monday night at Philips Arena. You know that first-round series that the Wizards threatened to end quickly after winning the first two games over Atlanta at Verizon Center? Well, they just went on the road and deflated their cushion. The series is tied at two games apiece now, after the Hawks claimed a 111-101 victory despite being required to resurrect a fading point guard and turn an overpaid role player into a game-changing playmaker. [Wizards fall apart in fourth quarter of Game 4 loss to Hawks] To keep the Wizards from taking a commanding three games to one lead, the Hawks needed 26 points and 12 assists from the reserve duo of 35-year-old Jose Calderon and Kent Bazemore, a really nice kid who is known more for the $70 million contract he can't live up to these days. If you had told any sane person that Calderon and Bazemore would need that kind of production to keep the Wizards from winning, the logical reaction would have been to start collecting restaurant recommendations in Chicago and Boston. Because the Wizards were about to go home and end the series, for sure. Instead, Bazemore contributed 16 points and seven assists, transforming into Dwight Howard's designated lob thrower. And Calderon finished with 10 points and five dimes, and the Hawks outscored the Wizards by 29 points in the 20 minutes he played. When Bazemore and Calderon took the stage with Howard (16 points, 15 rebounds) for a postgame interview, it emphasized both a surprise that makes the postseason delightful and a reason for the Wizards to lament a blown opportunity. \"I always think I'm going to be on the podium,\" Calderon said, smiling. \"I think I'm onto something,\" Bazemore said of his alley-oop passing skills. And now this will be a long series. I wouldn't say the Wizards are in trouble. Neither team has lost at home, and Washington still has home-court advantage. But this is now a best-of-three fight instead of an easy road. The Wizards were left frustrated by shaky defense and the inability to capitalize on a second quarter in which they should have pushed Atlanta to the brink. That's where the Wizards lost their handle on this game, at a time when it seemed they had a chance to take further advantage of the Hawks. Atlanta point guard Dennis Schroder, who averaged 25 points in the first three games of the series, committed three fouls trying to defend John Wall and had to sit the final 15 minutes of the first half. Calderon, his backup, also had three fouls early in the second quarter, but he remained in the game. [Best and worst from Wizards' Game 4 loss to Hawks] Washington should have seized the moment and extended the lead. Calderon is a poor defender even when he can be aggressive. But Calderon played well, and the Wizards fell apart when they were positioned to prosper. Extend the lead? The Wizards lost it quickly as the bench performed poorly, especially on the defensive end. And when the starters returned, the Wizards allowed Calderon to get away with guarding Bradley Beal and didn't fully exploit the mismatch. Calderon actually controlled the action despite the three fouls. Howard, who has been an offensive non-factor all series, posted a double-double by halftime. Atlanta outscored Washington 31-15 in the second quarter. A solid Wizards first quarter had turned into a 59-50 halftime deficit. \"We made a lot of defensive mistakes,\" Wizards Coach Scott Brooks said of the second quarter. \"We took a lot of tough shots.\" For the third straight game, Wizards power forward Markieff Morris was frustrated and in foul trouble. A fan held up a sign depicting Morris with tears falling down his cheeks and the words \"CRYBABY\" written at the top, a reference to Morris's accusation after Game 3 that Paul Millsap is a whiner. Morris played just 24 minutes and scored nine points on 3-for-10 shooting. \"The stats say he hasn't shot the ball well, but he hasn't had a rhythm,\" Brooks said. \"He's been in foul trouble ever since that Game 1. But that's part of it. You've got to play through it. He picked up two [fouls], and he picked up four real quick. And he got the fifth one. He'll bounce back. I've got confidence in him, how he plays, how he plays for us. I expect him to have a better game in a couple of nights.\" Even though Morris played just 10 minutes in the first half, the Wizards contained Millsap. He finished with 19 points, nine rebounds and seven assists, but Millsap made only 2 of 7 shots early. The Wizards still trailed. In every phase of the game, they were struggling and hindering their chances to take a 3-1 series lead. The Wizards would recover and play a good third quarter, but then they allowed Atlanta to score 34 points in the final period and tie the series. They lost the game in those even quarters, by failing to take command in the second and by failing to close at the end. \"It was just too up and down,\" said Beal, who led all scorers with 32 points. \"You spend all your time and energy trying to play catch-up, and then you can't finish in the fourth quarter.\" Said Brooks: \"Basically, what I see is two very good basketball teams, evenly matched, fighting for their playoff lives. We're the fourth and fifth seed. The series is tied. It's basically the first to two now.\" The game presented a scenario ideal for a road victory, but the Wizards were determined to take a more difficult route, as usual. For more by Jerry Brewer, visit washingtonpost.com/brewer.", 
            "contenttype": "Article", 
            "source": "The Washington Post", 
            "headline": "Struggles were inevitable for the Wizards, and they arrived in Atlanta. And then some.", 
            "comment": [
                "This is an immature team with immature players who do immature things. They are being paid far too much for that. Perhaps few of they, except maybe Jason Smith, understand the meaning of the word \"professional.\"  Randy Wittman tried to coach this team of children by scolding them. Brooks by being big brother.  It all comes back to the quality of player that the GM selects. So far not so good.", 
                "Time to bench Morris?\nHe seems to be a liability at both ends recently.\nI confess to having no patience.\nBut, every time Morris sits down I get more optimistic. \nHate to blame one guy, but his mouth has run constantly, but he has had three dreadful games that more than offset his one good one."
            ], 
            "person": [
                "Dennis Schroder", 
                "Dwight Howard", 
                "Jerry Brewer", 
                "John Wall", 
                "Kent Bazemore", 
                "Paul Millsap", 
                "Wizards Coach Scott Brooks"
            ], 
            "theme": [
                "Washington Wizards", 
                "Wizards Coach Scott Brooks"
            ], 
            "primarysection": "Sports", 
            "associatedbinaryurl": [
                "https://img.washingtonpost.com/rw/2010-2019/WashingtonPost/2017/04/25/Sports/Images/JN1_1915.jpg"
            ], 
            "organization": [
                "Eastern Conference", 
                "Philips Arena", 
                "Verizon Center", 
                "Washington Wizards"
            ], 
            "blurb": "Washington’s 111-101 loss in Game 4 to the Hawks makes it clear they don’t know how to handle prosperity.", 
            "location": [
                "Atlanta", 
                "Boston", 
                "Chicago", 
                "Cleveland", 
                "Washington"
            ]
        }, 
        {
            "contenturl": "https://www.washingtonpost.com/local/public-safety/three-alarm-fire-breaks-out-at-college-park-construction-site/2017/04/24/fb0634d2-28f9-11e7-be51-b3fc6ff7faee_story.html", 
            "body": "A five-alarm fire swept through an apartment house being built in Prince George's County Monday, causing an estimated $39 milion in damage and saturating part of College Park with so much smoke that a nearby apartment with many seniors was evacuated and the University of Maryland closed. The fire brought a historic response for the county and involved more than 200 firefighters from across the region who began arriving about 10:30 a.m., while other units backfilled for routine calls as more alarms went out, according to acting county fire chief Benjamin M. Barksdale. The cause was under investigation, officials said. The smoke lingered into early evening as the investigation continued in the 4700 block of Berwyn- House Road in College Park, where the fire broke out on the fifth and sixth floors of a nearly completed seven-story building named Fuse 47. Its sprinkler systems were not yet in service, according to fire officials. Two firefighters suffered minor injuries, Barksdale said. Mabel Thomas, 75, was one of about 40 residents of Spellman House, across the street from the fire, who was moved to the community room of a nearby apartment house. She said she had smelled smoke and gone to her window, but saw only gray outside. (Mark Brady) \"It looked like living in a foggy city,\" she said. As smoke detectors inside her building went off, she packed her purse with medication for 76-year-old Emmanuel Greene, a neighbor she takes care of. She and Greene waited for several hours for the all-clear in the community room, where people were gathered at card tables and provided with pizza. \"We're just waiting,\" Greene said. \"That's all we can do.\" Spellman House residents were allowed home about 7 p.m. A partial roof collapse and the building's \"doughnut\" shape - with four facades surrounding a courtyard - made it difficult to get water on the blaze, and fire authorities said they worried about a possible collapse. At one point, a county helicopter sent video to fire commanders to help direct the push to tamp the blaze, Barksdale said. \"There is a lot of wood in this building,\" Barksdale said, adding that empty spaces in the building made it easy for fire to travel. Stacey Carter, 31, who lives in a townhouse across the street from the construction site, also was waiting for the all-clear in the community room. She said she dropped off her 7-year-old son, Jason, at school and returned home as firefighters converged on her street. She stayed inside for about 30 minutes with her 2-year-old daughter, Savannah, until the smoke became intolerable. \"I had to leave because the smoke was so bad,\" she said, worried about returning home because her son and her 62-year-old mother have asthma. University of Maryland President Wallace D. Loh said he was closing the school's campus at 1 p.m., citing \"poor air quality.\" Barksdale said people living or working near the fire \"should be okay\" if they turn off heating and cooling systems to avoid the smoke, which was kept near the ground by clouds. County Fire Department spokesman Mark E. Brady said the blaze led to the largest fire suppression effort in county history. In addition, he said Monday in a blog post, the $39 million loss estimate was among the largest for a fire in the county. Fire personnel would be at the scene through Monday night and into Tuesday morning, Brady said. He said the building was to have about 250 apartments, stores and a parking garage, and was scheduled for for occupancy in July 2017. Meanwhile, a drone flew into the area of the fire, forcing the police helicopter to take evasive action, police said. They said Trevon Miller, 24, of Baltimore Avenue in College Park was arrested and charged with interfering with police and fire response. Dana Hedgpeth and Martin Weil contributed to this report. Read more: Firefighters and cancer: Is a risky job even riskier? 'I'm not fighting you!' Jury awards $100,000 to family of girl in school bus fight Maryland Six Flags roller coaster glitch strands riders; firefighters rescue 24", 
            "contenttype": "Article", 
            "source": "The Washington Post", 
            "headline": "200 firefighters battle five-alarm blaze at College Park construction site", 
            "comment": [
                "So glad I sold my 1947 built, brick construction, childhood home (on the other side of UMD) to my niece. I don't have to worry about that house burning up and she's safe. I don't know who's buying or renting these firetraps.  Hope the wallboard isn't from China and if they're putting down laminate flooring I hope it's not from Lumber Liquidators.", 
                "The drone owner /operator was also violating FAA regs by operating the drone within the DC SRFA (special flight rules area) and the even more restrictive FRZ (flight restricted zone.)  Tsk, tsk....", 
                "From \"The Towering Inferno\" -- last lines.   Maybe we haven't learned much in 40 years:\n\n Chief O'Hallorhan: You know, we were lucky tonight. Body count's less than 200. You know, one of these days, you're gonna kill 10,000 in one of these firetraps, and I'm gonna keep eating smoke and bringing out bodies until somebody asks us... how to build them.\n\nDoug Roberts: [looks up at the smoky building] Okay. I'm asking.\n\nChief O'Hallorhan: You know where to reach me. So long, architect.", 
                "Branchville and CP showed the way, i am sure, way to go guys!", 
                "I watch the construction of multi-story apartment buildings (six floors) in the Reston area near the Wiehle Metro station using all wood construction (except for brick facing) and wonder about the potential for a conflagration similar to that which has occurred in College Park. The only parts of these structures that are of masonry are the elevator shafts and utility shafts. Everything else is wood.", 
                "I absolutely don't get it. Almost all the new commercial and mid-rise construction I see now is wood-framed, even massive buildings like this. Are they expecting fire- suppression systems like sprinklers to save the day? It just seems like a massive cost-cut. Maybe someone in construction can explain to my why they are doing this instead of steel.", 
                "Cost and our local jurisdictions' building codes allow it.\n\nPeople should complain to their local representatives.", 
                "This fire should be a lesson to all architects and construction companies to build structures that are more accessible to fire-fighters in the event of a fire. This will be a mess for the insurance company(ies) to straighten out with the owners.", 
                "I don't suppose we'll be billing the builder for this.", 
                "Do we ever send bills for fire response?", 
                "Isn't that why we pay taxes? I thought the FDO was paid for by tax moniez?", 
                "A lot of credit should be given to the Fire Depts who through mutual aid either helped fight the fire or moved up units to cover stations in PG County who's units were fighting the fire. These included Montgomery County, Anne Arundel County, District of Columbia just to name a few.", 
                "You are absolutely correct, and I should have held my sarcastic comment above until after I properly praised the courage, skill, professionalism, coordination, and leadership of the area's fire departments.  These gals and guys are the very best, and deserve our support.\n\nApologies for leading with sarcasm.", 
                "\"There is a lot of wood in this building\"\n\nYou can't build a commercial building like this - with so much wood. Why do building codes still allow it for residential buildings, especially ones this high ?? Two stories or maybe three perhaps (prefer not). But SEVEN STORIES ??\n\nThat's just insane. Code should be changed to make it safer.", 
                "They should build them to commercial building codes and those don't allow wood studs just metal ones.", 
                "vdev,\n\nSad thing is they didn't use to allow it until recently. Not positive when but since the 1980's developers have argued that new building technologies are safer. \n\nRemember the 1980's flame retardant plywood that allowed builders to eliminate full firewalls between townhouses.  Plywood prematurely rotted and firemen complained. Well they replaced the plywood requirement with sprinklers.", 
                "Sounds like a good excuse for a 25% increase in tuition and 35% increase in unspecified \"fees\" for next semester.", 
                "You do understand the burning apartment complex is privately owned and not associated with University Of Maryland.....?", 
                "Like I said, it's a GOOD EXCUSE for the UMCP leadership to jack up tuition 25% and unspecified fees 35% next semester ... Put another way, nothing is never not a good excuse to do that at UMCP or at any other tentacle of BIG ACADEMIA (BIG IVY??). \n\nIn fact, throw in a few safe spaces from micro-aggressions, and I'd up those numbers to 35% and 45%, respectively.", 
                "I am not associated with UMD or academia.  If you want to hate on those folks, that's your choice.  Quite frankly, I don't like the micro-aggression bs either.  You don't need to SHOUT at me, if you have an axe to grind with academia, fight with them.", 
                "Did I ask you to reply to my comment? Do I need your permission to post a comment here? Just hit the \"IGNORE USER\" button next to my name and we'll both be happy.", 
                "Good excuse for you to vent.", 
                "Don't some building codes require a functioning sprinkler system during at least some later phases of construction? The photo shows a building so far along that I would have thought it had working sprinklers at least in most of the floors, given that it's so big and built primarily of lumber.", 
                "I have no doubt that the fire marshal will be looking into code compliance.", 
                "Sean,\n\nWorking sprinklers are unfortunately one of the later steps since the drywall must be installed first and usually painted before the sprinklers themselves are attached. Once that's complete there are pressure misc. tests.", 
                "Developers are building apartment buildings and condos like this in Virginia too - made from wood, plastic, sawdust and glue, and staples. There's not enough money in the world (I'm looking at you, Bill Gates) to make me live in one of these buildings. They're just plainly too dangerous.\n\nA developer told my husband and me last year that these buildings are safe once all of the wallboard is installed, because the wallboard is fire retardant. That's nice! What happens if a fire penetrates beyond the wallboard?  WHOOSH!  He admitted that he really didn't know for sure what would happen if that occurred. He also admitted that he wouldn't live in one of the houses he was building.  So much for new construction!", 
                "As for DC, anyone who happened to ride Metro past the Rhode Island Avenue station while the nearby appartments were under construction would be able to tell you that, as a friend of mine put it, they appeared to be \"built out of toothpicks.\"", 
                "I think any multi-unit over 6 units should be required to have cement columns and floors. If they have that they can use metal vertical studs. Much more fire resistance and quieter.", 
                "I've driven by that construction site many times and wondered why they built it almost exclusively out of wood. If this building was inhabited, residents could have died. It strikes me as quite a bad idea to approve this kind of cheapo construction. If I were the developer, I'd tear the building down and start over using proper masonry and steel. High density construction built of ticky-tacky is just wrong.", 
                "Wooden structures burn like a box of matches. I'm shocked that Maryland code allows apartment buildings like this to be built.", 
                "Wood-frame apartment buildings are being constructed all over the country. They're significantly cheaper than concrete/steel buildings.", 
                "So I assume your were unaware of this in North Carolina before knowing the specifics of what caused the fire here in Maryland.  I would think a Florida construction prrofessinal would wait until more facts were known before speculating on code here in Maryland . Do you visit other newspapers other than the Washington Post.  If not, it pays to expand your horizons\n\nhttp://www.wsoctv.com/news/local/massive-4-alarm-fire-engulfs-building-under-construction-in-raleigh/503415465", 
                "nbvcxz,\n\nNot sure why the Florida reference but I'm sure it would have met Maryland building codes once complete. Would I be willing to invest or live long term in a massive 6 story wood structure like that, no way.\n\nI hope Maryland revises it's building codes and no, adding more sprinklers will not suffice, buildings this size build of wood should not be permitted.", 
                "Correction to my post, it may not be as much wood construction as mentioned in articles.\n\nhttp://www.dbknews.com/2016/06/09/berwyn-groundbreaking-2020-vision/", 
                "A very costly case study for the UMD Fire Protection Engineering Program, which clearly wasn't consulted on this mid-rise building made almost entirely of wood.", 
                "There's also the Maryland Fire and Rescue Institute right off of Paint Branch, it's maybe 700' away as the bird flies.", 
                "\"Hey guys, we're going next door today for our training!\"", 
                "I wonder what is actually burning in this building.\n So many of these structures use steel studs for framing but i still see wood in a lot of them. But those are usually low rise units not one this high.\nOr is it the roof that won't go out?", 
                "As a Florida construction professional ..... I've looked into Maryland code. Many many of the newer apartment buildings are steel decks with light weight concrete and wood studs and siding.", 
                "Mid-rise buildings like these made out of wood are very much being debated right now.  My understanding is they are permitted due to a quirk in the building codes.  There seems to be some push to ban them.   I recall an almost identical fire in Montgomery county a few years ago. A mid-ride apartment building nearly completion caught fire  (near 270 &amp; Shady Grove Rd).   \n\nIn any case, I suspect construction insurance rates on this type of structure must be going through the roof if  I can recall two fires in recent years (I am sure there are many others).", 
                "Some time ago off Bradley Blvd in Bethesda, I saw a stick-built nursing home being made out of nothing but 2x4s. You could tell it would burn up in an instant, taking everyone in it. How that passed code for the designated us has always been a question to me.", 
                "I wonder how much timber is used in this housing. Shouldn't multi-unit housing be made of masonry to prevent this sort of thing?", 
                "Not that long ago I was coming from a fishing trip with some old guys when we came across a newly constructed building in the city. The six story building looked to have been built entirely of wood stud and ply-board and stucco. I remember one of the old guys saying that place was a \"matchbox\". I wonder if this building was constructed similarly.", 
                "I've seen the new apartment buildings in College Park under construction, and they are all built on wood frames. I was surprised that such large structures would be built with what looked like 2-by-4s, but the code seems to allow it.\n\nThe Maryland Fire and Rescue Institute is around the corner from this burned building. Maybe MFRI should send someone over to take a look.", 
                "Note how this article is written from secondary sources.  Does anybody at the Post actually get into a car and report on a fire from the actual scene?", 
                "You have to be an Amazon Prime member to receive enhanced reporting.", 
                "That would explain the drone that interfered with the police helicopter.", 
                "I'm right across the street, can see the fire, and the WaPo knows more about it than I do. What do you want them to do? Jump the fireline and run into the building reporting on the taste of smoke in the air? It's an empty building on fire, all the news is going to come from officials involved.", 
                "The local TV stations all have reporters on scene, as does WTOP.", 
                "Has anyone ever counted how many times WTOP says the station call letters \"WTOP\" in a 24-hour period? At 5 times a minute, that works out to 7,200 times a day.", 
                "The photo below the hede is credited to \"Ricky Carioti/The Washington Post,\" so they had a photographer at the scene.", 
                "\"APARTMENTS IN COLLEGE PARK THAT IGNITE YOUR LIFESTYLE\"\n\nhttp://fuse47.com/", 
                "Foreshadowing done either very wrong or very right.", 
                "It says \"elevate\" not \"ignite\" now...  Someone made a quick update.", 
                "Now they might want to rename the building something other than \"Fuse.\"", 
                "I suspect the wood frame building is near if not a total loss.\n \nNever move into a wood frame structure that tall (6 stories) even if they have sprinklers. Cheaply built even if they have marble kitchen counters. They are fire traps especially since most use the manufactured lumber, just ask a fireman.", 
                "Updated... interesting"
            ], 
            "person": [
                "Benjamin M. Barksdale", 
                "Mabel Thomas", 
                "Mark E. Brady", 
                "Martin Weil", 
                "Stacey Carter", 
                "Trevon Miller"
            ], 
            "theme": [
                "County Fire Chief", 
                "University of Maryland"
            ], 
            "primarysection": "Cops-Courts", 
            "associatedbinaryurl": [
                "https://img.washingtonpost.com/rw/2010-2019/WashingtonPost/2017/04/24/Local/Images/fire4.jpg"
            ], 
            "organization": [
                "Berwyn- House Road", 
                "Fire Department", 
                "Maryland Six Flags", 
                "University of Maryland"
            ], 
            "blurb": "Smoke closes University of Maryland and leads to evacuation of senior citizens from nearby building.", 
            "location": [
                "Baltimore Avenue", 
                "College Park", 
                "Prince George"
            ]
        }, 
        {
            "contenturl": "https://www.washingtonpost.com/sports/tv-and-radio-listings-april-25/2017/04/24/4817f01e-2966-11e7-a616-d7c8a68c1a66_story.html", 
            "body": "NBA PLAYOFFS FIRST ROUND 8 p.m. Game 5: Oklahoma City at Houston » TNT 9 p.m. Game 5: Memphis at San Antonio » NBA TV 10:30 p.m. Game 5: Utah at Los Angeles Clippers » TNT MLB 7 p.m. Tampa Bay at Baltimore » MASN, WSPZ (570 AM) 8:30 p.m. Washington at Colorado » MASN2, WJFK (106.7 FM) SOCCER 2:45 p.m. English Premier League: Chelsea at Southampton » NBC Sports Network TENNIS 6 a.m. WTA: Porsche Grand Prix, early-round play » beIN Sports COLLEGE BASEBALL 7:30 p.m. Mississippi State vs. Mississippi » SEC Network 8 p.m. LSU at Tulane » CBS Sports Network COLLEGE SOFTBALL 5 p.m. Notre Dame at Northwestern » Big Ten Network BOXING 9 p.m. Premier Champions: Mario Barrios vs. Nelson Lara (junior welterweights) » Fox Sports 1", 
            "contenttype": "Article", 
            "source": "The Washington Post", 
            "headline": "TV and radio listings: April 25", 
            "comment": [], 
            "person": [
                "Mario Barrios", 
                "Nelson Lara"
            ], 
            "theme": [
                "CBS Sports Network COLLEGE SOFTBALL 5", 
                "Tulane » CBS Sports Network COLLEGE SOFTBALL"
            ], 
            "primarysection": "Sports", 
            "associatedbinaryurl": [
                "https://img.washingtonpost.com/rw/2010-2019/WashingtonPost/2016/02/06/Sports/Images/remote.jpg"
            ], 
            "organization": [
                "Big Ten Network BOXING", 
                "CBS Sports Network COLLEGE SOFTBALL 5", 
                "Los Angeles Clippers", 
                "NBC Sports Network TENNIS", 
                "Notre Dame", 
                "Porsche Grand Prix", 
                "SEC Network", 
                "Sports COLLEGE BASEBALL"
            ], 
            "blurb": "Taking a spin around the sports dial", 
            "location": [
                "Mississippi State", 
                "Oklahoma City", 
                "San Antonio", 
                "Tampa Bay"
            ]
        }, 
        {
            "contenturl": "https://www.washingtonpost.com/lifestyle/style/carolyn-hax-inviting-your-mentally-ill-mom-to-your-wedding/2017/04/24/107d3394-26d2-11e7-a1b3-faff0034e2de_story.html", 
            "body": "Adapted from a recent online discussion. Dear Carolyn: My mom is a bipolar narcissist - the bipolar part diagnosed clinically, the narcissist part by own assessment. She is estranged from me, my sister and my dad, her ex-husband. Unlike my dad and sister, I never foreclosed on the possibility of reconnecting. She has been unpredictable and emotionally abusive at various points, and enough was enough. However, she also has the capacity to be loving, generous and kind - and I am grateful for those times that she was a good mom. I just proposed to my boyfriend. There is no wedding date set yet, but I want to consider having my mom there. It will be thorny, to say the least, with my dad and sister in attendance - and I can't be assured that she won't behave poorly. But my gut tells me that I would feel a tremendous loss without her presence. I am on the fence about inviting her, as it would also mean reestablishing contact and potentially reopening a lot of wounds and relationship conflicts. I also fear that her presence may create more family stress. I cannot decide how to proceed. What are your thoughts? (Nick Galifianakis/for The Washington Post) - Never Foreclosed Never Foreclosed: In my head, I am hearing the red-alert sound from the Enterprise. (The original, because I'm old.) Since \"it would also mean reestablishing contact,\" why peg it to your wedding day? Why don't you reestablish contact for the sake of it, and then make up your mind? Or, probably closer to the truth, let her make up your mind. Dear Carolyn: This might be the oldest question in the book, but here it goes. My boyfriend and I broke up this week. We both love each other, but he wanted to move in and get married and I'm not quite there yet, so we came to a mutual agreement that parting ways was the right decision. I'd still be up for being the best friends we were before we started dating. He wanted no contact because he said talking, emailing or texting, even at a reduced level, would be too painful. Of course, I agreed to his wishes. Is there ever a point where I can check in with him to see what he's up to? We were the best of friends before we ruined everything by falling in love. I miss having him in my life, and I'm genuinely curious about how life is going for him. I don't want to be disrespectful or make things harder by checking in, and I would only do it some predetermined time from now (six months?), but I don't know if it's a good idea at all. - Contacting the Ex? Contacting the Ex?: I think you have to leave him alone unless and until you change your mind about marrying him. Being \"genuinely curious\" is not enough - especially since it's about you, not him. Re: Contacting the Ex: It sounds like the letter-writer is asking, \"Does 'no contact' really mean 'no contact'?\" And yes, yes it does. - Anonymous Anonymous: Right, thanks. No loopholes here. Write to Carolyn Hax at tellme@washpost.com. Get her column delivered to your inbox each morning at wapo.st/haxpost.", 
            "contenttype": "Article", 
            "headline": "Carolyn Hax: Inviting your mentally ill mom to your wedding", 
            "comment": [
                "Is there ever a point where I can check in with him to see what he’s up to? We were the best of friends before we ruined everything by falling in love. \n\nNo, let him be. You can't undo falling in love, the relationship, etc. He's right: a clean breakup is best. Let him contact you if/when he feels up to it. Respect his wishes. That's how you can show him you can still be a great friend.", 
                "I just proposed to my boyfriend.\n\nYay for you! Congratulations! Are you in contact with your mom now? How about getting together with her casually a few times before the wedding to assess how she is and how she may behave? Weddings are so emotional that she may badly react if it's the first time she's around you again (not to mention the whole estranged family).", 
                "Ma'am,\nYour relationship with your boy friend ended - your long term objectives demanded it.  \n\nLong ago I was taught: \"When the ship sets sail, all bills are paid. No regrets.”\n\nRespectfully,\nHawk", 
                "(LW2) it may be a mutual decision but the reason is on her, so any attempt to be friends is up to him.", 
                "I love Carolyn's answer to the first letter: to contact the mother long before the wedding and let that be the starting place to decide about her attendance.  It's really saying, \"were there no wedding in the offing, would you want to reestablish regular relationship contact with your mother?\"", 
                "lw2\n\nHe wanted more and you wanted less.  \nNow he wants less and you want more.\nWhoever wants less, prevails.", 
                "lw1\n\nwhat does your finance have to say ?", 
                "LW2 - Leave him alone and don't reach out anytime soon. You aren't friends anymore, you're his ex that he wanted to stay with but it didn't work out. \nIf he wants to start contacting you again I'm sure he will but you have to let him do it.", 
                "&gt;&gt;What are your thoughts?\n\nYou've listed the pros and cons and played out a scenario  or two.\n\nYour next step is to make a decision.", 
                "LW1, that might be the shortest and best Hax answer I've ever read. I hope that sometime since last September, you've been in touch with your mother. I'm really hoping you write in today.", 
                "LW2, he wants to be married; you want to be friends. Sorry, but those things are incompatible. His desire is proven to be impossible. You'll have to trust that your desire is just as impossible.", 
                "Perhaps LW1 meant to reestablish contact now, with the thought that she would invite her mother to the wedding. It's possible that she will realize how impossible that is if she spends time with her mother now. They may not be speaking to each other by the time the wedding is scheduled.", 
                "And possibly hold the wedding as a carrot.  Tell her you'd like to maintain contact and that you'd really like her to be a part of your wedding but she'd have to work hard in the meantime, stay on her meds and current with her therapy (or whatever she's doing).  Let her know that you won't allow your wedding to be ruined but you'd love to have her there, if altercation is not part of the possibility.  And maybe let her bring a friend as a minder?", 
                "LW proposed to a boyfriend, but could be male.", 
                "Depends how long ago the chat took place.", 
                "Sept. 2016"
            ], 
            "source": "The Washington Post", 
            "theme": [
                "Washington Post", 
                "Nick Galifianakis/for", 
                "Contact"
            ], 
            "primarysection": "Style", 
            "associatedbinaryurl": [
                "https://img.washingtonpost.com/rw/WashingtonPost/Production/Libraries/Common/StandingArt/Comics/2017-04-25/HAX170425.jpg"
            ], 
            "blurb": "Reconnect first, then decide whether she’s ready for your big day (or you’re ready for her)."
        }, 
        {
            "contenturl": "https://www.washingtonpost.com/lifestyle/style/miss-manners-one-crisp-response-can-answer-many-intrusive-questions/2017/04/23/04d75726-1af8-11e7-bcc2-7d1a0973e7b2_story.html", 
            "body": "Dear Miss Manners: Since my husband and I both retired, I am noticing some etiquette situations with friends and acquaintances that are awkward and annoying. I am always taken aback and don't know quite how to respond to these various questions: 1. If I say that I am not up to doing something, and someone asks, \"How come?'' 2. When something needs doing at home and I happen to mention it, and the response is, \"Why can't your husband do it?'' 3. \"Have you had a colonoscopy yet?'' 4. \"When are you going to downsize?'' 5. \"You need to rent a place in the South for the winter.'' 6. \"You and your husband need to get out more.'' 7. \"How many medications are you on?'' 8. \"You shouldn't be eating that.'' 9. \"When are you going to get around to doing such-and-such?'' 10. \"Have you purchased your burial plots yet?'' 11. \"Why doesn't your husband/wife like doing such-and-such anymore?'' 12. \"Why do you need that at your age?'' Thank you for any suggestions! Nice crowd you have there. Miss Manners is tempted to augment question 5 with the suggestion that you move south, or anywhere else, to get rid of them. One suggestion will do to respond to all of these: \"How kind you are to take such an interest in our business.'' Dear Miss Manners: Donation containers for the needy by our cash registers have been relabeled for tips. I felt that was tacky, but since it didn't require any action on my part, I sought to ignore it. Now credit card payments flag the customer screen with a yes/no question: \"Would you like to leave a tip?'' It then flags me that my customer (if they choose to do so) is leaving a tip ... to which I am to give a certain response. I feel this whole tip thing is tacky and rather rude. If I am going to receive a tip, I don't think I should be informed of it. I've seen many price increases, and to ask the customer to give yet more money seems wrong. What do you think? That more people should patronize the restaurants that have decided to abolish tipping. Miss Manners is puzzled that customers don't seem to understand that they pay no more when the cost of labor is built into the prices, and spare themselves possible embarrassment. Dear Miss Manners: When I invite a guest, sometimes before they accept my invitation they say they need to see what's going on that night. Should I rescind the offer so I can invite someone I know will come? I'm not sure I like the \"maybe, man'' attitude. I would either decline or accept. There should be no middle ground. Am I wrong? Your response should be, \"Well, perhaps another time.'' However, Miss Manners does not recommend that you name another time - ever. Why would you want to entertain someone who so clearly hopes that something better will come along? New Miss Manners columns are posted Sundays, Tuesdays and Thursdays on washingtonpost.com/advice. You can send questions to Miss Manners at her website, missmanners.com. 2017, by Judith Martin", 
            "contenttype": "Article", 
            "source": "The Washington Post", 
            "headline": "Miss Manners: One crisp response can answer many intrusive questions", 
            "comment": [
                "Of course, the person invited may need to check his/her calendar. However, they can easily say they will check and respond by a specific (soon) time.", 
                "Invitation questioner should have the grace and courtesy to allow people to 1.  Check with any family or partners; and 2.  Check their calendars.  \nIt seems from the content she is issuing oral invitations and demanding an immediate response without giving time for her invitees to\n\"check what else is going on\"  in terms of already scheduled events, in terms of partner or family plans.\nTo push for an immediate answer for an oral invitation without allowing for that checking is just flat rude.\nIgnorantly rude.\nMiss Manners was wrong in her answer, and very wrong not to call her out on it.", 
                "I'll take the honest route re L3.  I don't always carry my calendar with me, so if caught off-guard by someone inviting me on the spot to a social engagement, sometimes I do have to respond that I need to check my calendar to see if I'm already engaged.  It's not to see if something better has come up - it's just that I'm rapidly aging and don't have my entire social calendar memorized, and sometimes I *do* have to check first before I double-book.", 
                "Exactly!  Any family or partner may have to be checked in with too.", 
                "All very valid points tonight, gentleman!"
            ], 
            "person": [
                "Judith Martin"
            ], 
            "theme": [
                "Dear Miss Manners", 
                "Judith Martin"
            ], 
            "primarysection": "Style", 
            "blurb": "Readers’ friends have a laundry list of inquiries that are overly personal."
        }, 
        {
            "contenturl": "https://www.washingtonpost.com/lifestyle/style/ask-amy-man-at-the-beach-gives-bikinis-a-round-of-applause/2017/04/20/106cd9cc-252e-11e7-bb9d-8cd6118e1409_story.html", 
            "body": "Dear Amy: My wife and I love the beach. We walk on the beach, kayak, picnic and in the summer we swim. When it's hot and the beach is crowded, my wife invariably asks me, \"Are you checking out that girl in the bikini?\" I always say, \"No,\" which is a lie she sees right through. An argument ensues, dampening our otherwise beautiful day. I am in my 50s. I have no delusions of long-term futures with young girls (or anyone else) on the beach, but I love to look at attractive females. I try, apparently unsuccessfully, to be discreet, but my natural instinct is to stand and applaud. I know I sound like a dirty old man, but I doubt I am alone. So, how can I be honest and not hurt my wife? And can we still go to the beach? Lying on the Beach Lying on the Beach: I think many of us in middle age passively admire young and beautiful people without being lascivious (your wife might actually be in this category, but from your own description, you are not). And so no - I won't help you to find a way to check out women in front of your wife. You say you know you sound like a dirty old man, and you're right; you do. In fact, I read this letter to one of my daughters, who rolled her eyes and said, \"Ugh, gross.\" I doubt that was the reaction you were going for. All \"attractive females\" know when they're being checked out. Some may enjoy the attention, but even if they do, the last thing they want on their day at the beach is a round of applause from you. In this context, your wife's feelings are more important than theirs - or yours - because she is the one you're married to. She is (presumably) the woman you're going home with. You have a choice here: Either stop checking out women, or come clean when she catches you and risk an argument. The first choice will make your beautiful beach days continue for many years; the second one will probably lead to her turning these beach trips into solo expeditions. Stop blaming your wife for being frustrated about your inability to keep your eyes in your head. Dear Amy: After nearly 15 years of marriage, my wife and I have yet to agree on the cleaning of dishes. I was taught growing up that dishes are not to be left in the sink. My wife grew up in a family that left everything in the sink until, I suppose, someone had time to clean up. If I don't touch the dishes she's left in the sink, she will clean them up within a few hours. The problem is that she gets mad at me whenever I'm washing one of my own dishes and I ignore hers. I don't mind cleaning other peoples' dishes now and then (and we have young kids, which complicates the problem). But I resent being expected to clean her dishes nearly every time I go to the sink, while she is never left to clean mine. Any thoughts? Feeling Dished Feeling Dished: You are facing an all-too-common domestic question. One obvious solution is that if you want the dishes washed - now - then you should wash them. All of them. I think you know it's obnoxiously passive-aggressive to do only your own. You two are married parents, not Craigslist roommates. You should each step up and do things that need to be done without keeping score. In my household, whoever cooks doesn't have to do the dishes. It's a pretty simple equation. Getting them washed before breakfast the next day seems like a reasonable goal. I'm sure there are things you do (or don't do) around the house that drive your wife crazy, too, so maybe it's time to revisit the distribution of labor. Also, get your children involved. The kids in my life love having jobs; I have a photo of my 5-year-old nieces loading the dishwasher with such precision and glee, you'd think they were on a trip to Disneyland. I'd love to hear from other readers here. How do you settle household-chore debates? Dear Amy: The letter from \"Disturbed Dad\" literally made me sick. This dad was trying to teach his young children that stepfamilies aren't \"real\" relatives. Thank you for reeducating him. Grateful for My Steps Grateful for My Steps: Many readers responded as you have. Thank you. © 2017 by Amy Dickinson distributed by Tribune Content Agency", 
            "contenttype": "Article", 
            "source": "The Washington Post", 
            "headline": "Ask Amy: Man at the beach gives bikinis a round of applause", 
            "comment": [
                "Either your wife wants an argument when she asks you or you are doing it so blatantly that she is embarrassed for the both of you. I've betting on the latter. I think your stance on 'standing and applauding 'is rather creepy but every guy at a beach is looking at women at some point. They've just mastered the art of not being the guy whose head literally goes from left to right as a woman walks by.", 
                "LW1 : What everyone else said, plus this.... wear sunglasses and stop moving your head. Amateur!", 
                "Baggy shorts, too, if he's standing up and applauding.", 
                "LW2) Keeping track in a marriage is never a good thing.  One of the deacons at my church told me during marital preparation that marriage is never 50/50.  One of us will always be giving more. You might want to consider that you will contribute more to dishes and think about other areas where your wife contributes more.  If you cannot do that, I wonder how long your marriage can last with you trying to keep things \"fair\" and balanced.", 
                "LW1) Amy nailed it. You do sound like a dirty old man, and I bet you're not much to look at either which is usually the case with older men who are so obviously checking out younger women in a disgusting manner. \nWe can all appreciate beauty, but it sounds like you're going overboard. You should go to the beach by yourself and stare away on your own and not in the presence of your wife.", 
                "Ick no thanks, don't come to the beach by yourself either - even if they wife isn't there, you'll still be making the women feel uncomfortable and spoiling their days.  Just learn to not be so gross.  I check out hot men all the time but somehow manage to do it without anyone noticing.", 
                "LW2, you're seriously acting like such a child? \"I'll wash my dish, but not yours.\" Who washes the pots? Serving dishes? Maybe you only eat take-out.\n\nYou missed part of the lesson, or you had a very odd family. Did you all line up at the sink to wash your own plates? Wash 'em all or be quiet.", 
                "This is a LW that I'd love to hear back from after he gets divorced. He sounds so idiotic I hope it's a fake letter.", 
                "You know what's funny? The more idiotic they sound, the more real I think they are. This guy wrote this. I'm picturing him waiting for the day the baby is old enough to wash her own dish.", 
                "😂", 
                "LW1, looking + lying about looking = pond scum (you're dirty, but you're not old).\n\"Yeah, I looked. She's cute.\"\nToo bad changing that up isn't going to work with your first wife.", 
                "Like the \"First Wife\" comment.", 
                "LW1:  Try something new.  Dance with the one who brung ya."
            ], 
            "person": [
                "Amy Dickinson"
            ], 
            "theme": [
                "Tribune Content Agency", 
                "Beach Trips"
            ], 
            "primarysection": "Style", 
            "associatedbinaryurl": [
                "https://img.washingtonpost.com/rw/2010-2019/WashingtonPost/2016/08/31/Production/Daily/Style/Images/askamy.jpeg"
            ], 
            "organization": [
                "Tribune Content Agency"
            ], 
            "blurb": "Married reader wants permission to stare at women while sitting next to his wife."
        }, 
        {
            "contenturl": "https://www.washingtonpost.com/lifestyle/style/hints-from-heloise-card-with-a-catch/2017/04/20/7eeb6938-2531-11e7-bb9d-8cd6118e1409_story.html", 
            "body": "Dear Heloise: My part-time job at a retailer offers direct deposit into my checking account. The retailer also can deposit my pay onto a prepaid card. It's like a credit card, but if I need cash, I use an ATM, which charges me a fee. Please tell your readers to read the fine print! A Worker Bee in Dallas Worker Bee in Dallas: Thanks for the good information that I'm more than happy to pass along! Readers, a prepaid (payroll) card is like a debit or gift card. There is no bank account to withdraw from or even check your balance. An employer \"deposits\" or \"loads\" your wages onto the card. You can shop, pay bills, etc., like it's a regular credit card. However, when getting money from an ATM, you have to pay the ATM fee to get your money! So, if you need cash, take out more than you think you will use, so there is only a one-time fee. Dear Heloise: My complaint is people who throw their garbage in the trash can unwrapped. It stinks! As soon as the lid is lifted, the wind blows papers out, and as the men lift to dump the trash, corncobs, watermelon rinds and apple peels fall out - ugh! The smell from the trash cans is awful. I wrap my garbage in recycled bags. I feel for the trash pickup men who have to smell all that trash. A Reader in Boardman, Ohio Reader in Boardman, Ohio: You are right: The trash should be contained so it doesn't fly about, and corncobs, apple peels, etc., should go in the compost pile, if possible. Wet garbage can be put in a store plastic bag, tied and then put into the garbage can. Here's how I clean the big outdoor trash can: vinegar and dish soap! Put several cups of vinegar and a big squirt of dishwashing soap in the trash can, fill with water about one-third of the way and scrub with a broom. Dump out, rinse and let the can dry in the sun. Vinegar is handy for so many uses around the house, and it is cheap, readily available and safe to use. Would you like to receive a collection of my favorite vinegar helpers and how-tos? Visit Heloise.com to order a pamphlet, or send $5, along with a long, stamped (70 cents), self-addressed envelope, to: Heloise/Vinegar, P.O. Box 795001, San Antonio, TX 78279-5001. You can hang a car deodorizer on the inside of the trash can to help keep it fresh. Dear Readers: If you enter drawings or sweepstakes, or when signing on for a subscription, your name can end up on a mailing list! My Heloise Hint: Use variations and initials of your name. Dear Heloise: When I want to freshen up my throws and bedspreads, I take them outside and give them a good shakeout. The fresh air helps, too. M.B., Fayetteville, Ark. Heloise's column appears six days a week at washingtonpost.com/advice. Send a hint to Heloise, P.O. Box 795000, San Antonio, Tex. 78279-5000, or email it to Heloise@Heloise.com. 2017, King Features Syndicate", 
            "contenttype": "Article", 
            "headline": "Hints From Heloise: Card with a catch", 
            "comment": [
                "Heloise fails to tell us what is accomplished by using  variations and initials of your name when entering drawings and sweepstakes.  This will not keep your name from being added to  someone's mailing list.", 
                "Really, Heloise?  You turn a reader suggestion about bagging trash before tossing it in the trash can into yet another vinegar vehicle?   I'm surprised you didn't tell LW1 to wipe her prepaid payroll card with vinegar to keep it fresh and clean - you know how those ATM swipe things collect the dirt!!!"
            ], 
            "source": "The Washington Post", 
            "theme": [
                "Dear Heloise", 
                "Worker Bee", 
                "San Antonio", 
                "Trash Pickup Men"
            ], 
            "primarysection": "Style", 
            "organization": [
                "Worker Bee"
            ], 
            "blurb": "Payroll cards have a potential cost attached.", 
            "location": [
                "San Antonio"
            ]
        }
    ]
}